[{"title": "Non-normative Sexuality and Popular Culture", "publisher_and_location": "Panic at the Discourse: An Interdisciplinary Journal", "submission_deadline": "Friday, April 17, 2020", "description": "We invite submissions for the 2020 issue of Panic at the Discourse: An Interdisciplinary Journal, an online publication associated with Queen’s University. Papers spanning any discipline are welcome, and in particular, we support new and innovative ways of theorizing that do not necessarily fit within traditional frameworks. The deadline for submissions is April 17, 2020."}, {"title": "Call for Papers | Vol 2: Issue I – Electronic Research Journal of Social Sciences and Humanities", "publisher_and_location": "Chief Editor Dr Ahmad Saeed", "submission_deadline": "Friday, April 10, 2020", "description": "Call for Papers | Vol 2: Issue I – Electronic Research Journal of Social Sciences and Humanities ( http://www.eresearchjournal.com/) ,Scope:"}, {"title": "Surveillance and Social Justice: Big-data politics, predictions, and potentials", "publisher_and_location": "Leanne McRae, Mike Kent, Curtin University", "submission_deadline": "Wednesday, April 1, 2020", "description": "Extended Call for Papers: Now due April 2020 ,Surveillance and Social Justice: Big-data politics, predictions, and potentials ,Edited by Dr Leanne McRae (Curtin University), and Associate Professor Mike Kent (Curtin University) ,Abstracts Due: 1 April 2020 , https://sites.google.com/site/cultware/current-research/surveillance-and..."}, {"title": "REMINDER: CFP Benjamin Markovits | A one-day conference in Oxford| 16 June 2020", "publisher_and_location": "Michael Kalisch, University of Oxford", "submission_deadline": "Friday, April 3, 2020", "description": "CALL FOR PAPERS ,Benjamin Markovits ,16th June 2020 ,A one-day conference at Worcester College, Oxford ,Registration is free"}, {"title": "Dickens and Decadence", "publisher_and_location": "Stockholm University", "submission_deadline": "Sunday, May 31, 2020", "description": "Dickens and Decadence ,Stockholm University, Sweden ,Deadline for submissions: 31 May 2020 ,  ,Department of English and Department of Culture and Aesthetics ,Stockholm University ,17-18 December 2020 ,Conference Homepage: https://www.english.su.se/2.60277 ,  ,Keynote speakers: John Bowen (York), Dennis Denisoff (Tulsa), and Claire Wood (Leicester)"}, {"title": "International Journal of Humanities, Art and Social Studies (IJHAS)", "publisher_and_location": "publisher", "submission_deadline": "Saturday, March 14, 2020", "description": "http://flyccs.com/jounals/IJHASS/Home.html ,                                                                                                                          Paper Submission : Submission System. ,  ,Scope"}, {"title": "International Journal of Information Technology (IJIT)", "publisher_and_location": "book publisher", "submission_deadline": "Tuesday, March 10, 2020", "description": "International Journal of Information Technology (IJIT) ,ISSN : 1834-624N 2974-5962 (Print) ,***March Issue ***http://flyccs.com/jounals/IJIT/Home.html ,  ,Scope"}, {"title": "Migrations and Disaporas in American Multi-Ethnic Literature (Guaranteed MELUS Panel for MLA 2021)", "publisher_and_location": "MELUS: The Society for the Study of Multi-Ethnic Literature of the United States", "submission_deadline": "Sunday, March 15, 2020", "description": "MELUS: The Society for the Study of Multi-Ethnic Literature of the United States, is an MLA Allied Organization, meaning that we organize a guaranteed panel for each MLA conference. For MLA 2021, MELUS invites papers that consider the aesthetic and cultural implications of migrant movement and diasporic historical consciousness, engaging with issues of space, mobility, identity, and resistance in US multi-ethnic literatures. Submit titled proposals (250 words), a brief CV, and AV needs to Stella Setka at setkasn@wlac.edu by Sunday, March 15, 2020."}, {"title": "Modernist Materialisms (MSA Panel)", "publisher_and_location": "Modernist Studies Association", "submission_deadline": "Monday, March 16, 2020", "description": "For most of its history, materialism was, as Althusser aptly phrased it, an “underground” tradition, dissident if not altogether heretical. And yet scholars have recently begun to show how this tradition infuses the thought of canonical figures within modernism, from Stevens to Man Ray, and how their once-overlooked engagement with objects and the material effectively subtends their ontologies and political commitments. This proposed panel invites papers that explore modernist materialisms, looking at theoretical innovations, artistic experimentations, and/or political engagements. How do modernist writers and artists rethink the orthodox ways of relating to objects, things, and nonhuman bodies?"}, {"title": "Tearing down Walls: Influences and Reciprocity in American and Post-Soviet Literature", "publisher_and_location": "Saint Martin's University", "submission_deadline": "Friday, April 3, 2020", "description": "Tearing down Walls: Influences and Reciprocity in American and Post-Soviet Literature , Abstract: April 3, 2020 ,Completed First Draft: August 15, 2020 ,  ,Jeff Birkenstein & Robert Hauhart, Saint Martin’s University (Lacey, Washington) ,Contact email: jbirkenstein@stmartin.edu"}, {"title": "(Update on) Situations Annual Conference 2020 (Deadline Changed)", "publisher_and_location": "Yonsei University, Korea", "submission_deadline": "Tuesday, April 21, 2020", "description": "(Update on) Situations Annual Conference 2020 ,  ,Between Asia and Europe: Whither Comparative Cultural Studies? ,  ,University of Ljubljana, Ljubljana, Slovenia  ,21-22 May, 2020 ,  ,  ,** Please note that we have moved up the deadline for your 4,000-word proposal, which includes a 100-word bio statement and a 150-word abstract, to April 21st, 2020."}, {"title": "Call for full chapters for an edited collection for Palgrave Macmillan (contract signed) entitled \"The Performativity of Villainy and Evil in Anglophone Literature and Media\"", "publisher_and_location": "University of Gafsa, Tunisia", "submission_deadline": "Tuesday, March 31, 2020", "description": "Call for Chapters for an edited collection on the performativity of villainy and evil in literature and  media"}, {"title": "MLA 2021 Panel: Science on the Margins: Rethinking the Global Histories of Sexology", "publisher_and_location": "Rovel Sequeira", "submission_deadline": "Sunday, March 15, 2020", "description": "This panel mobilizes the semantic compass of the concept “margin” to rethink the global histories of sexual science. Essentialist accounts of sexology have concentrated on its origins in the Western, primarily German, academy as a distinct “Sexualwissenschaft” or institutionalized science of sex that effected profound shifts in sexual knowledge and subjectivity. And yet sexology was often itself a marginal form of knowledge that emerged at the edges of more well-established disciplines like biomedicine, psychiatry, anthropology, zoology, anthropometry and propelled technologies of endocrinology, eugenics, and population control."}, {"title": "Weird Sciences and the Sciences of the Weird", "publisher_and_location": "PULSE: the Journal of Science and Culture", "submission_deadline": "Tuesday, June 30, 2020", "description": "Recent scientific discoveries in climatology, animal cognition and microbiology have radically altered our conceptions of ourselves and the environment we live in, both on micro and macroscales. Zooming in on the human microbiome and out to the planetary ecosystem, or even further into infinite cosmic spaces, the sciences are revealing strange dynamics of human-nonhuman interconnectedness, doing away with the established anthropocentrism and the idea of human exceptionalism."}, {"title": "RMMLA English Nineteenth-Century Literature", "publisher_and_location": "Rocky Mountain  Modern Language Association", "submission_deadline": "Tuesday, March 31, 2020", "description": "Rocky MountainModern Language AssociationSeventy-fourth annual convention ,October 8-10, 2020 ,Boulder, Colorado | Millennium Harvest House Hotel ,English Nineteenth-Century Panel ,The 2020 Convention of the Rocky Mountain Modern Language Association welcomes abstracts related to English Nineteenth-Century Literature. Ranging from the Regency to the Victorian era, the Nineteenth Century was an eclectic time facing significant social, political, and economic changes. Considering this period of change (and perhaps even how our own time is one of change) we invite abstracts dealing with, but not limited to topics such as:"}, {"title": "MSA 2020 - Street Smarts: On Modernist Know-How", "publisher_and_location": "Modernist Studies Association (Brooklyn NY, Oct. 22-25, 2020)", "submission_deadline": "Friday, March 13, 2020", "description": "This panel pursues MSA's conference theme this year, \"Streets,\" by discussing \"Street Smarts.\"   ,Modernism has its smart sets, not just Mencken’s but in Stein’s salons and Woolf’s Bloomsbury, and in the serious philosophical engagements (and antipathies) of T.S. Eliot, Dora Marsden, Samuel Beckett, and others. But how do “street-smarts” inform conversations about modernism’s epistemological and intellectual positions? How do the streets, with their marginal figures and spaces, refine critical views of what counts as knowing? How do the streets re-orient epistemology with a phenomenology of everyday things?"}, {"title": "Questioning the Human: Posthuman accounts in Popular Culture", "publisher_and_location": "Language, Literature, and Interdisciplinary Studies (LLIDS)", "submission_deadline": "Wednesday, April 15, 2020", "description": "Two broadly anthropocene concerns—the ‘human’ condition along with the condition of this human planet, Earth—bear on all discursive practices central to contemporary areas of research in humanities, social sciences, and sciences. Both these concerns reconfigure ways in which humans have come to make sense of themselves and of the world which they share with other forms of life. The anthropocene—ramifications of Cartesian vision of human subject, the giver of meaning, that ultimately subdues all nature and co-existing life-forms—however is challenged by a posthuman turn in the latter half of 20th Century that trenchantly undercuts the foundations of humanism catapulting from the set boundaries established by the ideal of Enlightenment."}, {"title": "CALL FOR PAPERS – SUMMER 2020", "publisher_and_location": "Language, Literature, and Interdisciplinary Studies (LLIDS)", "submission_deadline": "Sunday, March 15, 2020", "description": "CALL FOR PAPERS – SUMMER 2020 ,Language, Literature, and Interdisciplinary Studies (LLIDS), an open access academic e-journal, invites original and unpublished research papers and book reviews from various interrelated disciplines including, but not limited to, literature, philosophy, psychology, anthropology, history, sociology, law, ecology, environmental science, and economics."}, {"title": "International Journal of Education", "publisher_and_location": "book publisher", "submission_deadline": "Saturday, March 7, 2020", "description": "International Journal of Education (IJE)  ,ISSN : 1839-519N 2974-5962 (Print)***March Issue *** ,http://flyccs.com/jounals/IJEMS/Home.html   ,  ,  ,Scope"}, {"title": "[Deadline extended] Routledge Companion to Global Literary Adaptations in the 21st Century", "publisher_and_location": "Liz Ho & Brandon Chua: University of Hong Kong", "submission_deadline": "Sunday, April 5, 2020", "description": "Routledge Companion to Global Literary Adaptation in the Twenty-First Century"}, {"title": "The End is Here - Creative Writing Collection", "publisher_and_location": "Spectral Visions Press (University of Sunderland)", "submission_deadline": "Monday, March 30, 2020", "description": "Spectral Visions Press is now accepting submissions for The End is Here: A Book about the Apocalypse. We want to hear your unique take on the fall of civilisation, we want to see your visions of our potential future, and we want to journey into your dystopic worlds. If you have a story or poem that fits the brief, start submitting. ,• Minimum 1,000 words, maximum of 5,000 words of prose or 30 lines of poetry. ,• Submissions should be formatted as a word document; we cannot work with pdf. ,• Submissions should be double-spaced, use a neutral font style, and font size of eleven."}, {"title": "Cultural History; PAMLA (November 12-15, 2020)", "publisher_and_location": "Pacific Ancient & Modern Languages Association", "submission_deadline": "Sunday, May 17, 2020", "description": "The 118th annual conference of the Pacific Ancient & Modern Languages Association (PAMLA) will be held at the Sahara Las Vegas Hotel, from Thursday, November 12, to Sunday, November 15."}, {"title": "Voice, Silencing, and Appropriation (MLA 2021)", "publisher_and_location": "Lisa Propst / Clarkson University", "submission_deadline": "Sunday, March 15, 2020", "description": "This session addresses tensions between efforts to combat injustice or silencing through literary/artistic representation and dangers of appropriating other people’s stories; formal strategies that negotiate the dangers of appropriation; ways of asserting responsibility to the people depicted on the page rather than authority over their stories. Discussion of all genres and media welcome. Please send 250w abstract and brief bio to lpropst@clarkson.edu and ewulanda@clarkson.edu by March 15. ,This is a call for papers for a proposed special session at the 2021 MLA Convention in Toronto."}, {"title": "Soundings: An Interdisciplinary Journal", "publisher_and_location": "Society for Values in Higher Education", "submission_deadline": "Monday, March 1, 2021", "description": "Soundings: An Interdisciplinary Journal invites essays on topics related to any and all aspects of the human condition, particularly aesthetic, moral, political, economic, scientific, and religious values. We welcome work from a variety of disciplinary and especially interdisciplinary approaches, including the arts, cultural studies, history, literature, philosophy, and religion. Reviews of books, films, and exhibits are also welcome."}, {"title": "Materialisms: Reconciliations in the Present", "publisher_and_location": "University of Minnesota, Twin Cities", "submission_deadline": "Monday, June 1, 2020", "description": "Materialisms: Reconciliations in the Present Graduate Student Conference October 2-3, 2020 ,University of Minnesota, Twin CitiesDepartment of Cultural Studies and Comparative Literature ,  ,Call for Papers"}, {"title": "MLA 2021: The Position of Fascism in American Culture", "publisher_and_location": "Modern Language Association Annual meeting", "submission_deadline": "Sunday, March 15, 2020", "description": "****This is a CFP for MLA 2021*** In Habeas Viscus (2014), Alexander Weheliye invokes metonyms of Nazism, European colonialism, and American slavery, revising Paul Gilroy to argue, \"the concentration camp, the colonial outpost, and the slave plantation suggest three of many relay points in the weave of modern politics, which are neither exceptional nor comparable, but simply relational.\" However, where Gilroy and Weheliye are particularly interested in how colonial practices preceded and underwrote fascism, they also raise the question of how fascism relates and returns to America.  Over the past six years, beginning with Christopher Vials's Haunted by Hitler (2014), there have been a number of significant scholarly works that"}, {"title": "South Asia and Its Diaspora, RMMLA 2020 Boulder, Colorado", "publisher_and_location": "Rocky Mountain Modern Languages Association", "submission_deadline": "Wednesday, April 15, 2020", "description": "RFP - South Asia and Its Diaspora, Creative WorkSouth Asia is well known for its enormous creative output in terms of fiction. We invite creative writers to submit short fiction (not more than 3000 words) to be read as part of a panel that represents the theme of identity. Selections from a larger work that speaks directly to some aspect of identity specific to the region, or a stand-alone short piece are welcome. Please note that due to time constraints, each author will be given no more than 20 minutes to read their work. RFP - South Asia and Its Diaspora, Critical AnalysisWe invite papers on the broad theme of how cultural texts deal with nationalism in the twenty first century."}, {"title": "A Critical Companion to Terry Gilliam", "publisher_and_location": "Dr. Sabine Planka", "submission_deadline": "Monday, June 15, 2020", "description": "A Critical Companion to Terry Gilliam ,Edited by Ian Bekker, Sabine Planka and Philip van der Merwe"}, {"title": "Midwest Popular Culture Association/Midwest American Culture Association Annual Conference — Television Area", "publisher_and_location": "Cory Barker, Bradley University", "submission_deadline": "Thursday, April 30, 2020", "description": "CALL FOR PAPERS, ABSTRACTS, AND PANEL PROPOSALS ,Midwest Popular Culture Association/Midwest American Culture Association Annual Conference — Television Area ,Friday-Sunday, 2-4 October 2020 ,Minneapolis, Minnesota ,Westin Minneapolis ,Address: Westin Minneapolis: 88 South 6th Street, Minneapolis MN 55402 Phone: (612) 333-4006"}, {"title": "LANGUAGE, LITERATURE AND NATURE: Ninth International Conference on Language and Literary Studies", "publisher_and_location": "Alfa BK University (Belgrade, Serbia), Faculty of Foreign Languages", "submission_deadline": "Tuesday, March 31, 2020", "description": "Dear colleagues, ,  ,The Faculty of Foreign Languages (Alfa BK University in Belgrade) is glad to announce its Ninth International Conference on Language and Literary Studies, which will be held on 22–23 May, 2020. ,  ,For the ninth issue of our annual conference, we hope to gather scholars, teachers and professionals whose scientific research focuses on the study of ,  ,LANGUAGE, LITERATURE AND NATURE"}, {"title": "\"Movement through Arthurian Legend\" Bangor English Medievalism Transformed 2020", "publisher_and_location": "School of English, Bangor University", "submission_deadline": "Wednesday, April 1, 2020", "description": "\"Movement through Arthurian Legend\"  ,Medievalism Transformed 2020 explores all historical and literary ideas relating to the theme of movement in the medieval world. How are texts re-invented across time? What role do texts play as cultural objects in their historical moment and beyond? How does a text engage with moving times, cultures, and space? ,We invite papers relating to movement through Arthurian legend crossing all periods, borders, and historical and literary disciplines including but not limited to:"}, {"title": "Critical Misanthropy - A Symposium", "publisher_and_location": "University of Amsterdam", "submission_deadline": "Wednesday, April 1, 2020", "description": "Critical Misanthropy: A Symposium ,15th May 2020 ,University of Amsterdam ,Organizers: Emelia Quinn and Eva Meijer ,Keynote speaker: Robert McKay"}, {"title": "CFP CLOSING SOON: Edited Collection – Ryan Murphy: Genre, Gender and Authorship", "publisher_and_location": "Melanie Robson", "submission_deadline": "Wednesday, April 1, 2020", "description": "CFP CLOSING SOONEdited Collection – Ryan Murphy: Genre, Gender and AuthorshipEditors: Dr. Melanie Robson (UNSW Sydney), Dr. Jessica Ford (University of Newcastle, Australia) and Dr. Phoebe Macrossan (Queensland University of Technology)In his 20 years in the US television industry Ryan Murphy has amassed a large and diverse body of television work. Murphy exemplifies the modern TV mogul, operating as an executive producer, creator, showrunner, writer and director on a wide range of series."}, {"title": "Pedestrian Modernisms – Politics and Poetics of Walking", "publisher_and_location": "Apala Das", "submission_deadline": "Sunday, March 15, 2020", "description": "Pedestrian Modernisms – Politics and Poetics of Walking ,MSA 2020, Brooklyn, USA ,Please send 300-350 word abstracts to S.Sengupta@sussex.ac.uk or dasapala1@gmail.com by 15th March, 2020."}, {"title": "Getting Medieval on Popular Culture at MAPACA 2020", "publisher_and_location": "Michael A. Torregrossa / Association for the Advancement of Scholarship and Teaching of the Medieval in Popular Culture", "submission_deadline": "Monday, June 15, 2020", "description": "Getting Medieval on Popular Culture at MAPACA 2020 ,Submissions by 15 June 2020 ,The Association for the Advancement of Scholarship and Teaching of the Medieval in Popular Culture seeks submissions for the following sponsored roundtable and papers sessions to be included in the Medieval & Renaissance Area for the 2020 meeting of the Mid-Atlantic Popular & American Culture Association to be held at the Princeton Marriott at Forrestal, Princeton, New Jersey, from 5-7 November 2020."}, {"title": "Trauma and Horror", "publisher_and_location": "English Language Notes", "submission_deadline": "Tuesday, September 1, 2020", "description": "“Trauma and Horror” ,ELN (English Language Notes) 59.2, Fall 2021 (Duke University Press) ,Editor: Kelly Hurley, University of Colorado at Boulder"}, {"title": "SCMLA - Renaissance Literature Excluding Drama", "publisher_and_location": "South Central Modern Language Association", "submission_deadline": "Friday, April 10, 2020", "description": "We are currently accepting submissions for the Renaissance Literature Excluding Drama panel taking place at the 2020 South Central Modern Language Association annual conference. The conference will be held in Houston, TX, on October 8-10. We welcome papers on any and all non-dramatic literary Renaissance works, including works from the English Renaissance/Early Modern period. From Machiavelli to Milton and Cervantes to Stanley, all works of poetry and prose are open for consideration. Neither the conference nor the panel have a theme, so we welcome papers with a wide range of topics. The deadline to submit abstracts is April 10, 2020. Please email your 250-word abstracts to chair Ali Webb at mwebb26@lsu.edu."}, {"title": "“Old English” at the 74rd Annual RMMLA Convention", "publisher_and_location": "Rocky Mountain Modern Language Association", "submission_deadline": "Tuesday, March 31, 2020", "description": "“Old English” at the 74rd Annual RMMLA Convention ,October 8-10, 2020 ,Boulder, CO ,  ,Deadline for Abstracts: March 31, 2020"}, {"title": "William S. O'Farrell Fellowship, Northeast Historic Film", "publisher_and_location": "Northeast Historic Film", "submission_deadline": "Thursday, March 5, 2020", "description": "WILLIAM O'FARRELL FELLOWSHIP 2020Northeast Historic Film, Maine www.oldfilm.org_____________________________________________________________________________Northeast Historic Film announces the eleventh year of the William O’Farrell Fellowship, awarded toan individual engaged in research toward a publication, production, or presentation based on movingimage history and culture, particularly amateur and nontheatrical film."}, {"title": "EXTENDED DEADLINE MLA 2021: Practices of Persistence: Women's Authorial Labor in Seventeenth-Century England and the New World", "publisher_and_location": "Lauren Mamolite / Wagner College", "submission_deadline": "Sunday, March 15, 2020", "description": "This panel invites papers addressing how seventeenth-century women’s authorial labor constituted and/or negotiated practices of persistence that were considered necessary to confront the transatlantic New World, including but not limited to willfullness, fortitude, sacrifice, and endurance. A variety of disciplinary and methodological approaches welcome. Please submit 250 word abstract and brief biography to lauren.mamolite@wagner.edu."}, {"title": "MLA 2021: Women Writers and WWII Intelligence", "publisher_and_location": "Beatriz Lopez / Durham University", "submission_deadline": "Sunday, March 15, 2020", "description": "George Orwell and Graham Greene are well-known propagandists, but the role of women writers in WWII intelligence remains understudied. Abstracts are invited for papers addressing the influence of women's intelligence work on their literary writing. Please submit 250-word abstract and 50-word bio to Beatriz Lopez (beatriz.lopez-lopez@durham.ac.uk) by 15th March 2020."}, {"title": "\"Victorian Cultures of Collectivity\" at the Midwest Modern Language Association Conference", "publisher_and_location": "Midwest Victorian Studies Association panel at the Midwest Modern Language Association Conference", "submission_deadline": "Sunday, April 5, 2020", "description": "CALL FOR PAPERS 2020 MMLA Conference’s MVSA-Affiliated Panel ,Milwaukee, Wisconsin ,November 5-8, 2020 ,“Cultures of Collectivity” ,  ,In keeping with the MMLA conference theme, “Cultures of Collectivity,” the Midwest Victorian Studies Association panel welcomes proposals that explore myriad examples of cultural collectivity in 19th century Britain. ,  ,Possible topics include but are not limited to:"}, {"title": "Visualizing Cultures and Collectivity in the Classroom: Teaching Graphic Narratives (MMLA 2020)", "publisher_and_location": "Midwest Modern Language Association", "submission_deadline": "Sunday, April 5, 2020", "description": "CFP: Visualizing Cultures and Collectivity in the Classroom: Teaching Graphic Narratives (MMLA 2020)"}, {"title": "Feminist Detection in Contemporary Literature, Media, and Culture", "publisher_and_location": "Meghan Gilbert-Hickey, Sara K. Day, Sonya Sawyer Fritz", "submission_deadline": "Tuesday, March 3, 2020", "description": "Detective fiction has historically been dominated by male individuals who represent a raced, classed, and gendered form of knowledge. From Sherlock Holmes to twentieth-century figures such as Hercule Poirot and Sam Spade, the iconic detective has traditionally been embodied by a white man, with characteristics that echo Anglo-European colonialist discourse: the detective deduces, discovers, pursues, and reveals; he is full of agency and reason, bringing meaning and order to darkness and mystery."}, {"title": "Close Up Encounters: Film, Modernism & the Metropolis MSA 2020 Panel", "publisher_and_location": "Polly Hember (Royal Holloway, University of London)", "submission_deadline": "Monday, March 16, 2020", "description": "From ‘city symphonies’ to the German querschnitt or ‘cross-section’ films of the 1920s and 1930s, cinema and the modernist city are tightly bound in a catalytic dialogic."}, {"title": "Anthology Call: Craft Essays from Marginalized Perspectives", "publisher_and_location": "Human/Kind Press", "submission_deadline": "Monday, June 15, 2020", "description": "Human/Kind Press seeks submissions of craft essays for an anthology exploring connections between identity and narrative craft. How can a marginalized identity bring a new perspective to how writing works? How can a marginalized identity challenge and/or complicate an old idea about how writing works? Essays should explore the connection between at least one marginalized identity and one craft element of fiction (such as characterization, interiority, or verisimilitude). This anthology seeks to give a platform to writers of diverse backgrounds and identities, including but not limited to queer writers, writers of color, and disabled/chronically ill writers. 1,500-4,500 word craft essays accepted. No submission fee. Contributors will be paid $20."}, {"title": "Back Talk: Women's Writing, Modernism and Resistance", "publisher_and_location": "Modernist Network Cymru", "submission_deadline": "Friday, March 27, 2020", "description": "Back Talk: Women’s Writing, Modernism and Resistance  ,The Third Modernist Network Cymru Conference  ,Cardiff University, Cardiff, Wales, UK  ,17-18 June 2020  ,Keynote speakers: Prof. Kirsti Bohata (CREW, Swansea University), Prof. Diana Wallace (University of South Wales)  ,  ,Co-organised by Josie Cray, Elizabeth English and Siriol McAvoy"}, {"title": "Care: A Symposium in Praxis & Theory", "publisher_and_location": "Massachusetts College of Liberal Arts (MCLA) & Massachusetts Museum of Contemporary Art (MASS MoCA)", "submission_deadline": "Saturday, April 25, 2020", "description": "The Mind’s Eye, a research & praxis initiative of Massachusetts College of Liberal Arts (MCLA) in collaboration with Massachusetts Museum of Contemporary Art (MASS MoCA) invites scholars, critics, visual artists, creative writers, activists, curators, and other cultural practitioners to submit abstracts for an interdisciplinary symposium engaging “care” as a praxis and theoretical framework. “Care: A Symposium in Praxis & Theory” will be held at MASS MoCA on Friday, November 6, 2020."}, {"title": "Political Demonologies: Race, Gender, and Coloniality in a Postsecular Age (EXTENDED DEADLINE)", "publisher_and_location": "University College Dublin", "submission_deadline": "Sunday, March 22, 2020", "description": "Political Demonologies: Race, Gender, and Coloniality in a Postsecular Age ,  ,May 15–16, 2020, University College Dublin, Ireland ,  ,EXTENDED ABSTRACT DEADLINE: March 22. ,  ,Confirmed Keynote Speakers:  ,C. Heike Schotten (University of Massachusetts, Boston) ,Selamawit D. Terrefe (Tulane University)"}, {"title": "Economy and Value of Time in Boredom", "publisher_and_location": "MLA 2021 in Toronto", "submission_deadline": "Sunday, March 15, 2020", "description": "The word boredom has been in circulation since Ancient times, in the shape of a variety of synonyms --acedia, taedium vitae, horror loci, melancholy, ennui, spleen-- and bearing a theological stamp, since it was believed to be a demonic sin in the Christian tradition. In modernity, however, for the “enlightened subject” (Goodstein, 4), as a response to social and economic transformations, boredom has become a secular experience concerned with temporality, signifying loss of meaning and feeling of emptiness in the pace of modern life. In critical circles, boredom remains a hybrid phenomenon that brings together a variety of contradictory definitions."}, {"title": "Conservative Counter-Revolutions", "publisher_and_location": "MLA -- CLCS Nineteenth Century Forum", "submission_deadline": "Sunday, March 15, 2020", "description": "Conservative Counter-Revolutions: Papers on Nineteenth-century conservatism(s) that emerged in reaction to the century's revolutions and reforms, and on the consequent radicalization of conservatism that still informs it today. 300-word abstracts by March 15th to dwhite@emory.edu"}, {"title": "Humanities on the Brink: Energy, Environment, Emergency", "publisher_and_location": "Bart Welling, Jacob Goessling, and Jordan B. Kinder / Association for the Study of Literature and Environment", "submission_deadline": "Wednesday, April 1, 2020", "description": "Call for Papers, Submission Deadline April 1, 2020. ,Humanities on the Brink: Energy, Environment, Emergency ,A Nearly Carbon-Neutral (NCN) online symposium sponsored by the Association for the Study of Literature and Environment (ASLE) and hosted by the University of California, Santa Barbara ,July 10-31, 2020 ,Is it time to panic yet?"}, {"title": "The Body at Work: Gender, Labour, Migration // Le Corps à la besogne: Genre, travail, migration", "publisher_and_location": "Leslie Barnes / Australian national University", "submission_deadline": "Monday, May 4, 2020", "description": "The Body at Work: Gender, Labour, Migration ,University of London, Paris ,20 November 2020 ,Keynote Speaker: Manuela Martini, Université Lumière Lyon 2"}, {"title": "Inventing Time in the Sixteenth Century", "publisher_and_location": "MLA 2021 sponsored panel (LLC 16th-Century English Forum)", "submission_deadline": "Sunday, March 15, 2020", "description": "The LLC 16th-Century English Forum invites submissions for \"Inventing Time in the Sixteenth Century\" at MLA 2021 in Toronto: ,How does sixteenth-century writing challenge current critical approaches to time and/or the future? What unique investigations might it prompt or support? What kinds of time has it invented? Have such temporal experiments and inventions persisted? Send 300-word abstract and two-page CV to J.K. Barret (jkbarret@austin.utexas.edu) no later than March 15, 2020.  ,https://mla.confex.com/mla/2021/webprogrampreliminary/Paper13156.html"}, {"title": "Playing with/for Time: Nabokov's Persistent Images (MLA Convention 2021)", "publisher_and_location": "International Vladimir Nabokov Society", "submission_deadline": "Tuesday, March 24, 2020", "description": "For its next session at the MLA Convention 2021 (7-10 January, Toronto), the International Vladimir Nabokov Society welcomes proposals  on the following theme: ,Playing with/for Time: Nabokov's Persistent Images , Nabokov created persistent images (visual and other), which mark readers' minds not unlike the phenomenon of retinal persistence. How do such images survive, confer timelessness to his fiction, or anchor it in a specific temporality? Please send a 250-word abstract to Lara Delage-Toriel (ldelage@unistra.fr) and a very short bio by March 24th, 2020."}, {"title": "“Y’all”: Regionalism, Inclusion, Activism | 26th Annual SW/SW Graduate Conference", "publisher_and_location": "Southern Writers/Southern Writing", "submission_deadline": "Sunday, April 19, 2020", "description": "The Southern Writers/Southern Writing Conference (SW/SW) is an interdisciplinary graduate student event hosted by the University of Mississippi from July 16-18, 2020."}, {"title": "Call for papers: Special Issue of ELN, \"Fashion's Borders\"", "publisher_and_location": "Issue of English Language Notes", "submission_deadline": "Sunday, November 1, 2020", "description": "This special issue of ELN takes up the complex relationship between clothing and place and seeks to examine the transcultural flow of commodities (specifically clothing and fashionable objects) both within and across national borders. Fashion, we assert, is the cultural medium through which borders shift and move."}, {"title": "The Politics of Escapism", "publisher_and_location": "Modern Language Association", "submission_deadline": "Friday, March 20, 2020", "description": "The Politics of Escapism ,Panel at the 2021 MLA Convention ,TOronto, DC, January 7-10, 2021 ,Co-Organizers: ,Greg Sharzer, University of Toronto (gsharzer@gmail.com); Keith O'Regan, YorkUniversity (keith.oregan@gmail.com) ,Escapism, the desire to abandon a difficult present for an ideal alternative,"}, {"title": "« Archives de l'émigration. Études - Esquisses – Documents »: Provence-Alpes-Côte d'Azur. L'émigration polonaise  au pays de Mistral, de Daudet et de Pagnol", "publisher_and_location": "University of Nicolaus Copernicus in Toruń, Poland", "submission_deadline": "Tuesday, June 30, 2020", "description": "https://www.bu.umk.pl/Archiwum_Emigracji/gazeta/en-index.html ,  ,« Archives de l'émigration. Études - Esquisses – Documents » ,Numéro coordonné par: Magdalena Kowalska ,ISSN 2084-3550 ,ISSN Online 2391-7911 ,  ,Date limite d’envoi des propositions : le 9 avril 2020 ,Date limite de réception des articles : le 30 juin 2020 ,  ,APPEL À CONTRIBUTIONS"}, {"title": "Travels and Travelers of Necessity", "publisher_and_location": "MLA21 (Toronto)", "submission_deadline": "Friday, March 20, 2020", "description": "What is the place of unwilling travel(er)s in travel studies? What are the costs of travel? This roundtable considers travels that are not undertaken strictly by choice. We welcome proposals from any field or period on topics such as: climate-related relocations, internal/political migrants, self-liberation from slavery or captivity, literal/figurative boundaries, eco/animal movements, borderlands/crossings, economic exigencies that require travel, narratives of new beginnings."}, {"title": "« Archives de l'émigration. Études - Esquisses – Documents »: Provence-Alpes-Côte d'Azur. L'émigration polonaise  au pays de Mistral, de Daudet et de Pagnol", "publisher_and_location": "University of Nicolaus Copernicus in Toruń, Poland", "submission_deadline": "Tuesday, June 30, 2020", "description": "https://www.bu.umk.pl/Archiwum_Emigracji/gazeta/en-index.html ,  ,« Archives de l'émigration. Études - Esquisses – Documents » ,Numéro coordonné par: Magdalena Kowalska ,ISSN 2084-3550 ,ISSN Online 2391-7911 ,  ,Date limite d’envoi des propositions : le 9 avril 2020 ,Date limite de réception des articles : le 30 juin 2020 ,  ,APPEL À CONTRIBUTIONS"}, {"title": "Travels and Travelers of Necessity", "publisher_and_location": "MLA21 (Toronto)", "submission_deadline": "Friday, March 20, 2020", "description": "What is the place of unwilling travel(er)s in travel studies? What are the costs of travel? This roundtable considers travels that are not undertaken strictly by choice. We welcome proposals from any field or period on topics such as: climate-related relocations, internal/political migrants, self-liberation from slavery or captivity, literal/figurative boundaries, eco/animal movements, borderlands/crossings, economic exigencies that require travel, narratives of new beginnings."}, {"title": "Shrewsbury's Darwin", "publisher_and_location": "Gaynor Llewellyn-Jenkins. University of Chester", "submission_deadline": "Thursday, April 30, 2020", "description": "‘I was Born a Naturalist’: Charles Darwin and Shrewsbury  ,Friday 3rd July 2020, University Centre Shrewsbury.  ,We would like to invite you to a one-day symposium exploring Darwin’s origins in Shropshire. We will discuss the effects of Shrewsbury and its surrounding area on the young Charles Darwin. What were the influences of the Darwin and Wedgwood family members on Darwin’s ambitions? What role did female relatives such as his mother Susannah Darwin (née Wedgwood) and his sister Caroline have on Darwin’s formation as a scientist?   ,Keynote Speakers:"}, {"title": "Performing Labor: (Re)Evaluations in the Humanities", "publisher_and_location": "California Polytechnic State University, San Luis Obispo", "submission_deadline": "Friday, March 13, 2020", "description": "The First Annual Interdisciplinary Humanities Conference at California Polytechnic State University, San Luis Obispo, April 25 and 26, 2020 ,  ,Performing Labor: (Re)Evaluations within the Humanities"}, {"title": "MLA 2021: Harold Pinter and Laughter", "publisher_and_location": "The International Harold Pinter Society", "submission_deadline": "Sunday, March 22, 2020", "description": "The International Harold Pinter Society welcomes papers that explore Harold Pinter and laughter. What is significant about laughter in Pinter's work and how might it concern or complicate the reception of his creative output. Please send abstracts of no more than 300 words and a CV to mjrii@illinois.edu"}, {"title": "SAMLA 92: Scandalous Humor/Humorous Scandal", "publisher_and_location": "American Humor Studies Association", "submission_deadline": "Friday, May 15, 2020", "description": "Both perennial elements of a society, scandal is often fodder for humor, and humor fodder for scandal. From their subversion of existing power structures, to issues of critical reception, to objectionable behavior on the part of creators, humorous texts have exposed, caused, and responded to many instances of cultural uproar. This panel will explore the ways that humor and scandal are intimately related. Papers and presentations on any aspect of humor expression are welcome, including but not limited to analysis of stand up or sketch comedy, satire, political cartoons, satirical activism, parody, literature, television, film, or music."}, {"title": "MLA 2021 Panel: Cultures of Anti-Fascism, Then and Now", "publisher_and_location": "Modern Language Association", "submission_deadline": "Monday, March 16, 2020", "description": "This panel considers the legacy of anti-fascist culture. How can we articulate a persistent anti-fascism that outlasts the forces of capital and ethno-nationalism in the present? ,Send 250-word abstracts to sgotzler@andrew.cmu.edu by March 16."}, {"title": "Visual Depictions of the American West", "publisher_and_location": "Tracy Lassiter, University of New Mexico-Gallup", "submission_deadline": "Monday, March 30, 2020", "description": "The American West has been depicted for decades through comic books and graphic novels, including by many authors living outside the U.S."}, {"title": "George Gissing in Vogue", "publisher_and_location": "Tom Ue / Dalhousie University", "submission_deadline": "Wednesday, March 25, 2020", "description": "Midway through New Grub Street (1891), Reardon reunites with his wife Amy. In preparation, he leaves behind his overcoat. This attire, once “fairly good,” is now long past its prime, “the edges of the sleeves were frayed, two buttons were missing, and the original hue of the cloth was indeterminable.” Reardon knows Amy well, but not well enough: her attention at the meeting is quickly directed to “his muddy and shapeless boots,” and her desire for “a renewal of amity” conflicts with her shock over her husband’s appearance: “[S]uch attire degraded him in her eyes; it symbolised the melancholy decline which he had suffered intellectually."}, {"title": "2020 MMLA Conference “Cultures of Collectivity\" (Dickens)", "publisher_and_location": "The Dickens Society", "submission_deadline": "Thursday, April 30, 2020", "description": "Call for Papers for the Dickens Society ,at the ,2020 MMLA Conference ,“Cultures of Collectivity” ,Milwaukee, WI ,November 5-8, 2020 at the Hilton Milwaukee City Center"}, {"title": "SAMLA 2020 - American Literature and the Market - Jacksonville FL", "publisher_and_location": "Ian Afflerbach / South Atlantic Modern Literature Association", "submission_deadline": "Wednesday, June 10, 2020", "description": "SAMLA ,Jacksonville FL, November 13-15, 2020"}, {"title": "MSA 2020 - Modernism and the Market - Brooklyn NYC", "publisher_and_location": "Ian Afflerbach / Modernist Studies Association", "submission_deadline": "Monday, March 16, 2020", "description": "Modernist Studies Association Conference ,Brooklyn NY, October 22-25, 2020"}, {"title": "ACROSS - A Comprehensive Review of Societal Studies", "publisher_and_location": "Dunarea de Jos University of Galati, Romania, The Cross-border Faculty", "submission_deadline": "Sunday, May 31, 2020", "description": "ACROSS is a biannual, peer-reviewed online journal which addresses mainly humanities scholars. Exploring themes of cultural diversity from the interrelated perspectives of cultural studies and history, literary studies, media studies, linguistics and critical discourse analysis, the journal welcomes contributions with a potential for enhancing the global, multicultural dialogue in the ever-changing world of the twenty-first century. ,ACROSS promotes research excellence. We are certain that your expertise will help us build a space of imparting knowledge in the field of multiculturalism and multilingualism across the world. ,ISSN 2602-1463 ,Subject areas include but are not limited to:"}, {"title": "Workshop: Insect Entanglements", "publisher_and_location": "Eline D. Tabak, University of Bristol", "submission_deadline": "Tuesday, April 14, 2020", "description": "Workshop: Insect Entanglements ,deadline for submissions: April 15, 2020 ,Faculty of Arts, University of Bristol, 19 June 2020 ,  ,Insects are everywhere, our (human) lives entangled with them, and yet we know surprisingly little about them. In the introduction to Insectopedia, Hugh Raffles writes the following:"}, {"title": "[EXTENDED] Eat/Play/Tweet: An Interdisciplinary Conference on Storytelling and Identity in Popular Culture", "publisher_and_location": "Popular Culture Research Centre, AUT", "submission_deadline": "Tuesday, March 31, 2020", "description": "Eat/Play/Tweet: ,An Interdisciplinary Conference ,on Storytelling and Identity in Popular Culture ,  ,Popular Culture Research Centre, ,Auckland University of Technology ,7-9 July 2020 ,  ,The Popular Culture Research Centre (Auckland University of Technology) welcomes papers for its upcoming interdisciplinary conference on the theme of ‘storytelling and identity’ in popular culture. The conference will be held in Auckland on 7-9 July 2020. ,  ,Keynote Speakers: ,Justin Edwards (University of Stirling) ,Lorna Piatti-Farnell (Auckland University of Technology) ,Constantine Verevis (Monash University)"}, {"title": "Latina/o cultural productions as provocation: breaking rules, making texts.", "publisher_and_location": "SAMLA 2020", "submission_deadline": "Wednesday, June 10, 2020", "description": "Latina/o Cultural Productions as Provocation: Breaking Rules, Making Texts. ,  ,The cultural production of US Latina/os, as any other so-called minority discourse, can be analyzed as defiant voices that aim to provoke dialogue with the hegemonic discourse and the mainstream culture. As such, these discourses can be more or less combative in their struggle to break and resist the rules imposed by the status quo. ,This panel welcomes submissions in English or Spanish on any aspect of Latina/o cultural products (literature, fashion, film and visual arts, etc.) that aim to contest hegemony, including but not limited to:"}, {"title": "Ghost Stories Collection", "publisher_and_location": "Spectral Visions Press (University of Sunderland)", "submission_deadline": "Sunday, April 5, 2020", "description": "Extended Deadline - Ghost Stories Call for Submissions ,  ,Tell me a story. A simple request made by children across the world every night and one we seek to fulfil even as adults. But… it is the stories that excite, that make our hearts beat faster, and the hairs on our necks stand on end that bewitch us most. It is these stories we want to hear. Spectral Visions Press (University of Sunderland) are now accepting submissions for a short story collection, Spectral Visions: Ghost Stories. Due to the fantastic response, we've extended the deadline in hopes of a bumper collection or even a separate poetry collection."}, {"title": "Provocations and Provocateurs of the Long Nineteenth Century", "publisher_and_location": "South Atlantic Modern Language Association (SAMLA)", "submission_deadline": "Saturday, May 30, 2020", "description": "Submissions are invited for any aspect of the conference theme \"Scandal! Literature and Provocation: Breaking Rules, Making Texts.\" Please note that the \"Long Nineteenth Century\" encompasses works published between 1789 and 1914. ,By May 30, please submit a 500-word abstract for your proposed presentation and a brief biography to ,Dr. Anita Turlington ,Associate Professor, English ,University of North Georgia ,anita.turlington@ung.edu"}, {"title": "Alienation and De-alienation in the Composition Classroom (CEA at MLA 2021)", "publisher_and_location": "Andrew Beutel/College English Association", "submission_deadline": "Saturday, March 7, 2020", "description": "This panel, sponsored by the College English Association, explores how the concept of alienation can be applied to a field in which it has not received very much attention: composition pedagogy. Generally meaning an undesirable separation between self and world (i.e., other human beings, nature, and social roles, norms, and institutions), alienation has been analyzed in various contexts by philosophers, psychologists, sociologists, theologians, and critical theorists. While it came to be viewed as problematic and outmoded with the rise of postmodernism, the concept is far from obsolete today. On the contrary, alienation remains both a widely experienced psychosocial issue and a vital theoretical and diagnostic tool."}, {"title": "Interdisciplinary Victorians (MLA 2021)", "publisher_and_location": "Scott C. Thompson and Renata Kobetts Miller", "submission_deadline": "Saturday, March 7, 2020", "description": "Our panel invites papers that consider the relationship among disciplines in the Victorian period. What can we learn about our present from the intertwined Victorian modes of knowledge production and distribution? ,CV and 300 word abstract to Scott C. Thompson (scottcthompson19@gmail.com) and Renata Kobetts Miller (remiller@ccny.cuny.edu). Deadline: March 7, 2020."}, {"title": "Call for Papers — Symposium “Bio and Psyche: Reading the Symptomatic Body”", "publisher_and_location": "Humanities Research Center, Rice University", "submission_deadline": "Monday, March 30, 2020", "description": "Call for Papers — Symposium “Bio and Psyche: Reading the Symptomatic Body” ,May 1 and 2, 2020 ,Humanities Research Center, Rice University ,Houston, Texas ,  ,KEYNOTE SPEAKERS: ,  ,Prof. Christopher Lane (Northwestern University), author of Shyness: How Normal Behavior Became a Sickness (2007). ,  ,Dr. Jamieson Webster (The New School), psychoanalyst in private practice and author of Conversion Disorder: Listening to the Body in Psychoanalysis (2018)."}, {"title": "The Pre-Raphaelites in Art and Literature: Reception and Celebrity", "publisher_and_location": "William Morris Society and Society for the History of Authors, Readers and Publishers", "submission_deadline": "Tuesday, March 10, 2020", "description": "The Proposed joint session of the William Morris Society with the Society for the History of Authors, Readers and Publishers (SHARP): ,  ,How did the Pre-Raphaelites become well-known to their contemporaries and later readers? What role did publishers play in their reception? And what was the impact of the rise of a professional class of journalists and reviewers on their reputation?"}, {"title": "William Morris and His Circle: Biography, Archives, Artifacts", "publisher_and_location": "William Morris Society", "submission_deadline": "Wednesday, March 18, 2020", "description": "Modern Language Association Convention  Toronto, January 7-10, 2021  Call for Papers: Guaranteed sessionWe seek proposals on new approaches to the lives of Morris and his associates, including his Pre-Raphaelite, Arts and Crafts, socialist, and familial circles. Papers on twentieth-century and contemporary responses to Morris's legacy as broadly conceived are also welcome.Please send a one-page abstract to florence-boos@uiowa.edu by March 18, 2020"}, {"title": "CFP Creative Resistance - Issue 30, FORUM Postgraduate Journal of Culture & the Arts, 10 April 2020", "publisher_and_location": "FORUM Postgraduate Journal, University of Edinburgh", "submission_deadline": "Friday, April 10, 2020", "description": "“I know the world is bruised and bleeding, and though it is important not to ignore its pain, it is also critical to refuse to succumb to its malevolence. Like failure, chaos contains information that can lead to knowledge — even wisdom. Like art.” - Toni Morrison. (No Place for Self-Pity, No Room for Fear, included in the 150th anniversary issue of The Nation.)"}, {"title": "SCMLA 2020 Native American Literature CFP", "publisher_and_location": "South Central Modern Language Association", "submission_deadline": "Monday, March 23, 2020", "description": "South Central Modern Language Association  ,2020 SCMLA Conference  ,Houston, Texas (October 8-10, 2020) ,  ,Native American Literature Panel ,Special Topic: Indigenous Presents  ,  ,We are now accepting submissions for the Native American Literature Panel at SCMLA 2020, to be held in Houston, TX, from Oct. 8-10, 2020."}, {"title": "MLA 2021 CFP: Analog Persistence", "publisher_and_location": "Mike Phillips, Southern Illinois University", "submission_deadline": "Monday, March 23, 2020", "description": "Call for papers for a proposed session at the 2021 MLA Annual Convention, Jan. 7-10 in Toronto."}, {"title": "CFP: An International Philosophical Congress 2020", "publisher_and_location": "Jagiellonian University in Kraków", "submission_deadline": "Monday, June 1, 2020", "description": "The International Philosophical Congress will be held 22‒27 September 2020 at the Jagiellonian University in Kraków, Poland. ,The fiftieth anniversary of the death of the eminent Polish philosopher and humanist Roman Ingarden in 2020 is an occasion to launch an international academic debate on current trends in contemporary philosophy. The main aim of the organisers is therefore to furnish an international group of researchers with a convenient space for a free and creative exchange of thoughts, ideas, and views. ,We invite researchers interested in contemporary philosophy, cognitive science and gender/queer studies.  ,The Thematic Panels will be organized within the following themes:"}, {"title": "Call for Submissions: Journal of Springsteen Studies", "publisher_and_location": "BOSS: The Biannual Online-Journal of Springsteen Studies / Caroline Madden", "submission_deadline": "Thursday, April 30, 2020", "description": "BOSS: The Biannual Online-Journal of Springsteen Studies (http://boss.mcgill.ca/) is an open access academic journal that publishes peer-reviewed essays pertaining to Bruce Springsteen. The editors of BOSS are currently soliciting papers for the journal’s fourth edition, with expected publication date of August 2020."}, {"title": "New Journal: New Chaucer Studies, Pedagogy and Profession", "publisher_and_location": "New Chaucer Studies: Pedagogy and Profession", "submission_deadline": "Tuesday, September 1, 2020", "description": "New Chaucer Studies: Pedagogy and Profession CFP ,The mission of the New Chaucer Society is to “provide a forum for teachers and ,scholars of Geoffrey Chaucer and his age.” As the working conditions of those ,teachers and scholars change, this forum needs to expand to reflect those changes. ,For this reason, NCS is happy to announce the launch of a new on-line venue, ,New Chaucer Studies: Pedagogy and Profession, hosted on the New Chaucer Society ,website. This peer-reviewed, open access site will offer brief essays on teaching,"}, {"title": "Impertinent Pedagogy: Mischievous Praxis in Children’s and YA Literature and Culture", "publisher_and_location": "Victoria Ford Smith, University of Connecticut", "submission_deadline": "Sunday, March 15, 2020", "description": "This guaranteed session sponsored by the Children’s and Young Adult Literature Forum welcomes proposals for 5-minute lightning talks introducing innovative, irreverent, revolutionary, or downright disorderly approaches to teaching children’s and young adult literature and culture in the college classroom. Scholars from across research areas and disciplines — including English, Education, Library Science, and others — are welcome, as are reflections on teaching young people’s texts and cultures in a variety of class contexts, from the undergraduate survey to the graduate seminar."}, {"title": "MLA 2021 CFP: Comics and Graphic Narratives for Young Audiences (Deadline: 03/10/20)", "publisher_and_location": "Modern Language Association", "submission_deadline": "Tuesday, March 10, 2020", "description": "Comics and Graphic Narratives for Young Audiences ,This panel explores intersections between children’s literature and comics (including manga and graphic novels). All periods and nations welcome. ,Call for Papers for a proposed special session at the Modern Language Association (MLA) Annual Convention on January 7-10, 2021 in Toronto, ON. This collaborative panel is jointly sponsored by the Comics and Graphic Narratives Forum and the Children’s and Young Adult Literature Forum."}, {"title": "MLA 2021 CFP: Decolonizing Comics and/as Activism (Deadline: 03/15/20)", "publisher_and_location": "Modern Language Association", "submission_deadline": "Sunday, March 15, 2020", "description": "Decolonizing Comics and/as Activism ,Call for papers for a non-guaranteed proposed session at the Modern Language Association (MLA) Annual Convention on January 7-10, 2021, in Toronto, Canada. This panel is sponsored by the Comics and Graphic Narrative Forum."}, {"title": "MLA 2021 CFP: New Flashpoints in Comics History (Deadline: 03/15/20)", "publisher_and_location": "Modern Language Association", "submission_deadline": "Sunday, March 15, 2020", "description": "New Flashpoints in Comics History ,Call for Papers for a guaranteed roundtable panel sponsored by the Forum for Comics and Graphic Narratives at the Modern Language Association (MLA) Annual Convention, January 7-10, 2021 in Toronto, ON. ,“For all the vibrant scholarship emerging around comics today, the medium remains a largely unplumbed and uncanonized field of texts you’ve never heard of.” —Ramzi Fawaz, “A Queer Sequence: Comics as a Disruptive Medium” (2019)"}, {"title": "The Final Frontier: Space, Race, and Survival in Speculative Fiction (MLA 2021)", "publisher_and_location": "Smaran Dayal", "submission_deadline": "Sunday, March 15, 2020", "description": "This panel will investigate space exploration in speculative literatures. It looks at the myriad ways in which works of speculative fiction have imagined, challenged, or otherwise engaged with outer space as a site for new colonialisms, the extension of racial supremacies, and/or environmental violence. We are especially interested in scholarship which explores the growing body of criticism situated at the intersection of black studies and speculative fiction. How has space functioned as a stand-in for the geographical expanse of the planet before its mapping and conquest by European colonialism?"}, {"title": "The Alterity of Affliction / Afflictions of Alterity", "publisher_and_location": "Cultural, Social and Political Thought, University of Victoria, BC", "submission_deadline": "Tuesday, March 31, 2020", "description": "The Alterity of Affliction / Afflictions of Alterity ,University of Victoria (British Columbia), May 22-24, 2020         Keynote speaker, Cindy Baker Deadline to submit, March 31, 2020 Website, http://www.alterityofaffliction.com/  ,  ,“Whatever pain achieves, it achieves in part through its unsharability, and it ensures this unsharability through its resistance to language . . .” – Elaine Scarry, The Body in Pain"}, {"title": "Scaling Trans Studies (MLA 2021)", "publisher_and_location": "Davy Knittle and Ava L.J. Kim, University of Pennsylvania", "submission_deadline": "Tuesday, March 10, 2020", "description": "In her 2014 Transgender Studies Quarterly article, \"The Technical Capacities of the Body, Assembling Race, Technology, and Transgender,\" Jules Gill-Peterson argues that \"if both transgender and race benefit from treatment as technical capacities of the body, it remains to explain how it is they retain their differences in this framework as well as how they are made more or less available at various ecological scales by systems of normalization and regulation\" (412)."}, {"title": "EXTENDED DEADLINE MLA 2021: Practices of Persistence: Women's Authorial Labor in Seventeenth-Century England and the New World", "publisher_and_location": "Lauren Mamolite, Wagner College", "submission_deadline": "Sunday, March 15, 2020", "description": "This panel invites papers addressing how seventeenth-century women’s authorial labor constituted and/or negotiated practices of persistence that were considered necessary to confront the transatlantic New World, including but not limited to willfullness, fortitude, sacrifice, and endurance. A variety of disciplinary and methodological approaches welcome. Please submit 250 word abstract and brief biography to lauren.mamolite@wagner.edu."}, {"title": "Haunted Landscapes of German Eastern Europe", "publisher_and_location": "University of Edinburgh: August 12-14th, 2020", "submission_deadline": "Monday, March 16, 2020", "description": "EXTENDED DEADLINE: CfP: Haunted Landscapes of German Eastern Europe (University of Edinburgh: August 12-14th, 2020)"}, {"title": "International Journal of Advances in Artificial Intelligence(IJAAI)", "publisher_and_location": "book publisher", "submission_deadline": "Saturday, March 7, 2020", "description": "International Journal of Advances in Artificial Intelligence (IJAAI) ,ISSN 0924 - 634N (Online) ; 0175 - 2170 (Print)http://skycs.org/jounals/ijaal/Home.html Submission System. Scope"}, {"title": "Nurturing English Education through Three Branches: Linguistics, Literature, Education", "publisher_and_location": "the Pan-Korea English Teachers’ Association, the New Korean Association of English Language and Literature, the Korean Association of Language Sciences", "submission_deadline": "Tuesday, March 10, 2020", "description": "2020 Joint International Conference ,  ,The 2020 International Conference of the Pan-Korea English Teachers’ Association (PKETA), the New Korean Association of English Language and Literature (NKAELL), and the Korean Association of Language Sciences (KALS) will be held at Pusan National University, Busan, Korea. This year’s conference theme is “Nurturing English Education through Three Branches: Linguistics, Literature, Education” and we are planning to organize an informative conference with presentations on various topics. We accept presentations broadly related to the theme of the conference and expect your contribution to the conference."}, {"title": "[DEADLINE EXTENDED] ICR 2020: Romantic Confluences", "publisher_and_location": "International Conference on Romanticism (ICR)", "submission_deadline": "Sunday, March 15, 2020", "description": "Scholars working in any area of Romanticism are invited to submit proposals for the 2020 meeting of the International Conference on Romanticism to be hosted by Saint Louis University in St. Louis, Missouri from October 22-24. The conference theme this year is \"Romantic Confluences.\" ,https://www.stlicr2020.com/ ,While we encourage a broad interpretation of this theme, some possible approaches include the following: , ,Geography and Spatiality , , ,Travel and River Studies , , ,Romantic Hospitality , , ,Transatlantic connections"}, {"title": "VISAWUS 2020: Victorian Transitions", "publisher_and_location": "Victorian Interdisciplinary Studies Association of the Western United States", "submission_deadline": "Monday, April 20, 2020", "description": "VISAWUS 2020: Victorian Transitions ,Reno, NV October 15-17, 2020 ,The Victorian Era was one of transitions. Victorian Britain transitioned from a rural to urban society. It transitioned from an emergent empire to the dominant imperial power. It transitioned from a walking, water, wind, and animal-based transportation system to a steam-powered transportation system. It transitioned from a regional to national and then imperial culture."}, {"title": "[Deadline Extended!] Food Futures: Humanities and Social Sciences Approaches [Deadline Extended!]", "publisher_and_location": "Humanities for the Environment", "submission_deadline": "Sunday, March 15, 2020", "description": "Food Futures: Humanities and Social Sciences Approaches ,November 13-14, 2020National Sun Yat-sen University Kaohsiung, Taiwan"}, {"title": "Extended Deadline: 9th International Conference on Language, Literature & Culture “Risk and Safety” June 4-5, 2020", "publisher_and_location": "University of Białystok (Poland) and Çankaya University (Turkey)", "submission_deadline": "Monday, March 9, 2020", "description": "We are honored to announce the 9th International Conference on Language, Literature & Culture and Crossroads III Conference. This combined conference is organized jointly by the University of Białystok (Poland) and Çankaya University (Ankara, Turkey) on June 4-5, 2020 in Białystok, Poland, and the topical theme of the conference will be “Risk and Safety” in different areas of human sciences. Selected papers presented at the conference will be published in a volume of the Çankaya University Journal of Humanities and Social Sciences (ISSN 1309-6761) https://dergipark.org.tr/tr/pub/cankujhss"}, {"title": "Times of Nature", "publisher_and_location": "Times of Nature - an //ASIA symposium / School of the Art Institute of Chicago", "submission_deadline": "Monday, March 16, 2020", "description": "This year’s ASIA// symposium, held on April 23 at the School of the Art Institute of Chicago, will deal with nature’s pasts, presents and futures, as they are remembered, synthesized, and prefigured in Asia. We live at a time where the environment seems to have been made to be understood by constructs far larger than us, distilled into phrases ready for debate on mass media, cut up into financial inventions like Chinese green bonds and Indonesian carbon offsets. This isn’t the first time or place ‘nature’, or ‘climate’ have been reimagined—diverse cosmologies have long featured the two in various capacities and entanglements."}, {"title": "Call for Papers | Vol 2: Issue I – Electronic Research Journal of Social Sciences and Humanities", "publisher_and_location": "Chief Editor Dr Ahmad Saeed", "submission_deadline": "Monday, March 30, 2020", "description": "Call for Papers | Vol 2: Issue I – Electronic Research Journal of Social Sciences and Humanities ( http://www.eresearchjournal.com/) ,Scope:"}, {"title": "The Road to Dracula: or the World as Disappointment and Representation", "publisher_and_location": "Universitas Press", "submission_deadline": "Friday, May 1, 2020", "description": "Published at the height of the imperial enterprise, Bram Stoker’s Dracula (1897) has a long and intricate backstory. It is, in fact, the result of centuries of British discovery of and disappointment with the world. One by one, naturalists, amateur anthropologists, merchants, soldiers, diplomats or missionaries from the British Isles discovered the world for the armchair travelers at home and built up their self-esteem by disfiguring countries and regions in writings, paintings, and lectures at the Royal Geographical Society."}, {"title": "International Journal in Foundations of Computer Science & Information Technology(IJFCSIT)", "publisher_and_location": "book publisher", "submission_deadline": "Wednesday, March 4, 2020", "description": "ISSN 0974 - 654N (Online) ; 0175 - 2190 (Print)                                                                                                           Submission System.  Scope"}, {"title": "Hawthorne Society MLA 2021", "publisher_and_location": "Nathaniel Hawthorne Society", "submission_deadline": "Friday, March 13, 2020", "description": "Hawthorne and the EcoGothic ,The Annual Conference of the MLA will meet in Toronto on January 7-10, 2021. The editors of Gothic Nature observe that the Gothic now serves as a primary means to articulate the horrors of climate change and our current environmental crisis. EcoGothic, however, has been a fundamental component of American literature since William Bradford recoiled from the continent’s “hideous & desolate wilderness.” A recent spate of articles not only acknowledges this strange continuity but has begun to situate Nathaniel Hawthorne as one of the tradition’s key figures. This panel invites papers that further investigate Hawthorne’s entanglement with the ecoGothic."}, {"title": "Persistence in American Drama", "publisher_and_location": "American Theatre and Drama Society & Modern Language Association", "submission_deadline": "Sunday, March 15, 2020", "description": "Due Date Extended: This panel will consider how American plays, live performances, masters, or movements in American drama and theatre from any period offer strategies for persistence in an age of mechanical reproduction. How do American plays model, operationalize, and/or resist persistence? Why and how do some theatrical voices persist in the national discourse amid marginalization? For example, papers may wish to consider persistence in American drama within Benjaminian, or other, theoretical context(s) regarding the work of art in an age of mechanical reproduction or live performance’s “aura” in a digital age."}, {"title": "Resisting Identities: Possibilities of (Re)emergence", "publisher_and_location": "Department of English at Binghamton University", "submission_deadline": "Sunday, March 22, 2020", "description": "Deadline Extended! ,Date of Conference: Saturday, April 25th, 2020 ,Keynote Speaker: Dr. Manu Karuka ,Location: Binghamton, New York"}, {"title": "Re-examining Doctoral Candidacy: MLA 2021 Panel", "publisher_and_location": "University of Victory", "submission_deadline": "Friday, March 20, 2020", "description": "How can we make doctoral candidacy/comprehensive/qualifying exams kinder for students? SoTL-based papers on doctoral exam processes that are compassionate, innovative, learner-centred, non-traditional, and aligned with learning outcomes. 250-word abstract, short bio. ,Link to MLA CFP: https://mla.confex.com/mla/2021/webprogrampreliminary/Paper12829.html ,Send abstracts and bios to Janice Niemann (jniemann@uvic.ca) & Natalie Boldt (nboldt@uvic.ca) on or before Friday, March 20th, 2020."}, {"title": "Call for Papers - A New Journal of Global Pedagogy", "publisher_and_location": "Contingencies: A Journal of Global Pedagogy", "submission_deadline": "Sunday, March 29, 2020", "description": "Contingencies: A Journal of Global Pedagogy ,An open access, peer-reviewed journal published under a Creative Commons license. ,First issue to be published in Fall, 2020. Hosted by NYU Liberal Studies."}, {"title": "Representations of Addiction in 19th-century Literatures", "publisher_and_location": "South Atlantic MLA / SAMLA", "submission_deadline": "Monday, June 1, 2020", "description": "The term “addiction” was not widely established in the 19th century. Even today, although amply attested in medical and legal dictionaries, it is not unambiguous: the label “addict” is highly stigmatizing, while “addiction” to yoga or organic sourdough is a status marker. Nineteenth-century writers nonetheless depicted recognizable states of dependency and loss of autonomy, which 21st-century readers find unmistakably familiar."}, {"title": "Podcasting and Journalism: An edited collection to be published", "publisher_and_location": "Chad Whittle, Georgia College", "submission_deadline": "Friday, March 20, 2020", "description": "Editor: Dr. Chad Whittle, Georgia College ,Purpose of book: This edited collection of research will examine how journalists are using podcasting to produce news content. Podcasts continue to grow in usage and are becoming a part of media consumers daily routine to stay updated on the latest headlines and analysis of the top stories of the day. The editor is seeking contributions from scholars and those within the industry on the following topics: ,*The use of daily news podcasts to deliver the top headlines and stories of the day ,*Long form investigative journalism podcasts ,*Sports journalism podcasts ,*Politically based news podcasts"}, {"title": "Speaking to Power: Feminist Theories and Praxis", "publisher_and_location": "Women and Gender Studies Graduate Student Union", "submission_deadline": "Saturday, March 7, 2020", "description": "THE 1ST UNIVERSITY OF TORONTO WOMEN AND GENDER STUDIES INSTITUTEGRADUATE CONFERENCE: SPEAKING TO POWER: FEMINIST THEORIES AND PRAXES ,  ,Conference Date: April 24-25, 2020 ,  ,DEADLINE FOR ABSTRACTS: March 7th, 2020 ,Notice of Acceptance: March 16th, 2020"}, {"title": "Narratives of Faith: Devotional Songs and Poetry of Multicultural Societies of Bengal", "publisher_and_location": "Organised under RUSA 2.0, Department of English, Jadavpur University", "submission_deadline": "Thursday, March 5, 2020", "description": "In the age of post-liberalism, some of the inevitable consequences of what the geographer Neil Smith has called ‘uneven development’ are the various identity politics emerging out of the discontent of the ethnic and linguistically marginalized communities and the even more threatening waves of ‘religious resurgence’ and ‘religious fundamentalisms’ that desecrates the basic bonds of human life and its survival. However, what has stood resilient in the face of decades of abrasive change has been the rich heritage of a pluralist and harmonious existence that has fostered its unique variety of cosmopolitanism in multi-lingual, multi-ethnic and multi-faith societies."}, {"title": "CFP: The Female Detective on TV", "publisher_and_location": "MAI: Feminism and Visual Culture", "submission_deadline": "Saturday, May 30, 2020", "description": "CALL FOR PAPERS: The Female Detective on TV ,  ,MAI: Feminism & Visual Culture invites academic authors with expertise in television studies and other related disciplines to contribute to our upcoming special issue on female detectives on TV."}, {"title": "World Literature – Northeast Popular/American Culture Association", "publisher_and_location": "Northeast Popular & American Culture Organization", "submission_deadline": "Monday, June 1, 2020", "description": "The World Literature area for the 2020 Northeast Popular/American Culture Association conference is accepting paper proposals from faculty and graduate students. NEPCA’s 2020 annual conference will be held from Friday, October 23-Saturday, October 24 2020 at Southern New Hampshire University in Manchester, NH."}, {"title": "PANEL FOR SAMLA 92: Scandal and Transgression in Twentieth-Century Transatlantic Vanguardisms", "publisher_and_location": "Leticia Perez Alonso / Jackson State University", "submission_deadline": "Monday, June 1, 2020", "description": "This panel explores forms of dissent adopted by twentieth-century transatlantic avant-gardes as a means of challenging traditional genres and social codes. Since the inception of European experimentalism during the first decades of the twentieth century, a series of art movements engaged in radical production that questioned the established state of affairs. From the Cubist adoption of multiple viewpoints, through the Futurist celebration of technology and speed, the Expressionist distortion of form, to the Dadaist sense of provocation and the irrational juxtaposition of images in Surrealism, avant-garde art and literature has set precedents on an international level of exchanges."}, {"title": "Patriotism and Protest | NEASA 2020 Conference | June 6, 2020", "publisher_and_location": "New England American Studies Association", "submission_deadline": "Sunday, March 15, 2020", "description": "Call For Papers ,“Patriotism and Protest” ,New England American Studies Association Annual Conference ,June 6, 2020 ,Lesley University, Cambridge, MA"}, {"title": "Dragons: A Series of Edited Volumes UPDATE/EXTENDED DEADLINE", "publisher_and_location": "Northwestern State University", "submission_deadline": "Wednesday, April 15, 2020", "description": "Dragons: A Series of Edited Volumes ,deadline for submissions:  ,March 3, 2020 ,full name / name of organization:  ,Northwestern State University ,contact email:  ,rachel.carazo@snhu.edu ,I received a great response to the last call for papers regarding the volumes on dragons. As a result, I have been better able to refine and divide results. ,Below are the new details for the updated call for papers:"}, {"title": "Call for Book Chapters on Mythological Equines in Children’s Literature", "publisher_and_location": "Northwestern State University", "submission_deadline": "Friday, April 3, 2020", "description": "Call for Book Chapters on Mythological Equines in Children’s Literature ,Vernon Press invites chapter proposals on the theme: Mythological Equines in Children’s Literature for an edited collection of the same name in the series Equine Creations: Imagining Horses in Literature and Film, edited by Rachel L. Carazo (Northwestern State University)."}, {"title": "Call for Book Chapters on Mythological Equines in Film", "publisher_and_location": "Northwestern State University", "submission_deadline": "Friday, April 3, 2020", "description": "Call for Book Chapters on Mythological Equines in Film Vernon Press invites chapter proposals on the theme: Mythological Equines in Film for an edited collection of the same name in the series Equine Creations: Imagining Horses in Literature and Film, edited by Rachel L. Carazo (Northwestern State University)."}, {"title": "DEADLINE EXTENSION: Call for Book Chapters on Ridley Scott’s Gladiator: In Recognition of the Twentieth Anniversary of the Film", "publisher_and_location": "Northwestern State University", "submission_deadline": "Wednesday, April 1, 2020", "description": "Vernon Press invites chapter proposals on the theme: “A Hero Will Endure”: Essays at the Twentieth Anniversary of Gladiator for an edited collection. All areas of study, with a common goal of representing the cultural and material impact of the film since its release in May 2000."}, {"title": "Call for book chapters on Marguerite Henry's King of the Wind", "publisher_and_location": "Northwestern State University", "submission_deadline": "Friday, April 3, 2020", "description": "I invite chapter proposals on Marguerite Henry’s Newbery-winning novel King of the Wind for the first in a series of edited collections about Henry’s individual works, edited by Rachel L. Carazo (Northwestern State University). ,All areas of study, with a common goal of representing the cultural, social, philosophical, and material significance of King of the Wind are invited to participate. ,While writing my graduate thesis, “Conflicting Views of Culture and Power: The Arab World in Marguerite Henry’s King of the Wind”, Dawn Heinecken also published an article about the absence of scholarship on Henry’s works. These proposed collections therefore seek to increase the scholarship available about Marguerite Henry."}, {"title": "Human Cognition in Andreï Makine’s Oeuvre", "publisher_and_location": "Luxembourg School of Religion & Society", "submission_deadline": "Friday, May 15, 2020", "description": "Human Cognition in Andreï Makine’s Oeuvre ,La cognition humaine chez Andreï Makine ,  ,  ,Journées d’études organisées par Luxembourg School of Religion & Society ,Study days organized by Luxembourg School of Religion & Society ,                                   3 et 4 décembre 2020 – December 3-4, 2020 ,               Orateur invite – keynote speaker:"}, {"title": "Call for chapters: Call Me by Your Name edited collection", "publisher_and_location": "Dr. Edward Lamberti and Professor Michael Williams", "submission_deadline": "Monday, April 6, 2020", "description": "Call for chapters: Call Me by Your Name edited collection ,  ,Editors: Edward Lamberti and Michael Williams"}, {"title": "Digital Methodology in the Linguistic Study of Literature: Theory", "publisher_and_location": "MLA 2021 Annual Conv Linguistics and Literature Forum Exec Comm", "submission_deadline": "Monday, March 23, 2020", "description": "Digital Methodology in the Linguistic Study of Literature: Theory ,Linguistics and Literature Forum Session 1 ,MLA 2021 Annual Convention, Toronto, Jan 7-10 ,Digital tools have indisputably made many tasks in the linguistic study of literature much easier and faster than used to be. But the turn to digital methods has brought more than ease and efficiency; it has forever changed the field. What are the ways in which digital tools have shaped the linguistic study of literature? And what are the ways literary studies has itself inspired innovation, methods, and the development of new digital tools?"}, {"title": "Digital Methodology in the Linguistic Study of Literature: Practice", "publisher_and_location": "MLA Annual Conv 2021 Linguistics and Literature Forum Session", "submission_deadline": "Monday, March 23, 2020", "description": "Digital Methodology in the Linguistic Study of Literature: Practice ,Linguistics and Literature Forum Session 2 ,MLA 2021 Annual Convention, Toronto, Jan 7-10 ,Digital tools have become increasingly more important in the linguistic study of literature; for instance, they allow us to streamline much of our work. In what ways have digital methods made your work easier or more efficient? Do some tools lend themselves better to particular problems? What best practices have scholars found as they manage programs and data?"}, {"title": "MLA 2021 “#OwnVoices in Children’s and Adolescent Literature”", "publisher_and_location": "MLA GS Children’s and Young Adult Literature Forum", "submission_deadline": "Tuesday, March 10, 2020", "description": "MLA 2021 “#OwnVoices in Children’s and Adolescent Literature” ,Guaranteed Session Sponsored by the MLA GS Children’s and Young Adult Literature Forum ,Toronto, Ontario ,January 7-10, 2021 ,Panel Chair:  Brigitte Fielder ,  ,Deadline for submissions: 10 March 2020"}, {"title": "Old and new African Diaspora Networks: Intersections, Distinctions and Strategies", "publisher_and_location": "African Centre for the Study of the United States, Wits", "submission_deadline": "Wednesday, April 1, 2020", "description": "The conference will bring together scholars and intellectuals from the African diaspora, and/or those engaged in African diaspora research and engagement. It will offer perspectives on old and new diaspora from various theoretical, conceptual and disciplinary perspectives. The aim is to generate new knowledge that can inform not only scholarship but also work in the policy/government, civil society and business spheres. ,The conference is calibrated as an interdisciplinary, transdisciplinary and multidisciplinary congregation. Multiple viewpoints from which old and new diaspora can be explained and comprehended will be presented."}, {"title": "First Generation PhDs in the Academy", "publisher_and_location": "MLA 2021 Special Session", "submission_deadline": "Monday, March 16, 2020", "description": "\"While there is a growing and prominent literature on the experiences of first-generation undergraduate students, there is a lack of research on the experiences of first-generation graduate students. People tend to assume that if someone makes it through the bachelor’s degree, they enter graduate school on a level playing field.\" - Bailey Smolarek, Inside Higher Ed ,This proposed roundtable session for MLA 2021 seeks to explore the challenges and experiences faced by first-generation PhDs, both as graduate students and in their post-graduate careers. Some possible topics for exploration include:"}, {"title": "Short Fiction Criticism, SCMLA 2020", "publisher_and_location": "South Central Modern Language Association", "submission_deadline": "Monday, March 23, 2020", "description": "Now accepting proposals for the Short Fiction Criticism panel at the South Central Modern Language Association conference in Houston, Texas, October 8-10, 2020. ,Papers critically engaging short fiction in any language or time period will be considered. Approaches that engage the conference theme “Politics of Protest” are encouraged, as are papers that expand the definition of short fiction as a genre (to include, for example, graphic literature or digital media narratives). ,Please submit abstracts to Sarah Peters at speters@ecok.edu by March 23, 2020."}, {"title": "In the Wake of Red Power Movements. New Perspectives on Indigenous Intellectual and Narrative Traditions", "publisher_and_location": "Institute of Advanced Study, University of Warwick", "submission_deadline": "Sunday, March 15, 2020", "description": "This symposium explores North American Indigenous intellectual and narrative traditions that were recovered, reclaimed, or (re-)invented in the wake of Red Power movements that emerged in the 1960s in the settler colonial societies of Canada and the USA. It asks: which new perspectives and visions have been developed over the last 50 years within Indigenous studies and related fields when looking at Indigenous land and land rights, Indigenous political and social sovereignty, extractivism and environmental destruction, oppressive sex/gender systems, and for describing the repercussions of settler colonialism in North America, especially in narrative representations?"}, {"title": "Writing the Heavens. Celestial Observation in Literature, 800--1800 (May 20-22, 2021, Bamberg, Germany)", "publisher_and_location": "Aura Heydenreich, Florian Klaeger, Klaus Mecke, Dirk Vanderbeke, Jörn Wilms - ELINAS (Center for Literature and Natural Science)", "submission_deadline": "Sunday, May 31, 2020", "description": "In the Middle Ages and early modernity, celestial observation was frequently a subject for verbal rather than numerical and geometrical recording. Astronomical genres, in the hands of natural philosophers, poets, chroniclers, travellers, geographers, educators and others mediated knowledge of the heavens in textual form. Before the modern academic institutionalization of astronomy, such celestial knowledge extended from the cosmological to the meteorological, with applications and implications that touched upon a wide range of discourses, be they theological, legal, political, medical or agricultural."}, {"title": "Sidney and the Sidney Circle at SCSC 2020 (3 panels)", "publisher_and_location": "International Sidney Society", "submission_deadline": "Tuesday, March 31, 2020", "description": "SIDNEY AND THE SIDNEY CIRCLE AT THE SIXTEENTH-CENTURY SOCIETY CONFERENCE ,October 29-November 1, 2020, Baltimore, MD ,The International Sidney Society will sponsor three panels at the 2020 Sixteenth-Century Society Conference and invites paper proposals related to Philip Sidney, Mary Sidney Herbert, Lady Mary Wroth, the Sidney Family or the Sidney Circle generally. ,I.  Post-critical Reading and the Sidney Circle"}, {"title": "MLA 2021 | Breaking Textual Boundaries: Collaborative Writing and Multiple Authorship", "publisher_and_location": "Viviana Pezzullo", "submission_deadline": "Tuesday, March 10, 2020", "description": "MLA 2021 ,Toronto (Canada)  ,7-10 January, 2021 ,Breaking Textual Boundaries: Collaborative Writing and Multiple Authorship"}, {"title": "The 2021 MLA Call for Papers", "publisher_and_location": "LLC Pre-14th-Century Chinese Forum", "submission_deadline": "Sunday, March 15, 2020", "description": "The 2021 General Call for Papers , (LLC Pre-14th-Century Chinese Forum) ,(MLA Annual Convention Jan 7-10, 2021, Toronto) The following is a summary of call for papers from three panel sessions. The deadline of abstract submission is March 15, 2020. Abstract submission details are at the end of each panel description. ,  ,1.      Panel Title: Animal Perversions ,  ,Short description: ,This session will examine the eroticization (or non-eroticization) of particular animals within the pre-14th century Chinese cultural sphere, with specific attention to questions of sexuality, fetish, ethics, and species identity. ,  ,Details:"}, {"title": "\"Where are the Wonder Girls? Heroines and Persistence in Campus Novels\"", "publisher_and_location": "Modern Language Association", "submission_deadline": "Sunday, March 15, 2020", "description": "\"Where are the Wonder Girls? Heroines and Persistence in Campus Novels\"  ,  ,Call for Papers ,Modern Language Association Convention ,Toronto, Ontario ,January 7-10, 2021"}, {"title": "PORTALS: A Journal of Comparative Literature, Spring 2020 edition", "publisher_and_location": "Comparative Literature Student Association, San Francisco State University", "submission_deadline": "Friday, March 13, 2020", "description": "The Comparative Literature Student Association (CLSA) at San Francisco State University is accepting submissions for the  ,Spring 2020 edition of the literary journal Portals.  ,Portals is San Francisco State University’s global journal for scholarship in comparative and world literature. We publish student research, both from San Francisco State University and from universities around the world. Past volumes may be accessed at http://portalsjournal.com/. We will publish our more recent publications, including this year’s submissions, on this website."}, {"title": "Porn and Its Uses", "publisher_and_location": "Synoptique: An Online Journal of Film and Moving Image Studies", "submission_deadline": "Thursday, April 30, 2020", "description": "Call for Submissions: Porn and Its UsesSpecial Issue of Synoptique: An Online Journal of Film and Moving Image Studies French version on synoptique.ca Synoptique is inviting submissions for an upcoming special issue entitled “Porn and Its Uses.” Responding to the"}, {"title": "Envisioning Temporality in South Asian Studies: Anticolonial Past, Resistant Present and Radical Futures", "publisher_and_location": "Sritama Chatterjee", "submission_deadline": "Thursday, March 12, 2020", "description": "Paper proposals of 300 words and a 100 word bio-note are invited for South Asian Literary Association(SALA) nominated *guaranteed panel for MLA 2021* to be held in Toronto from 7th to 10th January, 2021 ,Deadline: 12th March, 2020.  ,Short Description of the panel : ,What are the modalities through which time is lived and imagined in South Asia? Abstracts of 300 words are invited by 12th March, 2020. ,Sritama Chatterjee, University of Pittsburgh (src88@pitt.edu)"}, {"title": "Teaching and CFP: MLA 2021, Training in Irish Studies for 2021 and Beyond: Where to Next?", "publisher_and_location": "MLA Irish Languages, Literatures, and Cultures (LLC) Forum", "submission_deadline": "Tuesday, March 24, 2020", "description": "A recent assessment of the state of the humanities (Williams, “The New Humanities,” Chronicle of Higher Education, 14 Nov. 2019) speaks of the rise of “hybrid humanities” -- increasingly collaborative research ventures built around subjects and approaches such as the environment, digital methods, global networks, and public-facing scholarship. And proficiency, if not mastery, in a second discipline after graduate school seems to be an emerging interest (and even need) among researchers according to an upcoming report on the needs of faculty in literature and writing studies conducted by Ithaka S+R and the MLA International Bibliography."}, {"title": "VERGE STUDIES IN GLOBAL ASIAS - Issue 9.1: Open Issue", "publisher_and_location": "VERGE STUDIES IN GLOBAL ASIAS", "submission_deadline": "Monday, November 1, 2021", "description": "VERGE STUDIES IN GLOBAL ASIAS ,Issue 9.1: Open Issue ,Deadline | November 1, 2021 ,verge@psu.edu"}, {"title": "Jameson's Postmodernism at 30 (Proposed Special Session, MLA 2021, January 7-10, Toronto, ON)", "publisher_and_location": "Ian Butcher / Fanshawe College", "submission_deadline": "Monday, March 23, 2020", "description": "Although Jameson's original essay was published in the New Left Review in 1984, Postmodernism, or The Cultural Logic of Late Capitalism appeared in 1991 and became one of the definitive texts on the topic."}, {"title": "VERGE STUDIES IN GLOBAL ASIAS: Issue 8.2 - Visualizing Asias: Interventions in Asian and Asian Diasporic Art", "publisher_and_location": "VERGE STUDIES IN GLOBAL ASIAS", "submission_deadline": "Saturday, May 1, 2021", "description": "Issue 8.2- Visualizing Asias: Interventions inAsian and Asian Diasporic Art ,Edited by Laura Kina (DePaul University) and Chang Tan (Penn State) ,Deadline May 1, 2021 | verge@psu.edu"}, {"title": "VERGE STUDIES IN GLOBAL ASIAS: ISSUE 8.1 - Indian Ocean Studies, Afro-Asian Affinities", "publisher_and_location": "VERGE STUDIES IN GLOBAL ASIAS", "submission_deadline": "Sunday, November 1, 2020", "description": "Indian Ocean Studies, Afro-Asian Affinities ,Edited by Emmanuel Bruno Jean-Francois (Penn State) & ,Neelima Jeychandran (Penn State) ,Deadline November 1, 2020| verge@psu.edu"}, {"title": "VERGE STUDIES IN GLOBAL ASIAS: ISSUE 7.2 DIGITAL ASIAS", "publisher_and_location": "Verge: Studies in Global Asias", "submission_deadline": "Friday, May 1, 2020", "description": "VERGE STUDIES IN GLOBAL ASIAS ,ISSUE 7.2 DIGITAL ASIAS ,Edited by Jonathan E. Abel (Penn State) ＆ Joseph Jonghyun Jeon (UC-Irvine) ,Deadlines | verge@psu.edu ,Essays | May 1, 2020"}, {"title": "Literary Monsters - SAMLA - November 13-15, 2020", "publisher_and_location": "Tracie Provost / Middle Georgia State University", "submission_deadline": "Wednesday, May 20, 2020", "description": "In today's culture, it's almost impossible to avoid \"monsters.\"  Straight from mythology and legend, these fantastic creatures traipse across our television screens and the pages of our books.  Over centuries and across cultures, the inhuman have represented numerous cultural fears and, in more recent times, desires. They are Other. They are Us. This panel will explore the literal monsters--whether they be mythological, extraterrestrial, or man-made--that populate fiction and film, delving into the cultural, psychological and/or theoretical implications."}, {"title": "Speculative Fiction - SAMLA - November 13-15, 2020", "publisher_and_location": "Mert Gareis / Middle Georgia State University", "submission_deadline": "Wednesday, May 20, 2020", "description": "Speculative fiction covers a broad range of narrative styles and genres.  The cohesive element that pulls works together under the category is that there is some “unrealistic” element, whether it’s magical, supernatural, or a futuristic/technological development: works that fall into the category stray from conventional realism in some way.   For this reason, speculative fiction can be quite broad, including everything from fantasy and magical realism to horror and science fiction—from China Miéville to Margaret Atwood to Philip K. Dick. This panel aims to explore those unrealistic elements and all their varied implications about society, politics, economics, and more."}, {"title": "Cultures of Collectivity and Manuscript Evidence", "publisher_and_location": "The Research Group on Manuscript Evidence at the Midwest Modern Language Association", "submission_deadline": "Friday, May 1, 2020", "description": "The Research Group on Manuscript Evidence, in keeping with the MMLA conference’s theme of “Cultures of Collectivity,” is sponsoring panels on collecting and manuscripts, broadly conceived. Possible foci include, strictly by way of example: specific archives, collections, or even gatherings of texts in particular manuscripts; reading communities or scribal centers; book markets; and the collections of material resources involved in manuscript production. We invite all approaches—including hermeneutical, textual, art historical, codicological, and paleographical—across all time periods."}, {"title": "Call for Papers: Rocky Mountain Medieval and Renaissance Association Annual Conference (Aug. 2020-Due 1 May)", "publisher_and_location": "Rocky Mountain Medieval & Renaissance Association", "submission_deadline": "Friday, May 1, 2020", "description": "The Rocky Mountain Medieval and Renaissance Society (RMMRA) invites papers on any topic relating to the period 400 -1700 and welcomes scholars in a broad range of disciplines including history, literature, art history, music, and gender studies with special consideration given to papers and proposals on this year’s theme, “Antique Modes of Thought, Romantic Traditions, and Legendary Storytelling in the Middle Ages and Renaissance.” ,Submissions should be directed through our online portal at www.memberplanet.com/s/rmmra/rmmra2020cfp. Questions about the conference or membership should be directed to rmmraconf@gmail.com."}, {"title": "[UPDATE] MLA 2021 CFP: State of the Body: Health and Illness in the 21st Century", "publisher_and_location": "Tana Jean Welch / Florida State University College of Medicine", "submission_deadline": "Sunday, March 15, 2020", "description": "What methodologies and/or texts best help us make sense of our current bodily relationship to health, illness, and medicine? Papers utilizing posthumanism, new materialism, feminist science studies, or other philosophical tools are welcome. All literary genres and time periods will be considered. ,This cfp is purposefully broad; the focus of the panel(s) created will be more specific. ,This panel is sponsored by the medical humanities forum of the MLA. ,Submit 250- to 500-word abstracts and a CV, by March 15, 2020, to Tana Jean Welch, Florida State University College of Medicine, at tana.welch@med.fsu.edu"}, {"title": "Foreseeing Race: The Technology and Culture of Risk Prediction after the Datalogical Turn", "publisher_and_location": "Journal of American Studies (Cambridge University Press)", "submission_deadline": "Saturday, October 31, 2020", "description": "Foreseeing Race: The Technology and Culture of Risk Prediction after the Datalogical Turn  ,Special issue, Journal of American Studies ,Editors:  ,Georgiana Banita (University of Bamberg) ,R. Joshua Scannell (The New School)"}, {"title": "Contested Archives and the Intellectual Histories of Indian Modernity: From the Precolonial to the Postcolonial", "publisher_and_location": "Faculty of History, University of Cambridge", "submission_deadline": "Friday, March 20, 2020", "description": "Call for Papers: Workshop on Indian Intellectual History ,Friday, 29th May, 2020. (Deadline for abstract submission: 20th March, 2020) ,Faculty of History, University of Cambridge. ,  ,Contested Archives and the Intellectual Histories of Indian Modernity: From the Precolonial to the Postcolonial"}, {"title": "MLA 2021 Toronto: Laughter & Feminist Critical Thought", "publisher_and_location": "Maggie Hennefeld / University of Minnesota", "submission_deadline": "Friday, March 20, 2020", "description": "Feminist theory has always enjoyed a productive but uneasy relationship with laughter. What are the limits and potentials of laughing paradigms for the future of feminist critical thought? ,  ,Topics May Include (but are not limited to):"}, {"title": "Postcolonial Optimism (MLA 2021)", "publisher_and_location": "Jeremy De Chavez and Katherine Hallemeier", "submission_deadline": "Sunday, March 15, 2020", "description": "Optimism is not readily associated with the postcolonial. Indeed, postcolonial writing has been described as melancholic and postoptimistic, a repository of the injurious legacies of empire. It is a reputation consonant with postcolonialism’s revelatory project of unmasking imperial designs in canonical texts and exposing complicity in postcolonial writing. In addition, almost by definition, the postcolonial novel expresses disillusionment with nationhood and the developmentalist logics that frame it."}, {"title": "Technoculture Volume 10 (2020)", "publisher_and_location": "Technoculture: an online journal of technology in society", "submission_deadline": "Monday, August 3, 2020", "description": "For our tenth year anniversary issue, Technoculture is seeking critical essays and creative works from a broad range of academic disciplines that focus on cultural studies of technology, and especially on the future of the study of technology and culture. ,Essays and creative works we publish examine the topic technology and society, or, perhaps, technologies and societies. This call is ongoing and open topic, and we encourage a broad definition of technology. Topics could include depictions of technologies that treat a wide range of subjects related to the social sciences and humanities."}, {"title": "MSA 2020 - Millay, Lowell, Teasdale, and the ‘Sentimental’ Modern Poet", "publisher_and_location": "Modernist Studies Association", "submission_deadline": "Friday, March 13, 2020", "description": "Call for Proposals ,Millay, Lowell, Teasdale, and the ‘Sentimental’ Modern Poet ,  ,Modernist Studies Association ,Brooklyn, NY ,22-25 October 2020 ,  ,Organized by Sarah Parker (Loughborough University) and Francisco E. Robles (University of Notre Dame)"}, {"title": "Scandalous Short Stories", "publisher_and_location": "Timothy K. Nixon, SAMLA (South Atlantic Modern Language Association)", "submission_deadline": "Sunday, May 31, 2020", "description": "SAMLA 92 will be taking place in Jacksonville, Florida, from November 13th to the 15th. The theme of this year's conference is SCANDAL! This particular panel considers the genre of the short story juxtaposed with the conference's theme: Scandal. We welcome proposals considering short works of fiction that are scandalous, that caused a scandal, or that were inspired by scandal. By May 31st, please send a 200-word abstract, brief biography (no more than 75 words), and A/V requirements to Dr. Timothy K. Nixon, Shepherd University, at tnixon@shepherd.edu."}, {"title": "Dostoevsky at 200: International Receptions (MLA 2021)", "publisher_and_location": "International Dostoevsky Society / Reception Study Society", "submission_deadline": "Sunday, March 15, 2020", "description": "Considerable research has been devoted to Fyodor Dostoevsky's incorporation of non-Russian art and texts as inspiration for his writing. Comparatively less attention, however, has been to paid to the immense influence the author's own life and works have had on literature, drama, philosophy, and art. This panel seeks to explore Dostoevsky's reception, as a man and as an author, by 20th and 21st century world writers and artists. It is co-sponsored by the International Dostoevsky Society and the Reception Study Society in celebration of the author's 200th year. ,Potential topics include, but are not limited to:"}, {"title": "Global Indigeneity (MLA 2021)", "publisher_and_location": "Ahmed Idrissi", "submission_deadline": "Friday, March 20, 2020", "description": "Considers theoretical and political questions raised by the model of “trans-indigeneity” paying attention to indigenous mythologies, histories of settler colonialism, and questions of comparison, translation, resistance, language, and appropriation.  Send 300-word abstract and short bio by March 20, 2020 to Ahmed Idrissi aidrissi@prdue.edu and Neville Hoad nhoad@austin.utexas.edu"}, {"title": "From Proletariat to Precariat: Representations of Class and Identity in Working-class writing from the 1930s to the present", "publisher_and_location": "The University of Birmingham", "submission_deadline": "Thursday, April 30, 2020", "description": "We invite submissions to an interdisciplinary conference on working -class fiction, to be held at the University of Birmingham in June. ,  ,In a recent Guardian article Tim Lott laments the death of the English working-class novel and likewise that of the English working-class literary novelist. He qualifies his pronouncement, by remarking the delineation ‘English’ is used advisedly, for ‘the same is not true of Scotland’. Nevertheless, he may have also appended the modifiers ‘White’ and ‘Male’ before ‘English’ so as to complete the chain of associations traditionally linked to working-class writing."}, {"title": "CFP Fashion and Material Culture, MPCA/ACA", "publisher_and_location": "Luxx Mishou, Area Chair/ The Midwest Popular Culture Association/Midwest American Culture Association", "submission_deadline": "Thursday, April 30, 2020", "description": "CALL FOR PAPERS, ABSTRACTS, AND PANEL PROPOSALS ,  ,Fashion and Material Culture, MWPCA/ACA ,   ,The Fashion and Material Culture area of The Midwest Popular Culture Association/Midwest American Culture Association is now welcoming abstracts, papers, and panel proposals for its 2020 meeting in Minneapolis, Minnesota on October 2-4, 2020."}, {"title": "Refugee Forms: Essays on the Culture of Flight and Refuge (edited collection)", "publisher_and_location": "Mike Classon Frangos", "submission_deadline": "Friday, April 17, 2020", "description": "Call for Papers ,Refugee Forms: Essays on the Culture of Flight and Refuge ,Co-editors: Sheila Ghose (Södertörn University)Mike Classon Frangos (Linnaeus University) ,The edited collection Refugee Forms: Essays on the Culture of Flight and Refuge aims to bring together research on the genres, forms, media and histories of refugee migration. Chapters are invited from a range of disciplines, and interdisciplinary approaches are especially welcome. Contributions may focus on refugee migration through the lens of particular genres, forms, media or histories, addressing such topics as:"}, {"title": "“Blood on the Leaves / And Blood at the Roots”: Reconsidering Forms of Enslavement and Subjection across Disciplines", "publisher_and_location": "University of Warwick", "submission_deadline": "Monday, April 20, 2020", "description": "“Blood on the Leaves / And Blood at the Roots”: ,Reconsidering Forms of Enslavement and Subjection across Disciplines ,  ,18th June 2020: ,Pre-conference panel on getting published & networking event for postgraduate students and early career researchers and practitioners ,Supported bythe Institute for Advanced Studies (IAS) ,  ,19th-20th June 2020 ,Conference at the University of Warwick, Coventry, UK"}, {"title": "Travel Literature and Transatlantic Encounters: “The Iberian Peninsula as seen from North America (1850-1950)\"", "publisher_and_location": "Sara Prieto", "submission_deadline": "Tuesday, March 10, 2020", "description": "Travel Literature and Transatlantic Encounters: “The Iberian Peninsula as seen from North America (1850-1950)\" ,University of Alicante (Spain), June 4-5, 2020. ,This conference is part of the research project \"Exotic Spain: American Travel Literature about Spain (1900-1950)\" (ATLAS) funded by the Research and Knowledge Transfer Office of Alicante University (GRE18-14 A). The project focuses on the study of a corpus of American authors who traveled to Spain in the first half of the twentieth century, especially on those texts that look beyond the vision of Spain related to the experience of the Spanish Civil War."}, {"title": "Ambiguity and Narratology (Interdisciplinary and Diachronic Workshop)", "publisher_and_location": "Universität Tübingen, GRK 1808 Ambiguität", "submission_deadline": "Monday, June 15, 2020", "description": "(with apologizes for cross posting) ,Dear all, ,The Research Training Group 1808: Ambiguity - Production and Perception of the Eberhard Karls Univeristät Tübingen is delighted to announce the CfP for the interdisciplinary and diachronic Workshop ,Ambiguity and Narratology ,Tübingen, November 5-7 2020"}, {"title": "Neohelicon Special Issue: Epidemics and Plagues in Literature", "publisher_and_location": "Neohelicon", "submission_deadline": "Friday, May 1, 2020", "description": "Neohelicon Special Issue: Never Really Away from Us---Epidemics and Plagues in Literature"}, {"title": "VICTORIAN WOMEN NOVELISTS: NAVIGATING PLACE IN BRITISH SOCIETY", "publisher_and_location": "Calabria Turner, Georgia State University, SAMLA 92", "submission_deadline": "Monday, June 1, 2020", "description": "British women novelists of the Victorian era often explored the accepted and shifting concepts of woman’s role at home, in the workplace, and in society as a whole. Charlotte Bronte, George Eliot, and Oliver Schreiner, for example, discuss a woman’s right to education and the careers open to her as well as how she chooses, if she has a choice. This panel will explore these writers’ arguments for women’s equality and examine repercussions deriving from their writing. Panelists might address such questions as how authors expressed their acceptance of or discontent with women’s position in society or whether the conversation changed as the nineteenth century came to an end. Papers should not exceed 15 minutes."}, {"title": "ASLE panel at RMMLA Convention (October 2020)", "publisher_and_location": "Rocky Mountain Modern Languages Association/ Association for the Study of Literature and the Environment", "submission_deadline": "Tuesday, March 31, 2020", "description": "Proposals are now being accepted for the Association for the Study of Literature and Environment (ASLE) permanent panel at the Rocky Mountain Modern Languages Association (RMMLA) annual convention. This year’s conference will take place October 8–10 in Boulder, Colorado. Proposals on any topic related to ecocriticism and the environmental arts and humanities are welcome, including pedagogical papers. Proposals of 250–300 words should be sent to Lowell Wyse at Lowell.Wyse@gmail.com by March 31, 2020."}, {"title": "MMLA 2020: Travel Writing/Writing Travel Session", "publisher_and_location": "Shannon Derby/Midwest Modern Language Association", "submission_deadline": "Sunday, April 5, 2020", "description": "Travel is a vehicle for which to explore the condition of living, how our relationships to place shape us and our experiences, how our identities and political histories inform place, how power structures inform how we migrate (or don’t) and how that affects the places we pass through. --Bani Amor, “Getting Real About Decolonizing Travel Culture” (2017)"}, {"title": "Love Beyond the (Hu)man", "publisher_and_location": "Dr. Lilith Acadia & Dr. Clare Tebbutt, Trinity College Dublin", "submission_deadline": "Tuesday, March 31, 2020", "description": "Love Beyond the (Hu)man    ,Trinity Long Room Hub Arts & Humanities Research Institute ,Dublin, Ireland | 26 June, 2020 ,  ,Donna Haraway and her tree snails, Alice Walker and Marley,  ,Lotte Laserstein’s “Self-portrait with a cat,” Lazi’s crocodile…"}, {"title": "Fantastic (Fantasy & Science Fiction / Monsters & the Monstrous) (NEPCA Manchester, NH 10/23-24/2020)", "publisher_and_location": "Michael Torregrossa, Northeast Alliance for Scholarship on the Fantastic", "submission_deadline": "Monday, June 1, 2020", "description": "Call for Papers on the Fantastic (Fantasy & Science Fiction / Monsters & the Monstrous) ,The Northeast Alliance for Scholarship on the Fantastic and the allied Fantastic Areas (Fantasy & Science Fiction and Monsters & the Monstrous) invite paper proposals for the 2020 conference of the Northeast Popular Culture/American Culture Association (NEPCA) to convene at Southern New Hampshire University in Manchester, New Hampshire, from Friday, 23 October, to Saturday, October 24. ,The deadline for proposals is June 1, 2020."}, {"title": "The Robert Frost Society Call for Papers", "publisher_and_location": "Daniel Toomey/The Robert Frost Society", "submission_deadline": "Sunday, March 22, 2020", "description": "For its MLA Convention 2021 (Toronto) Panel, the Robert Frost Society seeks papers offering fresh insights into the writing and life of Robert Frost.  All paper topics will be considered.  Some possible subject areas: influences on Frost's own writing and his influences on that of others; deeper analyses of overlooked or underappreciated poems, prose pieces, and plays; and analytical work that furthers our understanding of Frost's philosophical dualism."}, {"title": "\"Energy and Infrastructure: An Environmental Humanities Roundtable\" (MLA 2021)", "publisher_and_location": "Association for the Study of Literature and Environment", "submission_deadline": "Sunday, March 1, 2020", "description": "\"Energy and Infrastructure: An Environmental Humanities Roundtable\" (MLA 2021) ,Jacob Goessling, Jordan B. Kinder, and Andrew B. Ross ,A non-guaranteed roundtable organized by the Association for the Study of Literature and Environment"}, {"title": "SVOD Platforms and the Future of Television - Call for Chapter Proposals", "publisher_and_location": "Dr. Christina Adamou and Dr. Sotiris Petridis, Aristotle University of Thessaloniki", "submission_deadline": "Friday, May 15, 2020", "description": "SVOD Platforms and the Future of Television - Call for Chapter Proposals ,Edited by Christina Adamou and Sotiris Petridis ,  ,Deadline for proposals: 15 May 2020 ,Notification of Acceptance: by 01 June 2020 ,Deadline for chapters: 01 October 2020"}, {"title": "Closer Together-Further Apart: Cross-Cultural Perspectives in Academia", "publisher_and_location": "University of Utah", "submission_deadline": "Friday, March 20, 2020", "description": "Call for Papers: ,Sego Graduate Student Language and Culture ConferenceDepartment of World Languages and Cultures at the University of UtahCloser Together-Further Apart: Cross-Cultural Perspectives in Academia ,April 10-11, 2020"}, {"title": "MMLA 2020 Popular Culture Permanent Session CFP: Fan Responses to Popular Culture", "publisher_and_location": "Midwest Modern Language Association", "submission_deadline": "Sunday, April 5, 2020", "description": "Last year, when Fox canceled the television show Lucifer, a fan campaign to save the show resulted in Netflix picking it up for another season. This was not an isolated incident. Collectives of fans, gathering both online and in person, often influence the longevity, the content, the dispersal, and the afterlife of their favorite shows, games, songs, and other popular culture artifacts. In response to the conference theme “Cultures of Collectivity,” the popular culture permanent session invites papers that investigate how both planned and spontaneous groups appropriate or influence popular culture. ,  ,Potential topics include, but are not limited to: ,                Fan based activism of all sorts"}, {"title": "Unedited / Under-edited Renaissance Texts", "publisher_and_location": "Renaissance English Text Society", "submission_deadline": "Friday, March 27, 2020", "description": "Unedited / Under-edited Renaissance Texts ,Renaissance English Text Society Panel ,SCSC, Baltimore, October 29 – November 1, 2020 ,  ,            Abstracts are invited for the Renaissance English Text Society panel at the Sixteenth Century Society and Conference in Baltimore, 29 October - 1 November 2020. Twenty-minute papers should focus on some aspect of unedited or under-edited texts derived from manuscript and/or print witnesses written in English during the sixteenth century or first half of the seventeenth. Papers may address:"}, {"title": "MMLA 2020: Creative Writing (Poetry) CFP", "publisher_and_location": "MMLA Creative Writing (Poetry) Permanent Section", "submission_deadline": "Sunday, April 5, 2020", "description": "2020 MMLA Annual Convention: Milwaukee, Wisconsin ,November 5-8, 2020 ,Creative Writing II: Poetry Permanent Section CFP ,“Cultures of Collectivity: Community, Collaboration, and Poetic Practice”"}, {"title": "Call for Book Reviews", "publisher_and_location": "Journal of Popular Culture", "submission_deadline": "Monday, June 1, 2020", "description": "Hello: ,I currently have several books available for review for The Journal of Popular Culture.  These reviews would be due May 1, 2019.  If you have a completed Master's degree or higher, one of these books is in your field of study, and you are committed to writing a review for us, please contact me at t.jenkins@tcu.edu, noting your preferred title and your mailing address.  The reviews need to be between 500 and 1,000 words and documented in MLA style.  Further guidelines can be found at: http://www.journalofpopularculture.com/submissions ,Many thanks! ,Tricia Jenkins ,Texas Christian University"}, {"title": "Call for Papers - Journal of Literary and Cultural Studies", "publisher_and_location": "Journal of Literary and Cultural Studies", "submission_deadline": "Tuesday, March 31, 2020", "description": "Submissions invited for the inaugural issue of the Journal of Literary and Cultural Studies. The Journal is being launched from this year to commemorate the Birth Centenary of legendary English Professor Late P. S. Sastri (Nagpur University). It’ll be published thrice a year and shall cover interdisciplinary research in all forms and genres of literature, art, and culture such as fiction, folklore, film/ theatre, travel writing, popular culture, translation, gender and sexuality studies, ecocriticism, globalization and urban studies, race, ethnicity, subaltern and Dalit studies, and all related areas."}, {"title": "Special Issue on David Mamet in the 21st Century - Texas Studies in Literature and Language", "publisher_and_location": "Texas Studies in Literature and Language", "submission_deadline": "Saturday, May 1, 2021", "description": "David Mamet in the Twenty-First Century ,a special issue of Texas Studies in Literature and Language (TSLL) ,Edited by Douglas Bruster and Brice Ezell"}, {"title": "Finding Home: Migration, Placemaking & Research Creation Symposium", "publisher_and_location": "Ryerson University", "submission_deadline": "Sunday, March 15, 2020", "description": "Call for Proposals ,Finding Home: Migration, Placemaking & Research Creation Symposium ,May 22-23 ,Ryerson University, Toronto ,  ,Finding Home: Migration, Placemaking & Research Creation,  a 2-day symposium May 22-23 at Ryerson University in Toronto, invites scholars, policy-makers, artists, migrants and other stakeholders to join us in round table discussions, performances, film screenings and workshops. The symposium is the culminating event of a SSHRC-funded 2-year international project examining the concept of home for forced migrants of all identities, using arts-based research."}, {"title": "Romantic Interventions: From Idealism to Activism", "publisher_and_location": "TU Dortmund University", "submission_deadline": "Tuesday, March 31, 2020", "description": "Call for Papers ,Romantic Interventions: From Idealism to Activism ,  ,February 11-13, 2021, TU Dortmund University, Germany ,Conference Homepage: https://rominter2021.wixsite.com/tudortmund"}, {"title": "Hwa Kang English Journal", "publisher_and_location": "Department of English Language and Literature, Chinese Culture University", "submission_deadline": "Tuesday, March 31, 2020", "description": "Call for Papers ,Hwa Kang English Journal, Vol. 25 (July 2020)"}, {"title": "Painful Pleasure, Pleasurable Pain", "publisher_and_location": "JSBC", "submission_deadline": "Wednesday, July 1, 2020", "description": "Painful Pleasure, Pleasurable Pain ,  ,Call for Contributions ,  ,JOURNAL FOR THE STUDY OF BRITISH CULTURES ( 2/2022) ,  ,Guest Editors: Sarah Schäfer-Althaus and Cornelia Wächter"}, {"title": "Supermodels of the World: RuPaul’s Drag Race as International Phenomenon", "publisher_and_location": "Danny Cookney / University of Salford", "submission_deadline": "Friday, May 1, 2020", "description": "Supermodels of the World: RuPaul’s Drag Race as International Phenomenon ,A One-Day Interdisciplinary Symposium ,  ,School of Arts and Media, University of Salford, UK. ,25th September 2020 ,  ,  ,Since its 2009 debut, RuPaul’s Drag Race has shifted from a niche American reality show anomaly to an award-winning global success. This one day symposium will examine its international reach with versions of the contest created in the UK, Thailand and Canada alongside, titular host, Rupaul having already hinted at further growth when teasingly asking journalists “how many countries are there?”."}, {"title": "Journals of Decolonization", "publisher_and_location": "Maryam Fatima/ University of Massachusetts Amherst", "submission_deadline": "Sunday, March 15, 2020", "description": "This cfp is for a special session at the Modern Language Association's annual convention in Toronto (7-10 Jan 2021)"}, {"title": "Modernism, Empire, and the Environment (MSA 2020 Panel)", "publisher_and_location": "Elizabeth Dinneny / University of Maryland, College Park", "submission_deadline": "Friday, March 6, 2020", "description": "“Modernism, Empire, and the Environment” ,MSA 2020 Brooklyn panel ,22-25 October 2020 ,Abstracts due 3/6/20"}, {"title": "Call for Abstracts:  Theatre in a Post-Truth World: Texts, Politics, and Performance", "publisher_and_location": "William C. Boles", "submission_deadline": "Sunday, April 19, 2020", "description": "In 2016 Oxford Dictionaries named ”Post-truth” as the international word of the year, but as Lee McIntyre argues in his book Post-Truth (MIT, 2018), the concept of post-truth is not a new one, as he cites the vociferous arguments made against the cancer causing effects of cigarettes, the assault on vaccinations, and other significant moments of push-back that have occurred when the facts will out.  ,However, in the 2010s the omnipresent nature of post-truth arguments has accelerated and is now an omnipresent part of our lives (on international, national, regional, and communal scales). ,The theatre, as one might imagine, has noticed and has responded."}, {"title": "MOVE! (Conversations in Motion)", "publisher_and_location": "Queens College, City University of New York", "submission_deadline": "Tuesday, March 10, 2020", "description": "CALL FOR PAPERS ,Seventh Annual Queens College English Graduate Conference  ,  ,MOVE! ,Conversations in Motion  ,  ,Conference Date: April 29, 2020 ,Keynote Speaker: Cristina Pérez Jiménez (Manhattan College) ,Submission Deadline: March 10, 2020"}, {"title": "SEA 2021 Biennial Conference: Call for Panels", "publisher_and_location": "Society of Early Americanists", "submission_deadline": "Friday, May 15, 2020", "description": "CALL FOR PANELS ,SUBMISSION DEADLINE: May 15, 2020"}, {"title": "Violence in Art Book (Call for Submissions)", "publisher_and_location": "GCRR Press", "submission_deadline": "Wednesday, April 1, 2020", "description": "GCRR is currently seeking written or visual submissions to be anthologized in a bound publication dedicated to the theme of violence in art (or perhaps the absence of violence in art). We welcome both industry leaders and scholars from the disciplines of art, humanities, design, technology, and education to submit abstracts of their essay that will make a unique contribution to the academic study of violence and art. Abstracts or Proposals are due March 1, 2020. ,Final scholarly submissions should be approximately 3000 words, or 500 words and mixed media, that address one of the following:"}, {"title": "Diverse Projects on American Lit - archival, bibliographical, pedagogical, DH", "publisher_and_location": "Resources for American Literary Study (Penn State UP)", "submission_deadline": "Friday, March 6, 2020", "description": "Resources for American Literary Study, the leading journal of archival and bibliographical scholarship in American literature, is inviting submissions for 2020. Covering all periods of American literature, RALS welcomes both traditional and digital approaches to archival and bibliographical analysis. The journal also welcomes pedagogically focused submissions examining archival study in the classroom. Due to the nature of the journal, there is no minimum or maximum length for submissions, and we encourage innovative projects and approaches that will serve as resources for the field."}, {"title": "The Age of Innocence at 100", "publisher_and_location": "Edith Wharton Review", "submission_deadline": "Monday, August 31, 2020", "description": "The Age of Innocence at 100"}, {"title": "MLA 2021 - Bureaucratic Poetics", "publisher_and_location": "Alexandra Irimia / Western University", "submission_deadline": "Sunday, March 15, 2020", "description": "This proposal for a special session panel at the 2021 MLA Convention (Toronto, Jan 7-10) invites 250-word abstracts for critical, theoretical, and comparative explorations of literary works involving bureaucratic subjects, settings, and tropes. Particular emphasis falls on clerk figures and paperwork, analyzed in their poetic and narrative complexities. ,  ,Please send your abstracts to airimia2@uwo.ca by March 15. ,  ,Official call: ,https://mla.confex.com/mla/2021/webprogrampreliminary/Paper12865.html"}, {"title": "MLA Toronto Roundtable: The Practice of Persistence at Access-Oriented Institutions", "publisher_and_location": "Joseph Donica and Leah Richards", "submission_deadline": "Tuesday, March 10, 2020", "description": "Modern Language Association 2021 Convention, Toronto, Canada, 7-10 January 2021  ,Session Title:  The Practice of Persistence at Access-Oriented Institutions"}, {"title": "EXTENDED DEADLINE: Cinematic Representations of Women in Modern Celebrity Culture (1900-1950) (edited collection)", "publisher_and_location": "Leticia Perez Alonso / Jackson State University", "submission_deadline": "Tuesday, April 7, 2020", "description": "We invite proposals for contributions to an edited collection on cinematic representations of women in works of art, poetry, fiction, theater and criticism of the avant-garde. The popularization of film stars such as Blanche Sweet, Mae Marsh, Mary Pickford, Greta Garbo and Brigitte Helm shaped the cultural imaginary of modernity to such an extent that they influenced the creative activity of artists and writers in the years 1900-1950. Questions centering on feminine stardom will set the background of this collection of essays examining the intersections of vanguardism with popular culture, publicity and performance. How are images of femininity circulated and consumed by the spectators of the cinematic medium?"}, {"title": "International Conference on Challenges and Solutions in Education, Teaching and Learning", "publisher_and_location": "London Centre for Interdisciplinary Research", "submission_deadline": "Friday, May 15, 2020", "description": "“Challenges and Solutions in Education, Teaching and Learning” - International Conference26 September 2020 – London, UKorganised by London Centre for Interdisciplinary Research"}, {"title": "Economy and Value of Time in Boredom", "publisher_and_location": "MLA 2021 Special Session", "submission_deadline": "Sunday, March 15, 2020", "description": "This special session invites papers examining the problem of time in boredom in 19th-20th century literature, particularly in the context of value and economy of time in relation to boredom. Please send 250 word abstracts and short bios by March 15, 2020"}, {"title": "Sadomasochism in Medieval Cultures", "publisher_and_location": "Christopher Vaccaro", "submission_deadline": "Sunday, March 15, 2020", "description": "Painful Pleasures: Sado-masochism in Medieval Cultures ,Editor, Christopher T. Vaccaro ,  ,  ,Call for Papers"}, {"title": "Updated - Afrofuturisms: Re-imagining Contemporary Blackness in History, Art, Technology, and Culture", "publisher_and_location": "'BioDun Ogundayo, Tracee Howell", "submission_deadline": "Tuesday, March 31, 2020", "description": "Afrofuturisms: Re-imagining Contemporary Blackness in History, Art, Technology, and Culture"}, {"title": "NEW REMINDER: Il Parlaggio - new issue May 2020", "publisher_and_location": "Edizioni Sinestesie (Italy)", "submission_deadline": "Wednesday, April 1, 2020", "description": "This section of the academic journal “Sinestesieonline” is open to contributions about theatre and performing arts in all historical ages, forms and variations, in English, Italian and foreign languages. We use double blind peer review. ,“Il Parlaggio” is the name created by Gabriele d’Annunzio for the amphitheatre in Vittoriale – a place of empathy, a cradle of emotions, a crossroads of cultures, a connection between antiquity and contemporaneity, an emblem of the “neverending show”."}, {"title": "Call for Articles: Special Issue 'Locating the Centre in Contemporary Literature'", "publisher_and_location": "Alluvium", "submission_deadline": "Friday, March 6, 2020", "description": "CfP Alluvium 7.7 – Special Issue: 'Locating the Centre in Contemporary Literature' ,Alluvium is an open access journal featuring short essays of around 2,000 words on key issues and emerging trends in 21st-century writing and criticism. The journal publishes six issues a year, employing a system of post-publication peer-review by the engaged commentariat on the message boards of the journal’s website, enabling vital current ideas to find a rapid readership. (see https://www.alluvium-journal.org/)"}, {"title": "Changing Tides and Hemispheric Connections in Caribbean and Latin American Studies: 18th Annual Tri-University CLAS Conference", "publisher_and_location": "Florida Atlantic University CLAS", "submission_deadline": "Monday, February 17, 2020", "description": "Changing Tides and Hemispheric Connections in  ,Caribbean and Latin American Studies ,18th Annual Tri-University CLAS Conference | March 27, 2020"}, {"title": "Poems Invited for June 2020 Issue of Taj Mahal Review 37th Issue", "publisher_and_location": "Cyberwit.net", "submission_deadline": "Friday, May 15, 2020", "description": "Poems Invited for JUNE 2020 Issue of Taj Mahal Review 37th Issue"}, {"title": "Multidisciplinary Perspectives of Islam after 9/11", "publisher_and_location": "Priyadarshini Gupta, Assistant Professor of English at O.P. Jindal Global University", "submission_deadline": "Wednesday, March 18, 2020", "description": "In addition to Islamophobia, this panel investigates other paradigms in the representation of Muslims in multidisciplinary fields post-9/11 and investigates how [neo]orientalist estrangement of Muslims apply differently in different landscapes. Send bio and a 300-word abstract to Priya at priyadarshini@jgu.edu.in"}, {"title": "Marxist Sexualities", "publisher_and_location": "Marxist Reading Group, University of Florida", "submission_deadline": "Friday, February 28, 2020", "description": "Marxist Sexualities  ,The Twenty-Second Annual Conference of the Marxist Reading Group  ,Keynote Speakers: Kathi Weeks and Holly Lewis ,2-4 April 2020 ,University of Florida, Gainesville, FL"}, {"title": "Contested Imaginaries", "publisher_and_location": "Concordia University Interdisciplinary Humanities Graduate Conference", "submission_deadline": "Friday, February 21, 2020", "description": "Call for Abstracts - EXTENDED ,  ,This conference is organized by students in the Humanities PhD Program at Concordia University, Montréal, Canada.  ,Conference Dates: April 24-25, 2020  ,EXTENDED Abstract Submission Deadline: February 28, 2020 ,  ,Contested Imaginaries"}, {"title": "Humanity, Humane and Post-Human", "publisher_and_location": "Graduate Forum - Department of Classical and Modern Languages, Literatures and Cultures, Wayne State University", "submission_deadline": "Friday, February 28, 2020", "description": "WAYNE STATE UNIVERSITY  ,18th ANNUAL GRADUATE FORUM CONFERENCE ,CALL FOR PAPERS ,HUMANITY, HUMANE AND POST-HUMAN"}, {"title": "[EXTENSION] NWSA 2020: Aging and The Poetics, Politics, and Praxis of Transnational Feminisms.", "publisher_and_location": "National Women's Studies Association", "submission_deadline": "Sunday, February 23, 2020", "description": "The Age and Ageism Caucus of the National Women's Studies Association is seeking submissions for the 2020 annual NWSA conference. The conference will take place Nov. 12-15 in Minnepolis.  This year’s theme is  The Poetics, Politics, and Praxis of Transnational Feminisms.  ,This year the call for papers includes no subthemes, but all proposed panels should touch upon the central theme of transnationalism. We seek papers that look at aging as it takes place in a globalized world, with heightened interconnectivity between people, a global economy and new inequalities that come along with it. ,The official CfP NWSA states (this is an excerpt):"}, {"title": "Depression-era Environmental Literature in the U.S. (MLA 2021, Toronto)", "publisher_and_location": "Matthew Lambert, Wabash College", "submission_deadline": "Tuesday, March 10, 2020", "description": ". ,Dust storms. Flooding.  The fear of nuclear fallout.  While literary critics associate American authors of the 1930s and 40s with leftist political and economic thought, they often ignore concern in the period’s literature and other cultural works with major environmental crises.  In my forthcoming book, The Green Depression: American Ecoliterature of the 1930s and 40s (U of Miss. Press, Oct. 2020), I identify ways that depression-era literature contributed to shifts in conservationist thought during the period that would lay the groundwork for the development of environmental thought in the second half of the 20th century."}, {"title": "CFP - General Call, *Jeunesse: Young People, Texts, Cultures*", "publisher_and_location": "Jeunesse: Young People, Texts, Cultures", "submission_deadline": "Thursday, December 31, 2020", "description": "CALL FOR PAPERS: *Jeunesse: Young People, Texts, Cultures* ,Published by the Centre for Research in Young People’s Texts and Cultures (CRYTC) at the University of Winnipeg, *Jeunesse: Young People, Texts, Cultures* is a scholar-led, interdisciplinary, refereed academic journal whose mandate is to publish research on and to provide a forum for discussion about cultural productions for, by, and about young people. ,Our scope is international; while we have a special interest in Canada, we welcome submissions concerning all areas and cultures. The focus of the journal is on the cultural functions and representations of “the child.” This can include, but is not limited to:"}, {"title": "Detritus, Refuse, and Other Castoffs", "publisher_and_location": "Dalhousie Association of Graduate Students in English", "submission_deadline": "Friday, April 17, 2020", "description": "Surely the wake left behind by mankind’s forward march reveals its movement just as clearly as the spray thrown up elsewhere by the prow. , – Pierre Teilhard de Chardin ,  ,Few would dispute the validity of Teilhard’s analogy itself: a society is defined as much by what it rejects as what it values. What we might question is the very forwardness of the march he imagines. Moreover, would an exhibit of what any given society has “left behind” constitute a tribute or a condemnation?"}, {"title": "Deadline extended: Cognitive literary studies. Theories, methodologies, and challenges", "publisher_and_location": "Luxembourg School of Religion & Society", "submission_deadline": "Sunday, March 1, 2020", "description": "Les études littéraires cognitives. Théories, méthodologies et défis ,Cognitive literary studies. Theories, methodologies, and challenges ,  ,Journée d’études organisée par Luxembourg School of Religion & Society ,Study day organized by the Luxembourg School of Religion & Society ,                                    ,Le 22 mai 2020, de 8h45 à 19h30 ,May 22, 2020, from 8:45 AM to 7:30 PM ,Lieu/venue: Luxembourg School of Religion & Society ,52, rue Jules Wilhelm, L-2728 Luxembourg"}, {"title": "John Clare (MLA 2021 Guaranteed Session)", "publisher_and_location": "John Clare Society of North America", "submission_deadline": "Friday, March 13, 2020", "description": "The John Clare Society of North America invites paper proposals for its guaranteed panel at the Modern Language Association Convention in Toronto, January 7th-10th, 2021. Scholarship exploring any aspect of Clare’s poetry, prose, interests, influence, and/or life is welcome. Send abstract and short bio by 13 March 2020 to Erica McAlpine at erica.mcalpine@ell.ox.ac.uk"}, {"title": "What We Think about When We Think about Love", "publisher_and_location": "University of East Anglia / University of Essex", "submission_deadline": "Friday, May 1, 2020", "description": "What We Think About When We Think About Love: Call for Submissions. ,Histories, Practices & Potentials of love. ,Editors: Stanislava Dikova (University of Essex), Wendy McMahon (University of East Anglia), and Jordan Savage (University of Essex). ,  ,‘Without love, our efforts to liberate ourselves and our world community from oppression and exploitation are doomed’. bell hooks, Outlaw Culture: Resisting Representations, 1994."}, {"title": "CFP: Spanish I (Peninsular Literature before 1700) -- MMLA 2020 (Milwaukee, WI)", "publisher_and_location": "R. John McCaw / U of Wisconsin-Milwaukee", "submission_deadline": "Sunday, April 5, 2020", "description": "The Spanish I (Peninsular Literature before 1700) permanent section of the Midwest Modern Language Association seeks proposals for the upcoming MMLA Conference in Milwaukee, Wisconsin (November 5-8, 2020). Though proposals on any topic related to Medieval and Early Modern Spanish Literature are welcome, we also seek proposals that specifically engage with the 2020 MMLA theme of “Cultures of Collectivity.” The conference theme includes, but is not limited to: cultural movements, subcultures, authorial collaborations, literary circles, and interdisciplinary networks. Please submit a 250-word abstract and a brief bio (or brief CV) to John McCaw at rjmccaw@uwm.edu by April 5, 2020. Papers may be in Spanish or English."}, {"title": "Call for Papers: NWSA 2020 Panel Submission: Excavating Feminist Voices in Literature", "publisher_and_location": "Turni Chakrabarti, GWU", "submission_deadline": "Monday, February 24, 2020", "description": "Call for Papers: NWSA 2020 Panel Submission: Excavating Feminist Voices in Literature ,Deadline: 24th February, 2020. ,NWSA Conference: The Poetics, Politics, and Praxis of Transnational Feminisms, Nov 12-15, 2020."}, {"title": "International Conference on Storytelling, (Auto)Biography and (Auto)Ethnography", "publisher_and_location": "London Centre for Interdisciplinary Research", "submission_deadline": "Sunday, May 10, 2020", "description": "“Narrating Lives” - International Conference on Storytelling, (Auto)Biography and (Auto)Ethnography28-29 August 2020 - Malta ,organised by London Centre for Interdisciplinary Research ,Life-history approach occupies the central place in conducting and producing  (auto)biographical and (auto)ethnographic studies through the understanding of self, other, and culture. We construct and develop conceptions and practices by engaging with memory through narrative, in order to negotiate ambivalences and uncertainties of the world and to represent (often traumatic) experiences."}, {"title": "International Conference: Narratives of Temporality: Continuities, Discontinuities, Ruptures", "publisher_and_location": "London Centre for Interdisciplinary Research", "submission_deadline": "Wednesday, March 25, 2020", "description": "International Conference:Narratives of Temporality: Continuities, Discontinuities, Rupture25 July 2020 - Cambridge, UKorganised byLondon Centre for Interdisciplinary ResearchThis conference will provide a deeper look into the dynamic and complex relation between construction, codes, language, expression, on one side and the crisis of representations, traumas, discontinuities and tensions in discourses, on the other. This will be conducted according to three research areas:"}, {"title": "RACISM, NATIONALISM AND XENOPHOBIA - 3rd International Interdisciplinary Conference", "publisher_and_location": "InMind Support", "submission_deadline": "Sunday, April 26, 2020", "description": "CFP: ,It is widely known that ideologies of racism, nationalism, and xenophobia are dangerous and spread all over the world. We want to examine these terms as much as possible, from many perspectives and variable aspects: in politics, society, psychology, culture, and many more. We also want to devote considerable attention to how the phenomena of racism, nationalism and xenophobia are represented in artistic practices: in literature, film, theatre or visual arts. ,    Our first conference on racism, nationalism and xenophobia took place in March 2016. The second adition was held in June 2017. We hosted over 80 scholars representing universities and research institutions from all over the world."}, {"title": "Rebels, Outlaws, Sinners and Saints: The Antihero/ine Protagonist", "publisher_and_location": "Brooklyn College Graduate English Committee", "submission_deadline": "Sunday, March 15, 2020", "description": "Thirteenth Annual Brooklyn College Graduate English Conference , Date: Saturday, May 2nd ,Keynote Speaker: TBD"}, {"title": "Theorizing the Child for the Twenty-First Century", "publisher_and_location": "Modern Language Association", "submission_deadline": "Sunday, March 1, 2020", "description": "Theorizing the Child for the Twenty-First Century ,Call for Papers for MLA 2021"}, {"title": "The Futurist Inflection of British and American Modernism", "publisher_and_location": "Modernist Studies Association", "submission_deadline": "Friday, March 13, 2020", "description": "City streets were a primary setting for modernity in Futurist art and literature.  The “Founding Manifesto” depicts a group of young men who, galvanized by the intrusive noises of trams and “hungry automobiles,” are finally able to articulate the principles of the new movement, and, to cite an example from the visual arts, Boccioni’s “The Street Enters the House” was a prominent work in the 1912 Paris and London exhibitions of Futurist painting.  In keeping with this year’s MSA “streets” theme, this panel seeks papers that consider the influence of Futurist art and literature on British and American literary modernism."}, {"title": "Collecting, Curating, Editing, Collaborating: How to Make an Author (Henry James and Others!) Today", "publisher_and_location": "The Henry James Society", "submission_deadline": "Sunday, April 5, 2020", "description": "The Henry James Society ,Midwest Modern Language Association ,Annual Convention  Milwaukee, WI Nov 5-8 ,  ,Collecting, Curating, Editing, Collaborating: How to Make an Author (Henry James and Others!) Today"}, {"title": "Lucania between Film and Ecology", "publisher_and_location": "Univeristy of Basilicata, Italy", "submission_deadline": "Sunday, March 15, 2020", "description": "CALL FOR PAPERS ,  ,LiFE 2020 Conference ,Lucania between Film and EcologyBodies, Environments, Representations ,  ,July 14-15, 2020Matera, Italy ,Deadline for submissions: 15th March 2020"}, {"title": "T. S. Eliot MMLA 2020", "publisher_and_location": "Edward Upton / International T. S. Eliot Society", "submission_deadline": "Friday, May 15, 2020", "description": "Eliot Society MMLA CFP 2020"}, {"title": "Gendered Vengeance (MLA 2021)", "publisher_and_location": "CLCS Renaissance and Early Modern", "submission_deadline": "Sunday, March 15, 2020", "description": "Exploring depictions of revenge that reinforce or question assumptions about gender, this guaranteed panel welcomes reconsiderations of the revenge tragedy and of less-familiar genres. 250-word abstracts by 3/15/2020; John Garrison (garrison@grinnell.edu) and Lynn Enterline (lynn.enterline@vanderbilt.edu)."}, {"title": "Telling Trauma & Disability (MLA 2021)", "publisher_and_location": "CLCS Renaissance and Early Modern", "submission_deadline": "Sunday, March 15, 2020", "description": "This guaranteed roundtable will bring together brief responses to the question, “What linkages did early modern narratives see between trauma and disability?” 250-word abstracts by 3/15/2020; John Garrison (garrison@grinnell.edu) and Lynn Enterline (lynn.enterline@vanderbilt.edu)."}, {"title": "Rebels and Revels:  An Exhibit and Symposium on the Theatre of the Middle East", "publisher_and_location": "University of Maryland, College Park", "submission_deadline": "Tuesday, March 3, 2020", "description": "Call for Papers: ,Rebels and Revels: An Exhibit and Symposium on the Theatre of the Middle East ,  ,A one-day Symposium: ,Sponsored by The International Program for Creative Collaboration and Research of the School of Theatre, Dance, and Performance Studies at the University of Maryland ,In collaboration with the Centre for Drama, Theatre and Performance Studies at the University of Toronto ,  ,Friday, April 3, 2020 ,University of Maryland, College Park ,The Clarice Smith Performing Arts Center ,Cafritz Theatre"}, {"title": "Comics and Modernism Collection of Essays", "publisher_and_location": "Essays on Comics and/as Modernism", "submission_deadline": "Friday, April 10, 2020", "description": "In The Autobiography of Alice B. Toklas, Gertrude Stein recounts a remarkable interaction with her close friend Pablo Picasso. As they are headed out the door, their conversation slipping between paintings, French lessons, and tea with Picasso’s wife Fernande, Stein pauses: ,\"Oh I forgot to give you these, said Gertrude Stein handing Picasso a package of newspapers, they will console you. He opened them up, they were the Sunday supplement of american papers, they were the Katzenjammer kids. Oh oui, Oh oui, he said, his face full of satisfaction, merci thanks Gertrude, and we left.\""}, {"title": "MLA Roundtable Special Session: What’s Next? Naming Post-Immigrant Diaspora Literature", "publisher_and_location": "Diana Filar/Brandeis University", "submission_deadline": "Sunday, March 15, 2020", "description": "On December 30, 2019, Cesar Miguel (@cesarmvm) tweeted “Diaspora is almost becoming as useless a term as immigrant.” The thread continued by distinguishing between the experiences of refugees and those who gained easier access to documentation and residence because it “benefited American/European geopolitical interests; those who make six figures in highly trained fields and those who earn way below the poverty line.” Min Hyoung Song echoed Cesar Miguel’s thoughts but with relation to terms further associated with migration, noting that we need to reconceptualize the language of migration, and Viet Thanh Nguyen chimed in to note that – as per Paul Gilroy – most terms inevitably require clarification and adjectival distinction."}, {"title": "Persistent Commercialization: Literary Criticism, Publishing, and the Academy", "publisher_and_location": "MLA Forum on Narrative and the South Asian and  Diasporic Forum", "submission_deadline": "Sunday, March 15, 2020", "description": "The ISSN and the South Asian and South Asian Diasporic forum at the MLA invite 300 word abstracts for a collaborative panel examining the cultural politics of South Asian narrative studies and literary criticism given their imbrication in financialized academic markets by March 15.  ,Literary endeavors have long been deeply imbricated with commercialization.  Drama for the stage, poetry for patrons, and fiction for mass readership ensured that the production of literature was always connected to market imperatives. Today, authors and literary works are embedded in a global profit-oriented publishing matrix."}, {"title": "BAVS 2020", "publisher_and_location": "British Association for Victorian Studies", "submission_deadline": "Tuesday, March 17, 2020", "description": "BAVS 2020 BAVS2020.com Call for Papers ,Join us to celebrate the 20th anniversary of the British Association for Victorian Studies! 20-22 July, 2020, in Birmingham."}, {"title": "\"Hollywood and the Holocaust\" Conference Panel", "publisher_and_location": "Elyce Rae Helford / Middle Tennessee State University", "submission_deadline": "Thursday, March 12, 2020", "description": "I seek original papers for a panel on \"Hollywood and the Holocaust\" for Middle Tennessee State University's Holocaust and Genocide Studies Conference in Murfreesboro (near Nashville), TN, Oct 21-23. ,Specific topics may emphasize a single director or film or address a theme or representational style. My goal is to include some diversity of approach and paper subject within the broad field of Hollywood cinema's engagement with the Holocaust, 1930s-present. ,There is potential for future publication via journal special issue or published conference volume."}, {"title": "MLA 2020 CFP: Lawrence in the Era of #MeToo", "publisher_and_location": "D.H. Lawrence Society of North America", "submission_deadline": "Sunday, March 15, 2020", "description": "Social controversy, gender, sexual violence, predatory behavior - how does Lawrence respond? How do we respond to him? Abstracts of 250 wds."}, {"title": "Political Radicalism and British Romanticism MLA Toronto 2021", "publisher_and_location": "Robert L Berger", "submission_deadline": "Sunday, March 1, 2020", "description": "I am in the process of organizing a panel for MLA 2021 in Toronto which runs January 7th through the 10th. This panel seeks contemporary readings of British Romantic texts, especially those exploring the formations of Empire, Orient and Enemies, Power/discourse, and Performative Acts of Resistance. If you are interested and would be able to attend the conference please send abstracts of 250 words and a short bio to rberger11ec@elmira.edu"}, {"title": "MLA 2021 You Didn’t Write, You Rewrote: Revision and Literary Production", "publisher_and_location": "MLA 2021", "submission_deadline": "Monday, March 16, 2020", "description": "Writers have long used revision as a creative tool, well before writing classrooms institutionalized it as such. Think of Pound ruthlessly cutting Eliot’s Waste Land, Moore slashing most of “Poetry,” and Robert Lowell turning stories and letters into cinquains, sonnets, and blank verse--and then revising some of those poems again, into other forms. To many, such acts of revision are the markers of a serious writer, one who pursues perfection in multiple drafts."}, {"title": "Book Groups: Scholarship, Study, and Reading in and about medieval England", "publisher_and_location": "Midwest Modern Language Association (MMLA)", "submission_deadline": "Sunday, April 5, 2020", "description": "“Book Groups: Scholarship, Study, and Reading in and about medieval England” ,MMLA 2020 Permanent Session Old and Middle English Language and Literature ,The general conference theme “cultures of collectivity” presents some very current and relevant possibilities for the study of late antique and medieval English languages and literatures.  Any proposal that considers this theme in general will be welcome, but two foci will be of particular interest."}, {"title": "\"Historical Women Interpreting Scripture through Music and the Arts.\"", "publisher_and_location": "RECOVERING FEMALE INTERPRETERS OF THE BIBLE: Society of Biblical Literature", "submission_deadline": "Tuesday, March 10, 2020", "description": "We seek papers on the following topics 1)\"Historical Women Interpreting Scripture through Music and the Arts.\" Through the ages, countless women interpreted scripture through their creation of hymns, poetry, literature, painting, textiles, and other artistic works. We invite papers on historical women (active prior to World War I) who interpreted the Bible through artistic activity. Papers should include significant attention to the historical figures’ work as biblical interpreters, with attention to specific works created by these artists and writers from Jewish, Christian, and other religious traditions."}, {"title": "\"Race, Slavery, and Social Justice in Biblical Interpretation by Historical Women", "publisher_and_location": "RECOVERING FEMALE INTERPRETERS OF THE BIBLE: Society of Biblical Literature", "submission_deadline": "Tuesday, March 10, 2020", "description": "Call For Papers: We seek paper proposals on the following topics: 1) \"Race, Slavery, and Social Justice in Biblical Interpretation by Historical Women: Papers Commemorating Maria Stewart.\" Inspired by the Boston setting of the 2020 Annual Meeting, this program unit remembers the work of Boston orator and essayist Maria W. Miller Stewart (1803-1879), the first recorded African American female political writer. We invite papers on Maria Stewart, as well as other historical women (active prior to World War I) who interpreted the Bible to promote social justice by confronting racism, slavery, and sexism. Papers should include significant attention to the historical figures’ work as biblical interpreters and their approach to scripture."}, {"title": "Hawthorne Society Triennial Conference (June 2021)", "publisher_and_location": "Nathaniel Hawthorne Society", "submission_deadline": "Monday, October 5, 2020", "description": "CFP: Nathaniel Hawthorne Society Conference ,“Hawthorne and Friends, Enemies, Frenemies” ,Crowne Plaza Hotel Downtown Union Station—Indianapolis, USA ,The Nathaniel Hawthorne Society invites paper and session proposals for its triennial summer conference to be held in Indianapolis on June 18-20, 2021."}, {"title": "Essays on Latinx/Latin American Kinship and Queer Theory for “Queer Kinship: Erotic Affinities and the Politics of Belonging,” edited collection", "publisher_and_location": "Tyler Bradway", "submission_deadline": "Sunday, March 1, 2020", "description": "CFP: Essays on Latinx/Latin American Kinship and Queer Theory for “Queer Kinship: Erotic Affinities and the Politics of Belonging,” edited collection ,Elizabeth Freeman, UC Davis ,Tyler Bradway, SUNY Cortland  ,Deadline: March 1st, 2020"}, {"title": "Special journal issue: Our Shared Planet (The Environment Issue)", "publisher_and_location": "Special issue of American Studies (AMSJ)", "submission_deadline": "Monday, August 31, 2020", "description": "For people of color, the future has never been a given. Whether through the policies and practices of state-sanctioned genocide, enslavement, internment, or forced relocation and migration, racialized communities have survived their worlds ending, over and over. To cite the opening lines of Sun Ra’s 1974 Afrofuturist film Space Is the Place, “It’s after the end of the world, don’t you know that yet?” This special issue critically interrogates the supposed universal notions of a shared planet, ecological demise, and what it means to be human in an era of climate change. The collection aims to center the perspectives of people of color historically and in our contemporary moment on how they envision(ed) “surviving” apocalypse."}, {"title": "MLA2021: Provocation and “Difficulty” in Working-Class Narratives", "publisher_and_location": "MLA2021: Toronto, Jan 7 - 10, 2021", "submission_deadline": "Monday, March 16, 2020", "description": "Abstracts Due by March 16 through the MLA Portal: https://mla.confex.com/mla/2021/webprogrampreliminary/Paper12404.html"}, {"title": "The Persistent Past in Mediterranean Thought", "publisher_and_location": "Dr. Michael Allan, Associate Professor of Comparative Literature, University of Oregon and Dr. Edwige Tamalet Talbayev Associate Professor of French, Tulane University", "submission_deadline": "Sunday, March 1, 2020", "description": "Interplay of past and present, nostalgia and melancholia, classical and contemporary, in literature, philosophy or film of the Mediterranean region. 250-word abstracts due March 1stto"}, {"title": "Arabic and the Non-Human", "publisher_and_location": "Dr. Yasmine Khayyat, Rutgers University", "submission_deadline": "Sunday, March 1, 2020", "description": "Arabic and the Non-Human: This panel aims to uncover and rethink the status of the non-human in the Arabic literary tradition; How has the line between human and non-human played out in Arabic literature, film, media? 250-word abstracts due March 1st to yasmine.khayyat@rutgers.edu"}, {"title": "Practices of Reading in the Pre-Modern Arabic Tradition", "publisher_and_location": "Dr. Lara Harb, Assistant Professor of Near Eastern Studies, Princeton University", "submission_deadline": "Sunday, March 15, 2020", "description": "Practices of Reading in the Pre-Modern Arabic Tradition: How were premodern Arabic texts read, conceived of, commented on, organized, and classified by their authors, contemporaries, and the inheritors of the tradition? How might this inform our own readings of them today? 250-word abstractsdue March 15th"}, {"title": "Palestine & Literary History", "publisher_and_location": "Dr. Refqa Abu-Remaileh, Assistant Professor Principal Investigator ERC-Projekt PalREAD", "submission_deadline": "Sunday, March 1, 2020", "description": "Palestine & Literary History: Reimagining Palestinian literary histories, chronologies, timelines; invoking comparative cases; rethinking processes of periodization and canon-formations in the context of exile, refugees, fragmentation, non-linearity, and oppression.250-word abstracts due March 1st to r.remaileh@fu-berlin.de"}, {"title": "Political Demonologies: Race, Gender, and Coloniality in a Postsecular Age", "publisher_and_location": "University College Dublin", "submission_deadline": "Sunday, March 1, 2020", "description": "Political Demonologies ,Race, Gender, and Coloniality in a Postsecular Age ,  ,May 15–16, 2020, University College Dublin, Ireland ,  ,Confirmed Keynote Speakers  ,C. Heike Schotten (University of Massachusetts, Boston)  ,Selamawit D. Terrefe (Tulane University)"}, {"title": "CFP: What’s New, What’s Next? Innovative Methods, New Sources, and Paradigm Shifts in Jewish Studies", "publisher_and_location": "POLIN Museum of the History of Polish Jews", "submission_deadline": "Thursday, April 30, 2020", "description": "What’s New, What’s Next? Innovative Methods, New Sources, and Paradigm Shifts in Jewish Studies ,12-15 October 2020, POLIN Museum, Warsaw ,We invite scholars working in Jewish studies to propose panels for the international interdisciplinary conference “What’s New, What’s Next? Innovative Methods, New Sources, and Paradigm Shifts in Jewish Studies.” The aim of the conference is to explore new directions in the study of East and Central European Jews."}, {"title": "The History of the Book and the Future of the World", "publisher_and_location": "Bibliographical Society of Australia and New Zealand", "submission_deadline": "Tuesday, June 30, 2020", "description": "The Bibliographical Society of Australia and New Zealand (BSANZ) is pleased to announce the 2020 conference with the theme The History of the Book and the Future of the World, to be hosted at the State Library of South Australia Monday 30 November and Tuesday 1 December. There will be a Rare Book Librarians Day event on Wednesday 2 December. ,Conference website https://sites.google.com/view/bsanz-conference-2020/home"}, {"title": "Revolutionary Legacies: The Ninth Catharine Maria Sedgwick Society Symposium", "publisher_and_location": "Catharine Maria Sedgwick Society", "submission_deadline": "Monday, February 24, 2020", "description": "The Catharine Maria Sedgwick Society invites submissions for its ninth symposium, titled Revolutionary Legacies. The Symposium will take place June 24-27 on the beautiful campus of Union College in Schenectady, New York, and will honor both the Sedgwick family’s ties to the Albany and Hudson River regions and the area’s role in America’s many revolutions."}, {"title": "Poetry and the Victorian Visual Imagination: New Conversations", "publisher_and_location": "Guest editors: Jill Ehnenn and Heather Bozant Witcher, Victorian Poetry, Winter 2022", "submission_deadline": "Monday, August 31, 2020", "description": "CFP: Poetry and the Victorian Visual Imagination: New Conversations  ,A special issue of Victorian Poetry, Winter 2022 ,Guest Editors: Jill Ehnenn and Heather Bozant Witcher ,Deadline for Submissions: August 31, 2020"}, {"title": "Gender, Sexuality, and Power Student Research Conference", "publisher_and_location": "Center for the Study of Genders and Sexualities, CSULA", "submission_deadline": "Monday, March 9, 2020", "description": "The 16th Annual GENDER, SEXUALITY, AND POWER Student Research and Creative Arts Conference at California State University, Los Angeles ,CONFERENCE DATE: APRIL 9-10, 2020 • 9AM-4PM ,KEYNOTE: JACK HALBERSTAM, APRIL 9, 2020 • 6PM ,SUBMIT PROPOSALS BY MARCH 9, 2020 • 5PM ,  ,PLEASE SEND RESEARCH AND/OR CREATIVE ABSTRACTS OF 250 WORDS THAT PERTAIN TO THE CONFERENCE'S ANNUAL THEME OF GENDER, SEXUALITY, AND POWER. INCLUDE THE FOLLOWING INFO: NAME, EMAIL, MAJOR OR FIELD OF STUDY, PROJECT TITLE, THREE KEYWORDS, AND INSTITUTIONAL AFFILIATION.  ,SEND SUBMISSIONS OR QUESTIONS TO CSGS@CALSTATELA.EDU. NOTIFICATION OF ACCEPTANCE WILL BE SENT BY MARCH 15, 2020."}, {"title": "‘Mutual Intelligibility: Language, Culture, Cognition’", "publisher_and_location": "University of Surrey (Guildford, UK)", "submission_deadline": "Friday, March 13, 2020", "description": "‘Mutual Intelligibility: Language, Culture, Cognition’ ,University of Surrey, Guildford, UK ,18-19 June 2020 ,  ,CALL FOR PAPERS ,  ,Deadline for submissions: Friday 13 March 2020 to milcc2020@gmail.com"}, {"title": "5th Spiral Film and Philosophy Conference (Deadline extended)", "publisher_and_location": "Spiral Collective", "submission_deadline": "Sunday, March 1, 2020", "description": "Deadline extended: March 1st, 2020 ,5th Spiral Film and Philosophy Conference ,“Interruptions” ,Toronto, Canada, May 8-9, 2020"}, {"title": "MLA 2021  Images of Epic: Representations of Medieval heroes in art, film, and comics", "publisher_and_location": "Société Rencesvals, American/Canadian Branch", "submission_deadline": "Friday, March 20, 2020", "description": "MLA 2021 ,Images of Epic: Representations of Medieval heroes in art, film, and comics. ,This panel will consider proposals dealing with visual representations of Medieval epic texts from illuminations to graphic novels. ,  ,Send 250 words abstract. ,Deadline for submissions: Tuesday, 20th March 2020"}, {"title": "DEADLINE EXTENDED: TitanCon 2020", "publisher_and_location": "TitanCom 2020", "submission_deadline": "Sunday, March 15, 2020", "description": "On the Shoulders of Giants ,TitanCon 2020 ,Belfast, Ireland ,August 28-30, 2020 ,Call for Papers: DEADLINE EXTENDED!!"}, {"title": "Writing Across the Curriculum (MMLA)", "publisher_and_location": "Alejandra Ortega / Purdue University", "submission_deadline": "Sunday, April 5, 2020", "description": "The Midwest Modern Language Association’s 2020 conference theme is “Cultures of Collectivity.” The conference will take place November 5-8 in Milwaukee, Wisconsin. ,The Writing Across the Curriculum permanent session will explore this theme by considering how writing pedagogy can encourage students to make connections between their sense of self and the community at large. Academia is rarely limited to the space of the classroom. Often lines between the individual student, the university space, and the local community blur to facilitate a deeper engagement with learning. ,Topics might include, but are not limited to:"}, {"title": "Persistence in the Digital World: Rights, Movements, Knowledge and Humanities", "publisher_and_location": "MLA 2021, Toronto", "submission_deadline": "Sunday, March 15, 2020", "description": "Inviting abstracts for the MLA panel: Persistence in the Digital World: Rights, Movements, Knowledge and Humanities ,How does the networked public seize digital means and build new frontiers of knowledge and rights? What new forms of social movements and humanities in digital spaces sustain hopes for persistence? Send 400-word abstracts to rianka.roy@gmail.com. ,Link: https://mla.confex.com/mla/2021/webprogrampreliminary/Paper12576.html ,Rianka Roy, PhD ,University of Connecticut"}, {"title": "Native American Literature Permanent Section (MMLA 2020)", "publisher_and_location": "Midwest Modern Language Association Conference", "submission_deadline": "Sunday, April 5, 2020", "description": "Community and Collaboration in Native American Literature - MMLA Conference, November 5-8, Milwaukee, WI ,In addressing the conference theme of “Cultures of Collectivity,” the Permanent Section on Native American Literature seeks proposals exploring collaboration and community building in a literary context. Possible topics may include analyses of representations of diverse communities or collective movements in literature by Native American authors. Discussions of author collaborations are also encouraged. Please send proposals of 200-300 words by April 5 to the panel chair, Kate Beutel, at kbeutel@lourdes.edu."}, {"title": "MLA 2021 - Comparative Environmentalisms (guaranteed session)", "publisher_and_location": "Ben Mangrum / University of Michigan", "submission_deadline": "Sunday, March 1, 2020", "description": "MLA 2021 (Toronto) ,This panel explores environmentalisms across linguistic, indigenous, and national frameworks. Challenges to the idea of “environmentalism” are welcome. ,This panel is sponsored by the CLCS 20th-21st century forum and will be a guaranteed session. ,Abstracts of 250-words to Ben Mangrum at bmangrum@umich.edu by Sunday, March 1, 2020."}, {"title": "\"Collection Cultures\" - MMLA Permanent Section on American Literature 1870-Present", "publisher_and_location": "Midwestern Modern Language Association", "submission_deadline": "Sunday, April 5, 2020", "description": "“Collection Cultures”: Midwest Modern Language Association Convention. Milwaukee, Wisconsin, November 5-8. The MMLA’s permanent section on American Literature After 1870 invites papers which, building on the conference theme, examine the topic of “cultures of collectivity” in American novels, poetry, and/or other kinds of texts, artwork, or cultural endeavors. Particularly invited are papers which explore cultures of collectors and collections."}, {"title": "Persistence in Afrofuturist Cultural Production", "publisher_and_location": "MLA Forum: African since 1990", "submission_deadline": "Sunday, March 15, 2020", "description": "In outlining her presidential theme for the 2021 MLA Conference, Judith Butler writes of the precarity we face in the humanities and the vulnerabilities of human and nonhuman lives in the face of climate change and the “dominance of market values.” However, Butler’s outlook is not defeatist; her focus on persistence encourages reflections on alternative future possibilities centered on collective resistance and survival."}, {"title": "Digitorium Digital Humanities Conference", "publisher_and_location": "The University of Alabama", "submission_deadline": "Sunday, March 15, 2020", "description": "Call for Papers ,Event:                  Digitorium Digital Humanities Conference ,When:                  Thursday, October 1 – Saturday, October 3, 2020 ,Where:                University of Alabama, Tuscaloosa, AL"}, {"title": "Call for Papers: Frontiers of Narrative Studies", "publisher_and_location": "Frontiers of Narrative Studies", "submission_deadline": "Monday, February 15, 2021", "description": "Call for Papers: Frontiers of Narrative Studies"}, {"title": "Call for Special Issue Proposals", "publisher_and_location": "Frontiers of Narrative Studies (De Gruyter)", "submission_deadline": "Monday, February 15, 2021", "description": "The journal Frontiers of Narrative Studies (De Gruyter) is seeking proposals for special issues on subjects including but not limited to ,*Transnational narrative ,*Postcolonial narrative ,*Fictional and factual narrative ,*Cosmopolitanism and narrative theory ,*Classical narratology revisited ,*Transmedial narrative ,*Fictionality"}, {"title": "The 2020 ELLAK International Conference “The Age of AI and Machine Translation: What Can Language, Literature, and Education Do?”", "publisher_and_location": "English Language and Literature Association of Korea (ELLAK)", "submission_deadline": "Friday, July 31, 2020", "description": "2020 Call for Papers: The 2020 ELLAK International Conference ,“The Age of AI and Machine Translation: What Can Language, Literature, and Education Do?” ,  ,- Organized by the English Language and Literature Association of Korea (ELLAK) ,- Venue: Kookmin University, Seoul, South Korea ,- Date: December 17-19, 2020 ,- Deadline for submissions: July 31, 2020 ,- Notification of Acceptance: August 15, 2020 ,- Deadline of papers for the proceedings: October 31, 2020"}, {"title": "MLA 2021: George Eliot and Persistence", "publisher_and_location": "Charlotte Fiehn, University of Texas - Austin", "submission_deadline": "Sunday, March 15, 2020", "description": "This cfp is for a proposed special panel for the 2021 MLA Conference to be held in Tornoto, January 7-10, 2021.This panel seeks papers on the life and works of George Eliot related to the theme of \"persistence.\" Please send a 300 word abstracts and a 1-2pp CV to cfiehn@utexas.edu."}, {"title": "The Politics of Protest", "publisher_and_location": "South Central Modern Language Association", "submission_deadline": "Wednesday, April 15, 2020", "description": "Political protest has long been central to literary and cinematic histories from ideological and artistic manifestos to political pamphlets to satirical novels and realist cinema. They remain powerful vehicles for stimulating public debate, issuing calls to action, speaking truth to power, and heightening awareness of social ills.  Despite censorship, marketplace economics, and national politics, literature, film, and numerous other modes of cultural / aesthetic production continue to play an important role not only as agents of social critique but also as agents of social change."}, {"title": "Gender Politics/Beyond the Fragments:  Exploring Intersectional Approaches in Gender, Culture, Race and Religion", "publisher_and_location": "Amina Hussain", "submission_deadline": "Tuesday, March 10, 2020", "description": "By locating the third world women in their lived historical and material context, Chandra Mohanty Talpade argues one can analyze women as socioeconomic political groups in their local context, in contrast to the western feminist “homogenized average third world women”. Mohanty then goes on to deconstruct through decolonial practices a reductive and homogenising “Third World difference” which “appropriate and colonize the constitutive complexities that characterize the lives of women in these (third world) countries”. The growing third world and transnational feminism has led to new intersectional outcomes questioning the old binaries and barriers."}, {"title": "CFP: RMMLA Chinese Lit and Film Since 1900 session", "publisher_and_location": "Rocky Mountain Modern Language Association", "submission_deadline": "Tuesday, March 31, 2020", "description": "CFP: RMMLA Chinese Lit and Film Since 1900 session ,Rocky Mountain Modern Language Association 74th Annual Convention ,Conference Date: October 7-10, 2020 ,Location: Millennium Harvest House Hotel, Boulder, Colorado, USA ,  ,We invite submissions of papers proposals that address a broadly defined theme of “change and resistance” in modern and contemporary Chinese literature, arts, film, and culture for the Rocky Mountain Modern Language Association (RMMLA) Annual Convention."}, {"title": "The Afterlives of Anticolonial Aesthetics", "publisher_and_location": "University College Cork/Interventions: International Journal of Postcolonial Studies", "submission_deadline": "Monday, November 30, 2020", "description": "The Afterlives of Anticolonial Aesthetics ,  ,Special Issue Proposal for Interventions: International Journal of Postcolonial Studies ,(2021/2) ,Guest Editors: Patrick Crowley and Carlos Garrido Castellano ,  ,This special issue will examine the ways in which anticolonial thought and praxishave continued to inform aesthetics and creative processes. It seeks to think of decolonization as an ongoing collective project allowing us to challenge and critique more recent configurations of coloniality."}, {"title": "EXTENDED DEADLINE Transcodification: Literatures - Arts - Media, ICLA/CLAM Conference, L'Aquila (Italy), July 2020", "publisher_and_location": "First Conference of the ICLA Research Committee on Literatures/Arts/Media (CLAM)", "submission_deadline": "Sunday, February 23, 2020", "description": "First Conference of the ICLA Research Committee on Literatures/Arts/Media (CLAM)\u2028Transcodification: Literatures - Arts - Media ,Department of Humanities – Excellence Program 2018-2022 \u2028July 1-3, 2020 – University of L’Aquila (Italy)"}, {"title": "Page 23 LitCon at Denver Pop Culture Con", "publisher_and_location": "Tracy Bealer/Page 23 at Denver Pop Culture Con", "submission_deadline": "Sunday, March 15, 2020", "description": "Call for Papers, Panels, and PresentationsPage 23 LitConJuly 3-5, 2020 ,  ,500-word abstracts for papers, panels, creative presentations, roundtables, or any other appropriate event expanding and/or expounding on comics and pop culture are being accepted for a scholarly conference at ,  ,DENVER POP CULTURE CON at the Colorado Convention Center           DENVER, CO                                                                      July 3-5, 2020"}, {"title": "Call for Papers: Frontiers of Narrative Studies", "publisher_and_location": "Shanghai Jiao Tong University", "submission_deadline": "Friday, December 31, 2021", "description": "A peer-reviewed journal of international scope, Frontiers of Narrative Studies under the auspice of De Gruyter features articles reporting results of research in all branches of narrative studies, in-depth reviews of selected current literature in the field, and occasional guest editorials and reports. Its broad range of scholarship includes narratives across a variety of media, including literary writing, film and television, journalism, and graphic narratives. It welcomes theoretically sophisticated essays that examine narratives of all kinds from a host of critical, interdisciplinary, or cross-cultural perspectives. Particular emphasis is placed upon state-of-the-art research in the field of interdisciplinary narrative inquiries."}, {"title": "Call for Papers: Frontiers of Narrative Studies [special issue]", "publisher_and_location": "Shanghai Jiao Tong University", "submission_deadline": "Friday, December 31, 2021", "description": "The journal Frontiers of Narrative Studies (De Gruyter) is seeking proposals for special issues on subjects including but not limited to ,*Transnational narrative ,*Postcolonial narrative ,*Fictional and factual narrative ,*Cosmopolitanism and narrative theory ,*Classical narratology revisited ,*Transmedial narrative ,*Fictionality"}, {"title": "Some Things Are Better Left Unsaid: Representing Taboo in Contemporary Pop Culture", "publisher_and_location": "Dr. Christina Fawcett, Dr. Marc Ouellette & Dr. Delores Phillips", "submission_deadline": "Wednesday, April 1, 2020", "description": "We are pleased to invite contributions to an edited volume that analyzes sexual taboo in contemporary popular culture, with an eye toward theorizing taboo sexual practices using frameworks that reveal the uncomfortable or silenced spaces that surround non-normative sexual desire. We seek chapters that focus on how different cultural products normalize the taboo, bringing deviant behavior into mainstream spaces that challenge the traditional relegation of non-normative behavior to fringe spaces. We invite readings of literary, film, interactive and fan-created works that reveal positive representations of taboo, opening our readers to a sympathetic experience of deviancy and socially proscribed behavior."}, {"title": "Southern Literature and Scandal (SAMLA)", "publisher_and_location": "Society for the Study of Southern Literature", "submission_deadline": "Friday, April 24, 2020", "description": "The Society for the Study of Southern Literature invites papers on topics relevant to the SAMLA 92 conference theme: “Scandal! Literature & Provocation: Breaking Rules, Making Texts.” The works explored may be from any ‘literary’ medium including poetry, prose, film, or video games, and explore concepts of scandal, rebellion, resistance, creation, liminality, or precarity relative to the South[s]. We especially welcome papers that focus on the intersections of the South and lines of identity including race, ethnicity, gender, and class. If you have any questions, please contact either Shari Arnold (sarnold10@gsu.edu) or Cameron Lee Winter (clw23543@uga.edu)."}, {"title": "The South and Science Fiction (SAMLA)", "publisher_and_location": "Society for the Study of Southern Literature", "submission_deadline": "Friday, April 24, 2020", "description": "The Society for the Study of Southern Literature invites papers on the South and science fiction for a panel at the South Atlantic Modern Language Association’s Annual Conference from November 13-15, 2020 in Jacksonville, FL. Papers may discuss any of the subgenres of science fiction, including alternate history, post-apocalyptic, scifi gothic, traditional, ‘hard’ or ‘soft’ science fiction, scifi horror, etc., and may focus on any form of media as long as the South is a central locale or focus of the work."}, {"title": "Creative Writing Panel Proposals - East Texas Writing Festival", "publisher_and_location": "LeTourneau University", "submission_deadline": "Friday, May 15, 2020", "description": "Panel submissions for the East Texas Writing Festival may be creative writing or craft-related essays. Work should be submitted as an attachment on the registration form. Visit www.letu.edu/writingfest for more information on the festival. Guidelines are provided below for each genre: ,Fiction/Nonfiction – Submissions are not to exceed 2500 words in total and should be submitted in a single document. ,Poetry – Submit up to five poems in a single document. ,All submissions should include your name and email address located on the first page."}, {"title": "MLA 2021 - Eugenics and the Body", "publisher_and_location": "Kim Adams and Mercedes Trigos / New York University", "submission_deadline": "Wednesday, March 18, 2020", "description": "Eugenics and the Body How has eugenics—a discourse of the perfectibility of man that centers reproduction—influenced the literary construction of bodies in the broadest sense (literal, figurative, (non-)human, national, etc.)? Submit 300-word abstract for paper and 50-word bio. This is a CFP for a non-guaranteed session at the MLA. ,Deadline for submissions: Wednesday, 18 March 2020 ,Send submissions to: Kim Adams, New York U (kaa401@nyu.edu ) Mercedes Trigos, New York U (mtrigos33@gmail.com )"}, {"title": "Ralph Waldo Emerson Society Awards - call for applications", "publisher_and_location": "Ralph Waldo Emerson Society", "submission_deadline": "Wednesday, April 1, 2020", "description": "Awards Announcements ,2020  ,The Ralph Waldo Emerson Society announces three awards for projects that foster appreciation for Emerson. ,  ,*Research Grant* ,Provides up to $500 to support scholarly work on Emerson. Preference given to junior scholars and graduate students. Submit a confidential letter of recommendation, and a 1-2-page project proposal, including a description of expenses, by April 1, 2020. ,  ,*Pedagogy or Community Project Award*"}, {"title": "Interrogating Folklore and the Literary Fairy-tale in the Anthropocene: Call for Chapter Proposals", "publisher_and_location": "Dr. Anita Harris Satkunananthan, Faculty of Humanities and Social Sciences, National University of Malaysia", "submission_deadline": "Sunday, May 31, 2020", "description": "Editors: ,Anita Harris Satkunananthan, PhD. ,Sanghamitra Dalal, PhD. ,Selena Middleton, PhD. ,  ,Introduction"}, {"title": "'An Overflow of Meaning: Reading and Re-Reading Hilary Mantel", "publisher_and_location": "The Huntington Library, Art Museum and Botanical Gardens", "submission_deadline": "Friday, July 31, 2020", "description": "‘An Overflow of Meaning: Reading and Re-Reading Hilary Mantel’ ,Huntington Library, Art Museum and Botanical Gardens, San Marino, California, 15-16th October 2021 ,Call for Papers"}, {"title": "Urban Experience in Art, Literature, Architecture, Film, Museums, Creative Writing, and New Media", "publisher_and_location": "University of St. Thomas, Saint Paul, MN", "submission_deadline": "Sunday, March 1, 2020", "description": "Call for Papers ,Urban Experience ,Art, Literature, Architecture, Film, Museums, Creative Writing, and New Media ,University of St. Thomas, April 24, 2020"}, {"title": "MLA 2021 The Ethical Turn in Children's Literature and Childhood Studies (deadline 3/1/2020)", "publisher_and_location": "Gabrielle Owen / Children's Literature Association", "submission_deadline": "Sunday, March 1, 2020", "description": "This non-guaranteed session sponsored by the Children’s Literature Association names and reflects on a recent shift in the fields of Children’s Literature and Childhood Studies toward questions of ethics regarding children and the effects of categories of age, both present and historical. At its heart, this is a shift away from the exclusive focus on cultural ideas about the child in the work of scholars like Jacqueline Rose and Karín Lesnik-Obserstein toward scholarly work that also considers the lives, texts, and matter of actual children."}, {"title": "Craft Critique Culture - Justice Framed", "publisher_and_location": "Craft Critique Culture Conference - University of Iowa", "submission_deadline": "Friday, February 28, 2020", "description": "Craft Critique Culture Conference 2020: Justice Framed ,Call for Papers ,The University of Iowa English Department invites proposals for its 2020 Annual Conference, Craft Critique Culture, to be held on the campus of The University of Iowa in Iowa City, Iowa. ,Event date: Friday, April 17 – Saturday, April 18, 2020 ,Abstract deadline: Friday, February 28th, 2020 ,Categories: interdisciplinary, humanities, arts, literature, language, politics, law, social justice, criminal justice, race, gender, LGBTQ+, resistance"}, {"title": "Indiana College English Association 2020: Beyond Boundaries", "publisher_and_location": "Indiana College English Association", "submission_deadline": "Tuesday, February 25, 2020", "description": "ICEA 2020: Beyond BoundariesDate: April 3, 2020Location: Indiana Convention Center, 100 S Capitol Ave, Indianapolis, IN 46225Deadline for abstracts: Feb 25, 2020 ,The Indiana College English Association (ICEA) has been invited to represent English studies in Indiana University’s celebration of its 200-year history of intellectual capital, which also provides a venue for Indiana’s academic societies to celebrate their own intellectual capital. Next year is significant for ICEA as well, as it marks 85 years since we began hosting academic conferences."}, {"title": "Conference: British Travels to Germany (September 3-5, 2020)", "publisher_and_location": "Prinz Albert Gesellschaft (Coburg, Germany)", "submission_deadline": "Sunday, March 15, 2020", "description": "For centuries, the close ties between Britain and Germany have found expression not least on the level of personal travel. Travellers came from Britain to Germany for a host of occasions and with the most diverse aims, expectations, and preconceptions. This conference explores the reports produced about their experiences in German lands by travellers from England, Scotland, and Ireland since the Middle Ages."}, {"title": "Extended Deadline! 118th Annual PAMLA Conference in Las Vegas, NV: \"City of God, City of Destruction\" Special Session CFP", "publisher_and_location": "David John Boyd, Pacific Ancient and Modern Language Association", "submission_deadline": "Monday, February 24, 2020", "description": "CALL FOR SPECIAL SESSIONS - EXTENDED DEADLINE (02/24/20) ,Pacific Ancient and Modern Language Association (PAMLA) Conference ,Thursday, November 12, 2020 to Sunday, November 15, 2020 at Sahara Las Vegas Hotel, hosted by University of Nevada, Las Vegas ,Conference theme: “City of God, City of Destruction”"}, {"title": "Extended Deadline! 118th Annual PAMLA Conference in Las Vegas, NV: \"City of God, City of Destruction\" Special Conference Theme", "publisher_and_location": "David John Boyd, Pacific Ancient and Modern Language Association", "submission_deadline": "Monday, February 24, 2020", "description": "Extended Deadline (02/24/20)PAMLA 2020 LAS VEGAS: \"CITY OF GOD, CITY OF DESTRUCTION\" (Thursday, November 12 - Sunday, November 15, 2020 at Sahara Las Vegas Hotel, hosted by University of Nevada, Las Vegas) ,Please propose your special sessions to pamla.ballastacademic.com by February 24, 2020. Please take a look at the bottom of this page* for a list of General/Standing Sessions, and be sure your special session proposal does not replicate the topics of PAMLA's General/Standing Sessions."}, {"title": "Call for Papers: Frontiers of Narrative Studies", "publisher_and_location": "Frontiers of Narrative Studies", "submission_deadline": "Thursday, February 28, 2019", "description": "Call for Papers: Frontiers of Narrative Studies"}, {"title": "Playbook of the Sower: Octavia E. Butler as a Guide for World-Building", "publisher_and_location": "The Huntington Library, Art Museum, and Botanical Gardens", "submission_deadline": "Monday, February 24, 2020", "description": "President's SeriesPlaybook of the Sower: Octavia E. Butler as a Guide for World-Building ,Wed., May 27 ,The Huntington Library, Art Museum, and Botanical Gardens ,San Marino, CA ,This day-long program invites literary engagement, imaginative play, and sociopolitical praxis sparked by Octavia E. Butler's archive. This is the third part of the Octavia E. Butler and Adaptation series of the Centennial President's Series events. ,Workshop ,Approximately 8:30 a.m.–2 p.m., including continental breakfast and lunchBy application only ,EXTENDED DEADLINE: 11:59 pm PST, Monday, Feb. 24Notification of acceptance: Early March"}, {"title": "MMLA 2020 Conference - Cultures of Collectivity", "publisher_and_location": "The Midwest Modern Language Association", "submission_deadline": "Thursday, April 30, 2020", "description": "For its 2020 Convention, the Midwest Modern Language Association welcomes—especially, but not exclusively—proposals that broadly reflect aspects of its conference theme, “Cultures of Collectivity.”  We invite proposals for individual papers as well as for fully assembled panels or roundtables."}]