[{"description": "Content-Transfer-Encoding: 8bit\n\n*Call for Papers, Special Sessions, Workshops, and Sponsors*\n\n*ICPRAI 2020 - Second International Conference on Pattern Recognition \nand Artificial Intelligence *\n\n*Zhongshan City, China, just a short boat ride direct from Hong Kong airport\n**May 12-15, 2020*\n\n**Call for Papers:\n\n**Paper submission is now open through EasyChair until November 15, 2019.\nPlease see the \"Submission Guidelines\" page on our web URLs:\n\nhttp://www.icprai2020.com/and https://users.encs.concordia.ca/~icprai20/\n\n*Technical Session Tracks:*\n\n*Track* \t*Description*\n*1*: Prof. Lu \tRecognition of different types of patterns, handwriting, \ndocument, text, machine learning, neural networks, SVM, deep learning \nand classification techniques, language processing, semantic analysis, \ncomputational linguistics, e-learning and innovative teaching methods.\n*2*: Prof. Cheriet \tComputer vision and image processing, bio-medical \nanalysis, healthcare and tomography.\n*3*: Prof. Vincent \tArtificial Intelligence, 2D and 3D images and \ngraphics, audio/video, and multimedia applications, feature extraction \nand evaluation.\n*4*: Prof. Yuen \tSecurity and forensic studies, mobile applications, \nface, fingerprint, iris, brain, and strategic objects and targets.\n*5*: Prof. Zheng \tBig data, small sample size, supercomputing, data \nmining and performance evaluation, intelligent systems and practical \napplications, Industrial Applications of PRAI, intellectual properties \nand ownership, innovation and technology transfer, financial trends and \nanalysis, traffic analysis and smart transportation systems, robotics \nand autonomous vehicles.\n\n\n\n*Publication Notes: *\n\n 1. Proceedings of ICPRAI 2020 to be published in the _LNCS series of\n    Springer_,\n 2. Best papers will be selected for a Special Issue in the\n    International Journal of Pattern Recognition and Artificial\n    Intelligence (IJPRAI),\n 3. Papers of general interest will be considered for new books in the\n    Book Series of Language Processing, Pattern Recognition, and\n    Intelligent Systems (http://www.worldscientific.com/series/scpl), and\n 4. Depending on the submissions, we may also propose Special Issues to\n    other journals on papers of special interest on emerging topics.\n\n*Keynote Speakers***:\n\n**ICPRAI 2020 is proud to announce the following Keynote speakers, with \nmore to come:\n\n  * Prof. Gernot Fink, Germany\n  * Prof. Hironobu Fujiyoshi, Japan\n  * Prof. Seong-Whan Lee, Korea\n  * Prof. Cheng-Lin Liu, China\n  * Prof. Farida Cheriet, Canada\n  * Profs. Nicole Vincent and Camille Kurtz, France\n\n***Call for Special Sessions and Workshops\n\n***We welcome proposals for Special Sessions, Panels, and Workshops, \nsubmission starting on August 15, 2019until _*October 15, 2019*_.Please \nsend your proposals to the Conference Secretariat (email below).**\n**\n***Sponsors:\n\n***Looking to increase your visibility as a vendor in the AI landscape? \nAsk us about sponsorship and exhibitor opportunities.***\n\n**Important Dates:*\n\n    *Proposal for Special Sessions:* \tAugust 15 until October 15, 2019\n    *Paper Submission:* \t*September 15 until November 15, 2019*\n    *Acceptance notification:* \tJanuary 25, 2020\n    *Camera ready & Copyright Form:* \tFebruary 15, 2020\n\n*Contact:*\n\n*    Secretariat: *icprai2020@cenparmi.concordia.ca \n\n\n*Web: *http://www.icprai2020.com/and \nhttps://users.encs.concordia.ca/~icprai20/ \n\n*\nFacebook: *https://www.facebook.com/ICPRAI2020\n\n\n------------------------------------------------------------------------\nICPRAI 2020 - Second International Conference on Pattern Recognition and \nArtificial Intelligence\n*Web:*http://www.icprai2020.com/or \nhttps://users.encs.concordia.ca/~icprai20/\n*eMail:*icprai2020@cenparmi.concordia.ca\n*Facebook:*https://www.facebook.com/ICPRAI2020\nContent-Transfer-Encoding: 7bit\nContent-Disposition: inline\n\n_______________________________________________\nIcprai-2020-announcement mailing list\nIcprai-2020-announcement@encs.concordia.ca\nhttps://mail.encs.concordia.ca:444/mailman/listinfo/icprai-2020-announcement\n", "name": "Second International Conference on Pattern Recognition and Artificial Intelligence", "location": "Zhongshan City, China", "submission_date": "November 15, 2019", "notification_date": "January 25, 2020", "conference_date": "May 12-15, 2020"}, {"description": "Received: from p-zm-mta01.its.calpoly.edu (LHLO p-zm-mta01.its.calpoly.edu)\n (129.65.64.109) by p-zm-store01.its.calpoly.edu with LMTP;\n Thu, 20 Mar 2014 07:50:10 -0700 (PDT)\n [127.0.0.1]) by p-zm-mta01.its.calpoly.edu (Postfix) with ESMTP\n id 8A31E3A565 for ;\n Thu, 20 Mar 2014 07:50:10 -0700 (PDT)\n [129.65.64.9]) by p-zm-mta01.its.calpoly.edu (Postfix) with ESMTPS\n id 86AB23A564 for ;\n Thu, 20 Mar 2014 07:50:10 -0700 (PDT)\nX-IronPort-Anti-Spam-Result: ArcBADL/KlPRO9o1nGdsb2JhbABPCg6DM7Y/hTOHM4EYFg4BAQEBAQgLCQkUKIJJChMPHwMBAgQDATApVCcUAgOHYA2dYbF0F4xoCoERBgQGAgECBCMEhGEEiGWFa4EHiiKLOYc0f1shgSwBHw\nX-IPAS-Result: ArcBADL/KlPRO9o1nGdsb2JhbABPCg6DM7Y/hTOHM4EYFg4BAQEBAQgLCQkUKIJJChMPHwMBAgQDATApVCcUAgOHYA2dYbF0F4xoCoERBgQGAgECBCMEhGEEiGWFa4EHiiKLOYc0f1shgSwBHw\nX-Originating-IP-Address: 209.59.218.53\n with ESMTP; 20 Mar 2014 07:50:08 -0700\n (Postfix) with ESMTP id 44087884D4 for ;\n Thu, 20 Mar 2014 10:50:08 -0400 (EDT)\n id s2KEo8d0027656 for foaad@calpoly.edu;\n Thu, 20 Mar 2014 10:50:08 -0400\nFrom: Security \nSubject: Call For Papers - Deadline: April 19 (SAM'14: July 21-24,\n 2014, Las Vegas, USA) - Int'l Conf. on Security and Management\nUser-Agent: Heirloom mailx 12.4 7/29/08\nContent-Transfer-Encoding: 7bit\n\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n                         CALL  FOR  PAPERS\n\n        Paper Submission Deadline (EXTENDED): April 19, 2014\n\n                               SAM'14\n                The 2014 International Conference on\n                       Security and Management\n\n                  July 21-24, 2014, Las Vegas, USA\n                    http://sam.udmercy.edu/sam14\n\nSubmissions should be uploaded to the following site:\nhttps://www.easychair.org/conferences/?conf=sam14 \n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n-> (Since the original deadline for submission of papers coincided with the\n-> Spring break of many US and Far East institutions, the Steering Committee\n-> decided to extend the deadlines in response to numerous requests. Those\n-> authors who met the original deadlines, will receive the decision on\n-> their papers based on the original dates; i.e., notifications will not\n-> be delayed for those authors.)\n\nYou are invited to submit a full paper for consideration. All accepted\npapers will be published in printed conference books/proceedings (ISBN) and\nwill also be made available online. In addition, like prior years, extended\nversions of selected papers (about 35%) will appear in journals and edited\nresearch books (publishers include: Springer, Elsevier, BMC, and others).\nSee the following links for a small subset of the publications based on\naccepted papers in the federated congress that SAM is part of; some of\nthese books and journal special issues have already received the top 25%\ndownloads in their respective fields. To get a feeling about the\nconferences' atmosphere, see some delegates photos available at:\nhttp://worldcomp.phanfare.com/\nhttp://infinitydempsey.smugmug.com/WorldComp\n\n\nSAM'14 is composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. The conference will be held July\n21-24, 2014, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\nO  Network Security\n   -Security Algorithms\n   -Mobile Network Security\n   -Security in CDN (Contents Distribution Networks)\n   -Virtual Private Network (VPN)\n   -Tracing Techniques in Internet\n   -Active Networks\n   -Security in Grid\n   -Web Monitoring\n   -Network Security Engineering\n   -Transport-Level Security\n   -Wireless Network Security\n   -IP Security\n   -Electronic Mail security\n\nO  Cryptographic Technologies\n   -Security Protocols\n   -Key Management Techniques\n   -Cryptographic Technologies\n   -Applications of Block and Stream Ciphers\n   -Applications of Public Key Cryptology \n   -Message Authentication and Hash Functions\n   -Anonymity\n   -Digital Signature Schemes\n   -Secret Sharing\n   -Cryptanalysis\n\nO  Security Management\n   -Surveillance Technologies\n   -Security Policies\n   -Security for Protocol Management\n   -Location Management\n   -QoS Management\n   -Resource Management\n   -Channel Management\n   -Mobility Management\n   -Digital Contents Copyright Protection \n   -System Security Management\n   -Network Security Management\n   -Management in Network Equipment \n   -Storage Area Networks (SAN) Management\n   -Information Security Management\n   -Government Security Policy\n   -Web Penetration Testing\n   -Security Operations\n   -Vulnerabilities Management\n\nO  Security Education\n   -Computer Security Education\n   -Network Security Education\n   -Cyber Security Education \n   -Cyber Security Body of Knowledge\n   -Information Assurance Education        \n\nO  Information Assurance\n   -Mission Assurance\n   -Risk Assessment and Risk Management\n   -Continuity of Operations and Business Impact Analysis\n   -Cyber Security Compliance\n   -Security Auditing\n   -Security-Savvy Software Development\n   -Disaster Recovery\n   -Business Continuity Analysis\n   -Access Control\n   -Secure Use of Software\n   -Secure Performance       \n\nO  Biometrics and Forensics\n   -Novel Biometric Methods\n   -Forensics\n   -Biological Security Technologies\n   -Face Recognition Systems\n   -Signature Recognition Systems\n   -Cyber Forensics\n   -Forensic Analysis\n   -Biometric Technologies for Security\n   -Feature Extraction and Matching Algorithms\n\nO  Hardware Security\n   -Embedded Systems Security\n   -Cryptographic Processors and Co-Processors\n   -Security Architectures\n   -True and Pseudorandom Number Generators\n   -Side Channel Attacks\n   -Fault Attacks\n   -Hardware Tamper Resistance\n   -Smart Card Processors\n   -Secure Storage Devices\n\nO  Security Applications\n   -Security in E-Commerce and M-Commerce\n   -Secure OS\n   -Watermarking\n   -High-Tech Systems at Airports\n   -Emerging Technologies and Applications\n   -Cloud Computing Security\n   -Database Security\n   -Data Mining Security\n   -Cyber Security Automation\n\nO  Computer Security\n   -Firewall Systems\n   -Hacking Techniques and Related Issues\n   -Intrusion Detection System (IDS)\n   -Honeypot\n   -Virus Issues (Detection, Prevention ...)\n   -Trusted Computing\n   -Alert Correlation\n   -Attack Graphs\n   -Incident Responding\n   -Malware Analysis\n   -Incident Responding\n\n\nIMPORTANT DATES:\n\nApril 19, 2014:    Submission of full/regular papers (about 7 pages)\nMay 10, 2014:      Notification of acceptance (+/- two days)\nMay 24, 2014:      Final papers + Copyright + Registration\nJuly 21-24, 2014:  The 2014 International Conference on Security and\n                   Management (SAM'14)\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  \n\nhttps://www.easychair.org/conferences/?conf=sam14\n\nSubmissions must be uploaded by April 19, 2014 and must be in pdf formats\n(about 7 pages including all figures, tables, and references - single\nspace, font size of 10 to 12). All reasonable typesetting formats are\nacceptable (later, the authors of accepted papers will be asked to follow\na particular typesetting format to prepare their final papers for\npublication.) Papers must not have been previously published or currently\nsubmitted for publication elsewhere. The first page of the paper should\ninclude: title of the paper, name, affiliation, postal address, and email\naddress for each author. The first page should also identify the name of\nthe Contact Author and a maximum of 5 topical keywords that would best\nrepresent the content of the paper. The track title must also be stated\non the first page of the paper as well as a 100 to 150-word abstract. The\nlength of the final/Camera-Ready papers (if accepted) will be limited to\n7 (two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees.\nPapers whose authors include a member of the conference program\ncommittee will be evaluated using the double-blinded review process.\n(Essay/philosophical papers will not be refereed but may be considered\nfor discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Elsevier indexing\nproducts (SCI Elsevier products include, among others: Scopus,\nwww.info.scopus.com; Engineering Village, www.ei.org; EMBASE,\nwww.info.embase.com; and others); Inspec / IET / The Institute for\nEngineering & Technology; The French National Center for Scientific\nResearch, CNRS, INIST databases, PASCAL (accessible from INIST, Datastar,\nDialog, EBSCO, OVID, Questel.Orbit, Qwam, and STN International); and\nothers.\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster papers\n(if accepted) will be published if and only the author of the accepted paper\nwishes to do so. Please email your poster papers to the poster co-chairs:\n\nHanen Idoudi,  Hanen.Idoudi@ensi.rnu.tn or\nEsmiralda Moradian,   esmirald@dsv.su.se\n \n\nMEMBERS OF STEERING COMMITTEE:\n\nCurrently being finalized. The members of the Steering Committee of The\nfederated joint Congress that SAM was (and will be) part of in recen\nyears, included: Dr. Selim Aissi, (formerly: Chief Strategist - Security,\nIntel Corporation, USA) Senior Business Leader & Chief Architect, Visa\nCorporation, USA; Prof. Babak Akhgar, PhD, FBCS, CITP, Professor of\nInformatics, Sheffield Hallam University, Sheffield, UK; Prof. Hamid R.\nArabnia, Professor of Computer Science, Elected Fellow of ISIBM,\nEditor-in-Chief of Journal of Supercomputing (Springer), University of\nGeorgia, USA; Prof. Kevin Daimi, Professor of Computer Science, Director\nof Computer Science and Software Engineering Programs, Department of\nMathematics, Computer Science and Software Engineering, University of\nDetroit Mercy, Detroit, Michigan, USA; Dr. Michael R. Grimaila, Associate\nProfessor, Air Force Institute of Technology, Systems Engineering, Fellow\nof ISSA, CISM, CISSP, IAM/IEM, Editorial Board of ISSA Journal, Air Force\nCenter of Cyberspace Research, Advisor to the Prince of Wales Fellows &\nPrince Edward Fellows at MIT and Harvard Universities and PC member of\nNATO Cooperative Cyber Defense Centre of Excellence (CCD COE); Prof. Kun\nChang Lee, Professor of MIS and WCU Professor of Creativity Science,\nBusiness School and Department of Interaction Science, Sungkyunkwan\nUniversity, Seoul, South Korea; Prof., Dr., Dr.h. Victor Malyshkin, Head\nof Supercomputer Software Department (SSD), Institute of Computational\nMathematics and Mathematical Geophysics, Russian Academy of Sciences,\nRussia; Prof. George Markowsky, Professor and Chair of Computer Science,\nAssociate Director of School of Computing and Information Science, Chair\nof International Advisory Board of IEEE IDAACS and Director 2013\nNortheast Collegiate Cyber Defense Competition, Chair Bangor Foreign\nPolicy Forum, Cooperating Professor of Mathematics & Statistics\nDepartment UMaine, Cooperating Professor of School of Policy &\nInternational Affairs UMaine, University of Maine, Orono, Maine, USA;\nProf. Andy Marsh, Director of HoIP, Director of HoIP Telecom, UK,\nSecretary-General of WABT, Vice-president of ICET, Visiting Professor,\nUniversity of Westminster, UK; Prof. James J. (Jong Hyuk) Park,\nProfessor of Computer Science and Engineering, Seoul National University\nof Science and Technology (SeoulTech), Korea, President of KITCS,\nPresident of FTRA, Editor-in-Chiefs of HCIS, JoC and IJITCC Journals; Ashu\nM. G. Solo (Publicity Chair), Fellow of British Computer Society,\nPrincipal R&D Engineer, Maverick Technologies America; Prof. Sang C. Suh,\nHead and Professor of Computer Science, Vice President, of Society for\nDesign and Process Science (SDPS), Director of Intelligent Cyberspace\nEngineering Lab (ICEL), Texas A&M University, Com., Texas, USA;\nProf. Layne T. Watson, IEEE Fellow, NIA Fellow, ISIBM Fellow, Fellow of\nThe National Institute of Aerospace, Virginia Polytechnic Institute &\nState University, Virginia, USA. The 2013 Program Committee for SAM\nconference is currently being compiled. Many who have already joined the\ncommittees are renowned leaders, scholars, researchers, scientists and\npractitioners of the highest ranks; many are directors of research labs.,\nfellows of various societies, heads/chairs of departments, program\ndirectors of research funding agencies, as well as deans and provosts.\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the Program\nCommittee should email Professor Daimi ( daimikj@udmercy.edu ) the\nfollowing information for consideration/evaluation: Name, affiliation and\nposition, complete mailing address, email address, a one-page biography\nthat includes research expertise, and details of two recent papers on\nsecurity.\n\n\nGENERAL INFORMATION:\n\nSAM is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster\nworking relationships and gain access to the latest research results.\nIt is being held jointly (same location and dates) with a number of\nother research conferences; namely, The 2014 World Congress in Computer\nScience, Computer Engineering, and Applied Computing. The Congress is\none of the largest annual gathering of researchers in computer science,\ncomputer engineering and applied computing. We anticipate to have 2,100\nor more attendees from over 85 countries. The 2014 Congress will be\ncomposed of research presentations, keynote lectures, invited presentations,\ntutorials, panel discussions, and poster presentations. In recent past,\nkeynote/tutorial/panel speakers have included: Prof. David A. Patterson\n(pioneer, architecture, U. of California, Berkeley), Dr. K. Eric Drexler\n(known as Father of Nanotechnology), Prof. John H. Holland (known as\nFather of Genetic Algorithms; U. of Michigan), Prof. Ian Foster (known as\nFather of Grid Computing; U. of Chicago & ANL), Prof. Ruzena Bajcsy\n(pioneer, VR, U. of California, Berkeley), Prof. Barry Vercoe (Founding\nmember of MIT Media Lab, MIT), Dr. Jim Gettys (known as X-man, developer\nof X Window System, xhost; OLPC), Prof. John Koza (known as Father of\nGenetic Programming, Stanford U.), Prof. Brian D. Athey (NIH Program\nDirector, U. of Michigan), Prof. Viktor K. Prasanna (pioneer, U. of\nSouthern California), Dr. Jose L. Munoz (NSF Program Director and\nConsultant), Prof. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head,\nNASA Mars Exploration Program/2000-2005 and Associate Director, Project\nFormulation & Strategy, Jet Propulsion Lab, CalTech/NASA; Director, NASA's\nJPL Solar System Exploration), Prof. David Lorge Parnas (Fellow of IEEE,\nACM, RSC, CAE, GI; Dr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and\nU. of Limerick), Prof. Eugene H. Spafford (Executive Director, CERIAS and\nProfessor, Purdue University), Dr. Sandeep Chatterjee (Vice President &\nChief Technology Officer, SourceTrace Systems, Inc.), Prof. Haym Hirsh\n(Rutgers University, New Jersey, USA and former director of Division of\nInformation and Intelligent Systems, National Science Foundation, USA;\ncurrently, Dean at Cornell University), Dr. Flavio Villanustre (Vice-\nPresident, HPCC Systems), and many other distinguished speakers. To get\na feeling about the conferences' atmosphere, see some delegates photos\navailable at:\nhttp://infinitydempsey.smugmug.com/WorldComp \nwww.pixagogo.com/1676934789 \nAn important mission of the Congress is \"Providing a unique platform for a\ndiverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities (such\nas: universities, institutions, corporations, government agencies, and\nresearch centers/labs) from all over the world. The Congress also attempts\nto connect participants from institutions that have teaching as their main\nmission with those who are affiliated with institutions that have research\nas their main mission. The Congress uses a quota system to achieve its\ninstitution and geography diversity objectives.\" 138939\nOne main goal of the Congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of\ncomputer science, computer engineering, and applied computing. The\nCongress also encourages multi-disciplinary and inter-disciplinary\nresearch initiatives; i.e., facilitating increased opportunities for\ncross-fertilization across sub-disciplines. Below, you will find a\nsmall subset of the books and journal special issues published based\non extended versions of accepted papers in the congress that SAM\nis part of:\n\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-7045-9\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-5912-6\nhttp://store.elsevier.com/Emerging-Trends-in-ICT-Security/isbn-9780124114746/\nhttp://www.biomedcentral.com/bmcmedgenomics/supplements/6/S1\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC3287490/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2709251/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2999338/\nhttp://www.biomedcentral.com/1471-2164/9/S1/I1\nhttp://www.springer.com/series/11769\nhttp://www.biomedcentral.com/1752-0509/5?issue=S3\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2013, papers published in the conference proceedings\nthat have been held as part of the federated congress, have received over\n27,500 citations (includes about 3,300 self-citations). Citation data\nobtained from http://academic.research.microsoft.com/ . The citation data\ndoes not even include more than 15,000 other citations to papers in\nconferences whose first offerings were initiated by the congress.\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 29, 2014\n\nCONTACT:\nInquiries should be sent to:  daimikj@udmercy.edu \n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n", "name": "International Conference on Security and Management", "location": "Las Vegas, USA", "submission_date": "April 19, 2014", "notification_date": "May 10, 2014", "conference_date": "July 21-24, 2014"}, {"description": "Received: from przmmt01.its.calpoly.edu (LHLO przmmt01.its.calpoly.edu)\n (129.65.64.27) by przmms01.its.calpoly.edu with LMTP;\n Mon, 28 Jan 2013 13:31:44 -0800 (PST)\n [129.65.64.9]) by przmmt01.its.calpoly.edu (Postfix) with ESMTPS\n id 144B19D0011 for ;\n Mon, 28 Jan 2013 13:31:44 -0800 (PST)\nX-IronPort-Anti-Spam-Result: Av0CAAfuBlHRO9o1mWdsb2JhbAA6AQkOgWYIuF2DfRYOAQEBAQEICwsHFCeCMw8dKwMDAQEBAwEDATAPGho6JxQBAYd7DJ8YoRWMfwsGAQMGAoQJA4hhjkiRZVyBSAEIFw\nX-Originating-IP-Address: 209.59.218.53\n with ESMTP; 28 Jan 2013 13:31:22 -0800\n (Postfix) with ESMTP id 852814C7B406 for ;\n Mon, 28 Jan 2013 16:31:21 -0500 (EST)\n id r0SLVJgR006137 for foaad@calpoly.edu;\n Mon, 28 Jan 2013 16:31:19 -0500\nMessage-ID: \nTo: \n Frontiers in Education: Computer Science & Computer Engineering\n (FECS'13: July 22-25, 2013, USA) - Paper Submission Deadline:\n March 18, 2013\nUser-Agent: Heirloom mailx 12.4 7/29/08\nContent-Transfer-Encoding: 7bit\n\n\nDear Computer Science and Computer Engineering Colleagues:\n\nWe hope that this announcement is of interest. Hope to see you all.\nThank you,\nSC\n*********************************************************************\n                    C A L L    F O R    P A P E R S\n\n              Paper Submission Deadline: March 18, 2013\n\n                              FECS'13\n         The 2013 International Conference on Frontiers in\n        Education: Computer Science and Computer Engineering\n\n                  July 22-25, 2013, Las Vegas, USA\n\nhttp://www.worldacademyofscience.org/worldcomp13/ws/conferences/fecs13\n*********************************************************************\n\nYou are invited to submit a full paper for consideration. All accepted\npapers will be published in printed conference books/proceedings (ISBN)\nand will also be made available online. The proceedings will be indexed\nin science citation databases that track citation frequency/data for\neach paper. In addition, like prior years, extended versions of selected\npapers (about 35%) will appear in journals and edited research books\n(publishers include: Springer, Elsevier, BMC, and others). FECS'13\nis composed of a number of tracks, including: tutorials, sessions,\nworkshops, posters, and panel discussions. The conference will be held\nJuly 22-25, 2013, Las Vegas, USA.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\nO  ABET Accreditation and assessment (experiences and methods)\nO  Student recruitment and retention methods\nO  Promoting multi-disciplinary initiatives - impact on curriculum\nO  Capstone research projects: examples and case studies\nO  Distance learning; methods, technologies and assessment\nO  Innovative degree programs and certificates\nO  Innovative uses of technology in the classroom\nO  Collaborative learning\nO  Learning models and learning from mistakes\nO  Computer and web-based software for instruction\nO  Ethics in computer science and engineering\nO  Incorporating writing into CS and CE curriculum\nO  Preparing graduates for academia\nO  Preparing graduates for industry\nO  Partnerships with industry and government\nO  Team projects and case studies\nO  Undergraduate research experiences\nO  Student observation and mentoring strategies\nO  Advising methods\nO  Evaluation strategies (professors, students, ...)\nO  Transition to graduate studies\nO  Integrating gender and culture issues into computer science and\n   engineering curriculum\nO  The balance between course-work and research\nO  Issues related to the choice of first programming language\nO  Debugging tools and learning\nO  Projects, software engineering, programming issues, and\n   laboratory practices\nO  Virtual laboratories\nO  Computer science and computer engineering curriculum\nO  Active learning tools\nO  Undergraduates as teaching assistants\nO  Funding opportunities for curriculum development and studies\nO  Pilot studies\nO  STEM (Science, Technology, Engineering & Mathematics) initiatives\nO  Teaching methods\nO  Recruiting methods to attract graduate students\nO  Proposed methods for ranking CS and CE departments\nO  The role of visualization and animation in education\nO  Academic dishonesty in a high-tech environment\nO  Experiences in the formation of Department Advisory Board\nO  Factors that lead to success in CS and CE\n\n\nIMPORTANT DATES:\n\nJanuary 31, 2013:  Workshop / Session Proposals\nMarch 18, 2013:    Submission of full papers (about 7 pages)\nApril 18, 2013:    Notification of acceptance (+/- two days)\nMay 5, 2013:       Final papers + Copyright + Registration\nJuly 22-25, 2013:  The 2013 International Conference on Frontiers in\n                   Education: Computer Science and Computer Engineering\n                   (FECS'13)\n\n\nCO-SPONSORS:\n\nCurrently being prepared - The Academic Sponsors of the last offering of\nFECS (2012) included research labs and centers affiliated with:\nMinnesota Supercomputing Institute, USA; Argonne National Laboratory,\nIllinois, USA; George Mason University, Virginia, USA; Harvard University,\nCambridge, Massachusetts, USA; Center for Cyber Defense, NCAT, North\nCarolina, USA; Center for Advanced Studies in Identity Sciences (CASIS:\nNC A&T, Carnegie Mellon, Clemson, UNC Wilmington), USA; Massachusetts\nInstitute of Technology (MIT), Cambridge, Massachusetts, USA; Texas A&M\nUniversity, USA; UMIT, Institute of Bioinformatics and Translational\nResearch, Austria; University of Iowa, USA; Russian Academy of Sciences,\nMoscow, Russia; NDSU-CIIT Green Computing and Communications Laboratory,\nUSA; Medical Image HPC and Informatics Lab, Iowa, USA; and others.\nSponsors At-Large included (corporate, associations, organizations):\nIntel Corporation; Super Micro Computer, Inc., California, USA; Altera\nCorporation; The International Council on Medical and Care Compunetics;\nInternational Society of Intelligent Biological Medicine; US Chapter of\nWorld Academy of Science; High Performance Computing for Nanotechnology;\nLuna Innovations; World Academy of Biomedical Sciences and Technologies;\nManx Telecom; Computer Science Research, Education, and Applications\nPress; HoIP Telecom; Hodges Health; Leading Knowledge; OMG; Science\nPublications and others.\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org .\nSubmissions must be uploaded by March 18, 2013 and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables,\nand references - single space, font size of 10 to 12). All reasonable\ntypesetting formats are acceptable (later, the authors of accepted\npapers will be asked to follow a particular typesetting format to\nprepare their final papers for publication.) Papers must not have been\npreviously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author. The\nfirst page should also identify the name of the Contact Author and a\nmaximum of 5 topical keywords that would best represent the content\nof the paper. The name of the conference (ie, FECS) must also be\nstated on the first page of the paper as well as a 100 to 150-word\nabstract. The length of the final/Camera-Ready papers (if accepted)\nwill be limited to 7 (two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees.\nPapers whose authors include a member of the conference program\ncommittee will be evaluated using the double-blinded review process.\n(Essay/philosophical papers will not be refereed but may be considered\nfor discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Inspec / IET / The\nInstitute for Engineering & Technology; The French National Center for\nScientific Research, CNRS, INIST databases, PASCAL (accessable from\nINIST, Datastar, Dialog, EBSCO, OVID, Questel.Orbit, Qwam, and STN\nInternational); P3P8PCTD138939 and others. Though, there is no guarantee\nthat the proceedings will also be included in SCI EI Compendex/Elsevier\nindexings; in the past, the proceedings were included in these databases.\nTherefore, we will also be sending the proceedings for indexing\nprocedures to SCI EI Compendex/Elsevier. The printed proceedings/books\nwill be available for distribution on site at the conference.\n\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster\npapers (if accepted) will be published if and only the author of the\naccepted paper wishes to do so.\n\n\nPROPOSAL FOR ORGANIZING WORKSHOPS/SESSIONS:\n\nEach conference is composed of a number of tracks. A track can be a session,\na workshop, or a symposium. A session will have at least 6 papers; a\nworkshop at least 12 papers; and a symposium at least 18 papers. Track\nchairs will be responsible for all aspects of their tracks, including:\nsoliciting papers, reviewing, selecting, ... The names of track chairs\nwill appear as Associate Editors in the conference proceedings and on\nthe cover of the printed books (and indexed in science databases as such).\n\nProposals to organize tracks (sessions, workshops, or symposiums) should\ninclude the following information: name and address (+ email) of proposer,\nhis/her biography, title of track, a 100-word description of the topic of\nthe track, the name of the conference the track is submitted for\nconsideration (ie, FECS), and a short description on how the track\nwill be advertised (in most cases, track proposers solicit papers from\ncolleagues and researchers whose work is known to the track proposer).\nE-mail your track proposal to editor@world-comp.org . We would like to\nreceive the track proposals as soon as possible but by no later than\nJanuary 31, 2013.\n\n\nMEMBERS OF PROGRAM AND ORGANIZING COMMITTEES:\n\nCurrently being finalized. The members of the Steering Committee of The\n2012 Congress that FECS was (and will be) part of included: Dr. Selim\nAissi, (formerly: Chief Strategist - Security, Intel Corporation, USA)\nSenior Business Leader & Chief Architect, Visa Corporation, USA; Prof.\nBabak Akhgar, PhD, FBCS, CITP, Professor of Informatics, Sheffield\nHallam University, Sheffield, UK; Prof. Hamid R. Arabnia, Professor of\nComputer Science, Elected Fellow of ISIBM, Editor-in-Chief of Journal\nof Supercomputing (Springer), University of Georgia, USA; Prof. Kevin\nDaimi, Professor of Computer Science, Director of Computer Science and\nSoftware Engineering Programs, Department of Mathematics, Computer\nScience and Software Engineering, University of Detroit Mercy, Detroit,\nMichigan, USA; Prof. Gerry Vernon Dozier, Professor of Computer Science,\nChair of Department of Computer Science and Director of Center for\nAdvanced Studies in Identity Sciences, Center for Cyber Defense, North\nCarolina A&T State University, North Carolina, USA; Dr. Michael R.\nGrimaila, Associate Professor, Air Force Institute of Technology,\nSystems Engineering, Fellow of ISSA, CISM, CISSP, IAM/IEM, Editorial\nBoard of ISSA Journal, Air Force Center of Cyberspace Research, Advisor\nto the Prince of Wales Fellows & Prince Edward Fellows at MIT and\nHarvard Universities and PC member of NATO Cooperative Cyber Defence\nCentre of Excellence (CCD COE); Prof. Kun Chang Lee, Professor of MIS\nand WCU Professor of Creativity Science, Business School and Department\nof Interaction Science, Sungkyunkwan University, Seoul, South Korea;\nProf., Dr., Dr.h. Victor Malyshkin, Head of Supercomputer Software\nDepartment (SSD), Institute of Computational Mathematics and\nMathematical Geophysics, Russian Academy of Sciences, Russia;\nProf. George Markowsky, Professor and Chair of Computer Science,\nAssociate Director of School of Computing and Information Science,\nChair of International Advisory Board of IEEE IDAACS and Director 2013\nNortheast Collegiate Cyber Defense Competition, Chair Bangor Foreign\nPolicy Forum, Cooperating Professor of Mathematics & Statistics\nDepartment UMaine, Cooperating Professor of School of Policy &\nInternational Affairs UMaine, University of Maine, Orono, Maine, USA;\nProf. Andy Marsh, Director of HoIP, Director of HoIP Telecom, UK,\nSecretary-General of WABT, Vice- president of ICET, Visiting Professor,\nUniversity of Westminster, UK; Prof. James J. (Jong Hyuk) Park,\nProfessor of Computer Science and Engineering, Seoul National\nUniversity of Science and Technology (SeoulTech), Korea, President of\nKITCS, Presidentof FTRA, Editor-in-Chiefs of HCIS, JoC and IJITCC\nJournals; Ashu M. G. Solo (Publicity Chair), Fellow of British\nComputer Society, Principal R&D Engineer, Maverick Technologies\nAmerica; Prof. Sang C. Suh, Head and Professor of Computer Science,\nVice President, of Society for Design and Process Science (SDPS),\nDirector of Intelligent Cyberspace Engineering Lab (ICEL), Texas A&M\nUniversity, Com., Texas, USA; Prof. Layne T. Watson, IEEE Fellow,\nNIA Fellow, ISIBM Fellow, Fellow of The National Institute of\nAerospace, Virginia Polytechnic Institute & State University,\nVirginia, USA\nThe 2013 Program Committee for FECS conference is currently being\ncompiled. Many who have already joined the committees are renowned\nleaders, scholars, researchers, scientists and practitioners of the\nhighest ranks; many are directors of research labs., fellows of\nvarious societies, heads/chairs of departments, program directors of\nresearch funding agencies, as well as deans and provosts.\n\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the\nProgram Committee should email editor@world-comp.org  the following\ninformation for consideration/evaluation: Name, affiliation and\nposition, complete mailing address, email address, a one-page biography\nthat includes research expertise and the name of the conference\n(ie, FECS) offering to help with.\n\n\nGENERAL INFORMATION:\n\nFECS is an international conference that serves researchers, scholars,\nprofessionals, students, and academicians who are looking to both foster \nworking relationships and gain access to the latest research results.\nIt is being held jointly (same location and dates) with a number of\nother research conferences; namely, The 2013 World Congress in Computer\nScience, Computer Engineering, and Applied Computing (WORLDCOMP). The\nCongress is the largest annual gathering of researchers in computer\nscience, computer engineering and applied computing. We anticipate to\nhave 2,100 or more attendees from over 85 countries.\n\nThe 2013 Congress will be composed of research presentations, keynote\nlectures, invited presentations, tutorials, panel discussions, and\nposter presentations. In recent past, keynote/tutorial/panel speakers\nhave included: Prof. David A. Patterson (pioneer, architecture, U. of\nCalifornia, Berkeley), Dr. K. Eric Drexler (known as Father of\nNanotechnology), Prof. John H. Holland (known as Father of Genetic\nAlgorithms; U. of Michigan), Prof. Ian Foster (known as Father of Grid\nComputing; U. of Chicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U.\nof California, Berkeley), Prof. Barry Vercoe (Founding member of MIT\nMedia Lab, MIT), Dr. Jim Gettys (known as X-man, developer of X Window\nSystem, xhost; OLPC), Prof. John Koza (known as Father of Genetic\nProgramming, Stanford U.), Prof. Brian D. Athey (NIH Program Director,\nU. of Michigan), Prof. Viktor K. Prasanna (pioneer, U. of Southern\nCalifornia), Dr. Jose L. Munoz (NSF Program Director and Consultant),\nProf. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head,\nNASA Mars Exploration Program/2000-2005 and Associate Director, Project\nFormulation & Strategy, Jet Propulsion Lab, CalTech/NASA; Director,\nNASA's JPL Solar System Exploration), Prof. David Lorge Parnas (Fellow\nof IEEE, ACM, RSC, CAE, GI; Dr.h.c.: ETH Zurich, Prof. Emeritus,\nMcMaster U. and U. of Limerick), Prof. Eugene H. Spafford (Executive\nDirector, CERIAS and Professor, Purdue University), Dr. Sandeep\nChatterjee (Vice President & Chief Technology Officer, SourceTrace\nSystems, Inc.), Prof. Haym Hirsh (Rutgers University, New Jersey, USA\nand former director of Division of Information and Intelligent Systems,\nNational Science Foundation, USA), Dr. Flavio Villanustre (Vice-\nPresident, HPCC Systems), and many other distinguished speakers. To\nget a feeling about the Congress's atmosphere, see the 2012 delegates\nphotos available at: http://infinitydempsey.smugmug.com/WorldComp\n\nAn important mission of the Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The Congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The Congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the Congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of\ncomputer science, computer engineering, and applied computing. The\nCongress also encourages multi-disciplinary and inter-disciplinary\nresearch initiatives; ie, facilitating increased opportunities for\ncross-fertilization across sub-disciplines.\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 2012, papers published in the Congress proceedings have\nreceived over 27,000 citations (includes about 2,000 self-citations).\nCitation data obtained from http://academic.research.microsoft.com/ .\n\nCONTACT:\n\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n", "name": "International Conference on Frontiers in Education: Computer Science and Computer Engineering", "location": "Las Vegas, USA", "submission_date": "March 18, 2013", "notification_date": "April 18, 2013", "conference_date": "July 22-25, 2013"}, {"description": "Received: from p-zm-mta01.its.calpoly.edu (LHLO p-zm-mta01.its.calpoly.edu) (129.65.64.109) by p-zm-store01.its.calpoly.edu with LMTP;\n\t Sat, 11 Apr 2015 10:26:05 -0700 (PDT)\n\t Sat, 11 Apr 2015 10:26:04 -0700 (PDT)\n\t Sat, 11 Apr 2015 10:26:04 -0700 (PDT)\nX-IronPort-Anti-Spam-Result: A0AEAQBIWClVnDXaO9FSCg6DUFyMT6l7AY0ggkYMhXoDAoEzPBABAQEBAQEBEQEBAQEBCAsJCRQuhEMsHwMCOQ8aGh0dJxQCiBQNpnqmDQwgjGgBglsGBAcBAwUjgloMQR2BFgWFEotXhByGFYEeOoJ9hmyJLIIlDQ8Uf1kiMQGBAQEIF4EhAQEB\nX-IPAS-Result: A0AEAQBIWClVnDXaO9FSCg6DUFyMT6l7AY0ggkYMhXoDAoEzPBABAQEBAQEBEQEBAQEBCAsJCRQuhEMsHwMCOQ8aGh0dJxQCiBQNpnqmDQwgjGgBglsGBAcBAwUjgloMQR2BFgWFEotXhByGFYEeOoJ9hmyJLIIlDQ8Uf1kiMQGBAQEIF4EhAQEB\n\t    d=\"scan'208\"; a=9678464\nReceived: from world-comp.org ([209.59.218.53]) by cpmx03-in.its.calpoly.edu with ESMTP;\n\t 11 Apr 2015 10:26:04 -0700\n\t Sat, 11 Apr 2015 13:26:03 -0400 (EDT)\nSubject: CFP: International Conference on Health Informatics & Medical\n Systems (HIMS'15: July 27-30, 2015, USA); Submission Deadline: April\n 15\nMessage-ID: \nContent-Type: text/plain\n\n\n                         CALL  FOR  PAPERS\n\n  International Conference on Health Informatics and Medical Systems\n                              HIMS'15\n\n         July 27-30, 2015, Monte Carlo Resort, Las Vegas, USA\nhttp://www.worldacademyofscience.org/worldcomp15/ws/conferences/hims15 \n\n         Paper Submission Deadline (EXTENDED): April 15, 2015\n                  11:59pm US Eastern Time zone (EDT)\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nThe conference is composed of a number of tracks, tutorials, sessions,\nworkshops, poster and panel discussions; all will be held simultaneously,\nsame location and dates: July 27-30, 2015.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\n   Prologue: Health Informatics and Medical Systems is an important\n   area that is at the intersection of information science, computer\n   science, social science, behavioral science and health care. This\n   field is mainly concerned with the resources, devices, and methods\n   required to optimize the acquisition, storage, retrieval, processing\n   and use of information in health and biomedicine. Health informatics\n   is driven by computers, information and communication systems. It is\n   a multi-disciplinary field that covers a wide spectrum of sub-fields.\n   It combines the problem solving skills of computer scientists with\n   health care professionals and health care givers. The list of topics\n   of interest that appears below is by no means exhaustive.\n\no  Information Technologies for Healthcare Delivery and Management\no  Health Data Acquisition, Management and Visualization\no  Healthcare Knowledge Management and Decision Support\no  Healthcare Modeling and Simulation\no  Data Analytics, Data Mining and Machine Learning\no  Health Information Systems\no  Clinical Informatics\no  Integrated Data Repository\no  Computational Health Informatics\no  Community Health Informatics\no  Informatics for Education & Research in Health and Medicine\no  Imaging Science\no  Collaboration tools such as social media, web apps, patient education\no  Healthcare Communication Networks and Environments\no  Biotechnology and Pharmaceuticals\no  Computer-Aided Surgery\no  Computers in Medical Education\no  Haptics in Healthcare\no  Health Care Information Systems\no  Implant Technology and Systems\no  Interactive 3-D Models\no  Medical Physics\no  Neural, Sensory Systems and Rehabilitation\no  Patient Diagnosis Methods\no  Patient Monitoring Systems\no  Regenerative Medicine\no  Systems Physiology\no  Telemedicine\no  Therapeutic Engineering and Systems\n\n\nINVITATION:\n\nYou are invited to submit a paper for consideration. All accepted papers\nwill be published in printed conference books/proceedings (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data. In addition, like\nprior years, extended versions of selected papers (about 35%) of the\nconference will appear in journals and edited research books (publishers\ninclude: Springer, Elsevier, BMC, and others; a list that includes a\nsmall subset of such books and journal special issues appear in this\ndocument); some of these books and journal special issues have already\nreceived the top 25% downloads in their respective fields.\n\n\nIMPORTANT DATES:\n\nApril 15, 2015:    Submission of full papers (about 7 pages)\n                   11:59pm US Eastern Time zone (EDT)\nApril 30, 2015:    Notification of acceptance (+/- two days)\nMay 15, 2015:      Final papers + Copyright + Registration\nJuly 27-30, 2015:  International Conference on Health Informatics\n                   and Medical Systems (HIMS'15)\n\n\nSUBMISSION OF DRAFT PAPERS FOR EVALUATION:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by the due date (see IMPORTANT DATES) and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables, and\nreferences.) All reasonable typesetting formats are acceptable (later,\nthe authors of accepted papers will be asked to follow a particular\ntypesetting format to prepare their final papers for publication; these\nformatting instructions appear at: http://world-comp.org and they\nconform to the two-column IEEE style format). Papers must not have been\npreviously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author as well\nas a maximum of 5 topical keywords that would best represent the content\nof the paper. The first page should also identify the name of the\nContact/Corresponding author together with his/her professional email\naddress. A 100 to 150-word abstract should appear on the first page.\nAuthors are to conform to the common CODE OF ETHICS FOR AUTHORS (The\ndocument for the Code of Ethics is available on the submission web site.)\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The printed proceedings/books will\nbe available for distribution on site at the conference. The proceedings\nwill be indexed in science citation databases that track citation\nfrequency/data. The proceedings/books of the federated congress that\nthis conference is part of have been evaluated for inclusion into major\nscience citation index databases. We are happy to report that so far,\nthe evaluation board of science citation index databases have approved\nthe indexing, integrating, and inclusion of the following conference\ntracks into relevant indexing databases (indexing databases include,\namong others: Scopus, Engineering Village, EMBASE, and others):\nBIOCOMP, DMIN, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA, and SAM. All\nproceedings are also approved for inclusion into EBSCO (www.ebsco.com),\none of the largest subject index systems. The titles of proceedings of\nthe federated congress have been indexed into the ACM Digital Library\n( http://dl.acm.org/ ) which includes bibliographic citations from major\npublishers in computing.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer\npublishers (Transactions of Computational Science and Computational\nIntelligence). After the conference (the process may take 12 to 18\nmonths), a significant number of authors of accepted papers of our\ncongress, will be given the opportunity to submit the extended version\nof their papers for publication consideration in these books. We\nanticipate having between 10 and 20 books a year in each of these\nbook series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes:\nScopus, www.info.scopus.com; SCI Compendex, Engineering Village,\nwww.ei.org; EMBASE, www.info.embase.com; and others). For a recent and\na very small subset of the books (and journal special issues) that have\nbeen published based on the extended versions of our congress papers,\nsee the link below:\nhttp://www.worldacademyofscience.org/worldcomp15/ws/books_journals \n\nSome of these books and journal special issues have already received\nthe top 25% downloads in their respective fields - we already have a\nnumber of Elsevier and Springer books in the pipeline.\n\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear in section SUBMISSION OF DRAFT PAPERS FOR\nEVALUATION - except that the submission is limited to 2 pages. On the\nfirst page, the author should state that \"This paper is being submitted\nas a poster\". Poster papers (if accepted) will be published as such, if\nand only if the author of the accepted poster wishes to do so.\n\n\nGENERAL INFORMATION:\n\nThe federated Congress that this conference is part of is composed of\nresearch presentations, keynote lectures, invited presentations,\ntutorials, panel discussions, and poster presentations. In recent past,\nkeynote/tutorial/panel speakers have included:\nProf. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nProf. Amit Sheth (Fellow of IEEE and LexisNexis Eminent Scholar;\nFounder/Executive Director, Ohio Center of Excellence in Knowledge-enabled\nComputing (Kno.e.sis) and Professor of Computer Science, Wright State\nUniversity, Ohio, USA); Dr. Leonid I. Perlovsky (Harvard University,\nCambridge, Massachusetts, USA and School of Engineering and Applied\nSciences and Medical School Athinoula Martinos Brain Imaging Center; and\nThe US Air Force Research Lab., USA; CEO, LP Information Technology, USA\nand Chair of IEEE Task Force on The Mind and Brain; Recipient of John\nMcLucas Award, the highest US Air Force Award for basic research);\nand many other distinguished speakers. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\n\nhttp://worldcomp.phanfare.com/ \nhttp://worldcomp.phanfare.com/6626396 (to see a slide show, click on\n\"Start SlideShow\" tab at the url above.)\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\ni.e., facilitating increased opportunities for cross-fertilization across\nsub-disciplines. 138939\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 14, 2014, proceedings of the federated congress that this\nconference is part of, have received over 27,914 citations (includes 3,346\nself-citations). Citation data is obtained from Microsoft Academic Search.\nThe citation data does not even include more than 15,000 other citations\nto papers published by conferences whose first offerings were initiated\nby the congress. Individual proceedings/books (2013 & 2014) of the\nfederated congress can be purchased from major science book distributors:\n(such as: EBSCO and others):\nhttp://www.worldacademyofscience.org/worldcomp14/ws/proceedings \nhttp://www.worldacademyofscience.org/worldcomp13/ws/proceedings \n\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nJanuary 1, 2015.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: (Please allow up to 24 hours for any changes to be reflected) \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n", "name": "International Conference on Health Informatics and Medical Systems", "location": "Las Vegas, USA", "submission_date": "April 15, 2015", "notification_date": "April 30, 2015", "conference_date": "July 27-30, 2015"}, {"description": "Received: from p-zm-mta01.its.calpoly.edu (LHLO p-zm-mta01.its.calpoly.edu) (129.65.64.109) by p-zm-store01.its.calpoly.edu with LMTP;\n\t Tue, 27 Jan 2015 09:08:22 -0800 (PST)\n\t Tue, 27 Jan 2015 09:08:22 -0800 (PST)\n\t Tue, 27 Jan 2015 09:08:22 -0800 (PST)\nX-IronPort-Anti-Spam-Result: A0BuBgCcxMdUnDXaO9FQCg6DSlmMH6scAYxpgVBFGQyFagOBK0MBAQEBAREBAQEBAQgLCQkULoQtAywfAwIBBzEPGhodHScUAogWDbBipDoMIIxIAYJNBgQHAQODAQxAHYETBYRChHhNhEaDbIVVgRY2ijGDAzKDC4IxI39bIDEBgQEBCBeBIAEBAQ\nX-IPAS-Result: A0BuBgCcxMdUnDXaO9FQCg6DSlmMH6scAYxpgVBFGQyFagOBK0MBAQEBAREBAQEBAQgLCQkULoQtAywfAwIBBzEPGhodHScUAogWDbBipDoMIIxIAYJNBgQHAQODAQxAHYETBYRChHhNhEaDbIVVgRY2ijGDAzKDC4IxI39bIDEBgQEBCBeBIAEBAQ\n\t    d=\"scan'208\"; a=4196779\nReceived: from world-comp.org ([209.59.218.53]) by cpmx06-in.its.calpoly.edu with ESMTP;\n\t 27 Jan 2015 09:08:11 -0800\n\t Tue, 27 Jan 2015 12:08:09 -0500 (EST)\nSubject: CFP: Int'l Conf. on Image Processing, Computer Vision, and Pattern\n Recognition (IPCV'15: July 27-30, 2015, USA); Submission Deadline: March\n 31\nMessage-ID: \nContent-Type: text/plain\n\n\n=======================================================================\n          CALL  FOR  PAPERS and CALL FOR WORKSHOPS/SESSIONS\n\n              Paper Submission Deadline: March 31, 2015\n\n        The 2015 International Conference on Image Processing,\n          Computer Vision, and Pattern Recognition (IPCV'15)\n\n         July 27-30, 2015, Monte Carlo Resort, Las Vegas, USA\nhttp://www.worldacademyofscience.org/worldcomp15/ws/conferences/ipcv15\n=======================================================================\n\nYou are invited to submit a paper for consideration. All accepted papers\nwill be published in printed conference books/proceedings (ISBN) and will\nalso be made available online. The proceedings will be indexed in science\ncitation databases that track citation frequency/data. In addition, like\nprior years, extended versions of selected papers (about 35%) of the\nconference will appear in journals and edited research books (publishers\ninclude: Springer, Elsevier, BMC, and others; a list that includes a\nsmall subset of such books and journal special issues appear in this\ndocument); some of these books and journal special issues have already\nreceived the top 25% downloads in their respective fields. The titles of\nproceedings of the federated congress (that this conference is part of)\nhave been indexed into the ACM Digital Library ( http://dl.acm.org/ )\nwhich includes bibliographic citations from major publishers in computing.\n\nThe conference is composed of a number of tracks, tutorials, sessions,\nworkshops, poster and panel discussions; all will be held simultaneously,\nsame location and dates: July 27-30, 2015.\n\nSCOPE: Topics of interest include, but are not limited to, the following:\n\n    Prologue: The broad area of Imaging Science is a field that is\n    mainly concerned with the generation, collection, analysis,\n    modification, and visualization of images. The field is multidisciplinary\n    in that it includes topics that are traditionally covered in computer\n    science, physics, mathematics, electrical engineering, AI, psychology\n    and information theory where computer science acts as the topical\n    bridge between all such diverse areas (for a formal definition of\n    Imaging Science, refer to relevant wiki pages.) From the computer\n    science perspective, the core of Imaging Science includes the following\n    three intertwined computer science fields, namely: Image Processing,\n    Computer Vision, and Pattern Recognition. This conference will cover\n    the research trends in these three important areas. The list of topics\n    of interest that appears below is not meant to be exhaustive.\n\no  IMAGE PROCESSING:\n   (Addresses ow-level processing as well as imaging fundamentals.)\n   - Software Tools for Imaging\n   - Image Generation, Acquisition, and Processing\n   - Image-based Modeling and Algorithms\n   - Mathematical Morphology\n   - Image Geometry and Multi-view Geometry\n   - 3D Imaging\n   - Novel Noise Reduction Algorithms\n   - Image Restoration\n   - Enhancement Techniques\n   - Segmentation Techniques\n   - Motion and Tracking Algorithms and Applications\n   - Watermarking Methods and Protection + Wavelet Methods\n   - Image Data Structures and Databases\n   - Image Compression, Coding, and Encryption\n   - Video Analysis\n   - Multi-resolution Imaging Techniques\n   - Performance Analysis and Evaluation\n   - Multimedia Systems and Applications\n   - Novel Image Processing Applications\n\no  COMPUTER VISION:\n   (Addresses mid- to high-level processing as well as vision\n   fundamentals.)\n   - Camera Networks and Vision\n   - Sensors and Early Vision\n   - Machine Learning Technologies for Vision\n   - Image Feature Extraction\n   - Cognitive and Biologically Inspired Vision\n   - Object Recognition\n   - Soft Computing Methods in Image Processing and Vision\n   - Stereo Vision\n   - Active and Robot Vision\n   - Face and Gesture Recognition\n   - Fuzzy and Neural Techniques in Vision\n   - Medical Image Processing and Analysis\n   - Novel Document Image Understanding Techniques\n   - Special-purpose Machine Architectures for Vision\n   - Biometric Authentication\n   - Novel Vision Application and Case Studies\n\no  PATTERN RECOGNITION:\n   (Addresses pattern recognition algorithms and methodologies\n   that are of value to the image processing and computer vision\n   research communities.)\n   - Supervised and Un-supervised Classification Algorithms\n   - Clustering Techniques\n   - Dimensionality Reduction Methods in Pattern Recognition\n   - Symbolic Learning\n   - Ensemble Learning Algorithms\n   - Parsing Algorithms\n   - Bayesian Methods in Pattern Recognition and Matching\n   - Statistical Pattern Recognition\n   - Invariance in Pattern Recognition\n   - Knowledge-based Recognition\n   - Structural and Syntactic Pattern Recognition\n   - Applications Including: Security, Medicine, Robotic, GIS,\n     Remote Sensing, Industrial Inspection, Nondestructive\n     Evaluation (or NDE), ...\n   - Case studies and Emerging technologies\n\nIMPORTANT DATES:\n\nJanuary 30, 2015:  Workshop / Session Proposals\nMarch 31, 2015:    Submission of full papers (about 7 pages)\nApril 24, 2015:    Notification of acceptance (+/- two days)\nMay 15, 2015:      Final papers + Copyright + Registration\nJuly 27-30, 2015:  The 2015 International Conference on Image Processing,\n                   Computer Vision, and Pattern Recognition (IPCV'15)\n\n\nSUBMISSION OF DRAFT PAPERS FOR EVALUATION:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by the due date (see IMPORTANT DATES) and must be in either\nMS doc or pdf formats (about 7 pages including all figures, tables, and\nreferences.) All reasonable typesetting formats are acceptable (later,\nthe authors of accepted papers will be asked to follow a particular\ntypesetting format to prepare their final papers for publication; these\nformatting instructions appear at: http://world-comp.org and they\nconform to the two-column IEEE style format). Papers must not have been\npreviously published or currently submitted for publication elsewhere.\nThe first page of the paper should include: title of the paper, name,\naffiliation, postal address, and email address for each author as well\nas a maximum of 5 topical keywords that would best represent the content\nof the paper. The first page should also identify the name of the\nContact/Corresponding author together with his/her professional email\naddress. A 100 to 150-word abstract should appear on the first page.\nAuthors are to conform to the common CODE OF ETHICS FOR AUTHORS (The\ndocument for the Code of Ethics is available on the submission web site.)\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Essay/philosophical\npapers will not be refereed but may be considered for discussion/panels).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The printed proceedings/books will\nbe available for distribution on site at the conference. The proceedings\nwill be indexed in science citation databases that track citation\nfrequency/data. The proceedings/books of the federated congress that\nthis conference is part of have been evaluated for inclusion into major\nscience citation index databases. We are happy to report that so far,\nthe evaluation board of science citation index databases have approved\nthe indexing, integrating, and inclusion of the following conference\ntracks into relevant indexing databases (indexing databases include,\namong others: Scopus, Engineering Village, EMBASE, and others):\nBIOCOMP, DMIN, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA, and SAM. All\nproceedings are also approved for inclusion into EBSCO (www.ebsco.com),\none of the largest subject index systems. The titles of proceedings of the\nfederated congress have been indexed into the ACM Digital Library\n( http://dl.acm.org/ ) which includes bibliographic citations from major\npublishers in computing.\n\nIn addition to the above, we have arranged two new book series (multiple\nbooks in each series); one with Elsevier publishers (Emerging Trends in\nComputer Science and Applied Computing) and another with Springer\npublishers (Transactions of Computational Science and Computational\nIntelligence). After the conference (the process may take 12 to 18\nmonths), a significant number of authors of accepted papers of our\ncongress, will be given the opportunity to submit the extended version\nof their papers for publication consideration in these books. We\nanticipate having between 10 and 20 books a year in each of these\nbook series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes:\nScopus, www.info.scopus.com; SCI Compendex, Engineering Village,\nwww.ei.org; EMBASE, www.info.embase.com; and others). For a recent and\na very small subset of the books (and journal special issues) that have\nbeen published based on the extended versions of our congress papers,\nsee below:\n\nhttp://www.worldacademyofscience.org/worldcomp15/ws/books_journals \n\nO. Elsevier/MK: Emerging Trends in Image Processing, Computer Vision and\n   Pattern Recognition.\n\nO. Springer: Software Tools and Algorithms for Biological Systems. Series:\n   Advances in Experimental Medicine and Biology, Vol 696.\n\nO. BMC Bioinformatics: Special Journal Issue (Vol 15, Supp. 17);\n   Impact Factor: 2.67.\n\nO. Springer: Advances in Computational Biology. Series: Advances in\n   Experimental Medicine and Biology, Vol 680.\n\nO. BMC Systems Biology: Special Journal Issue \"Bioinformatics and\n   Computational Biology\", (Vol. 5, Supp. 3); Impact Factor: 2.85.\n\nO. Springer: Book: Resilient Computer System Design (April 2015)\n\nO. Elsevier/MK: Emerging Trends in ICT Security (Information and\n   Communications Technology).\n\nO. BMC Medical Genomics: Special Journal Issue \"Bioinformatics and\n   Computational Biology\", (Vol. 6, Supp. 1); Impact Factor: 3.91.\n\nO. Springer: Transactions on Computational Science and Computational\n   Intelligence (multiple books).\n\nO. Sringer: Book: Real World Data Mining Applications (418 pages, 2015)\n\nO. BMC Genomics: Special Journal Issue \"Bioinformatics and Computational\n   Biology\", (Vol. 9, Supp. 1); Impact Factor: 4.04.\n\nO. Elsevier/MK: Emerging Trends in Computer Science and Applied Computing\n   (multiple books.)\n\nO. BMC Genomics: Special Journal Issue \"Advances in Big Data Analytics\",\n   (Vol. 15, Supp. 11); Impact Factor: 4.04.\n\nO. Elsevier/MK: Emerging Trends in Computational Biology, Bioinformatics,\n   and Systems Biology Publisher.\n\nSome of these books and journal special issues have already received\nthe top 25% downloads in their respective fields - we already have a\nnumber of Elsevier and Springer books in the pipeline.\n\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear in section SUBMISSION OF DRAFT PAPERS FOR\nEVALUATION - except that the submission is limited to 2 pages. On the\nfirst page, the author should state that \"This paper is being submitted\nas a poster\". Poster papers (if accepted) will be published as such, if\nand only if the author of the accepted poster wishes to do so.\n\n\nPROPOSAL FOR ORGANIZING WORKSHOPS/SESSIONS:\n\nThe conference is composed of a number of tracks. A track is a session,\na workshop, or a symposium. A session will have at least 6 papers; a\nworkshop at least 12 papers; and a symposium at least 18 papers. Track\nchairs will be responsible for all aspects of their tracks, including:\nsoliciting papers, reviewing, selecting, ... The names of track chairs\nwill appear as Associate Editors in the conference proceedings and on\nthe cover of the printed books (and would be indexed in science databases\nas such). Track chairs who attract a sufficient number of solid papers\ncan propose to edit books with a major publisher based on the extended\nversions of the papers accepted in their tracks (the conference will\nfacilitate and help such track chairs to get the publisher's approval).\n\nProposals to organize tracks (sessions, workshops, or symposiums) should\ninclude the following information: name and address (+ email) of proposer,\nhis/her biography, title of track, a 100-word description of the topic of\nthe track (also mention the name of this conference), and a short\ndescription on how the track will be advertised (in most cases, track\nproposers solicit papers from colleagues and researchers whose work is\nknown to the track proposer). E-mail your track proposal to\neditor@world-comp.org . We would like to receive the track proposals\nas soon as possible (see IMPORTANT DATES.)\n\n\nCO-SPONSORS:\n\nCurrently being prepared - The Academic Sponsors of the last offerings of\nthe congress included research labs and centers affiliated with major\ngovernment agencies, universities, and institutions from all continents.\nSponsors At-Large included (corporate, associations, organizations):\nIntel Corporation; Super Micro Computer, Inc., California, USA; Microsoft\nResearch; The International Council on Medical and Care Compunetics;\nInternational Society of Intelligent Biological Medicine; Chapter of\nAssociations from five countries; US Chapter of World Academy of Science;\nHigh Performance Computing for Nanotechnology; World Academy of Biomedical\nSciences and Technologies (UK); HoIP Telecom (UK); Hodges Health; OMG;\nAldebaran Robotics Inc.; Federated Council on Science and Education;\nScience Publications and many others.\n\n\nMEMBERS OF PROGRAM AND ORGANIZING COMMITTEES:\n\nCurrently being finalized. The members of the Steering Committee of the\nfederated congress that this conference is part of included:\nDr. Selim Aissi, (formerly: Chief Strategist - Security, Intel Corporation,\nUSA) Vice President, Global Information Security, Visa Inc., USA;\nProf. Nizar Al-Holou, Professor and Department Chair, and Vice Chair of\nIEEE/SEM-Computer Chapter, University of Detroit Mercy, Detroit, Michigan,\nUSA; Prof. Hamid R. Arabnia, Professor of Computer Science, Elected Fellow\nof ISIBM, Editor-in-Chief of Journal of Supercomputing (Springer),\nUniversity of Georgia, USA; Prof. Mary Mehrnoosh Eshaghian-Wilner,\nProfessor of Engineering Practice, University of Southern California,\nUSA (and Adjunct Professor, University of California Los Angeles, UCLA,\nUSA); Prof. Shiuh-Jeng Wang, Department of Information Management, Central\nPolice University, Taiwan and Program Chair, Security & Forensics, Taiwan\nand Director, Information Crypto and Construction Lab (ICCL) & ICCL-FROG;\nProf. Michael Panayiotis Bekakos, Professor of Computer Systems and\nDirector of Laboratory of Digital Systems and Head of Parallel Algorithms\nand architectures Research Group, Democritus University of Thrace, Greece;\nProf. Kevin Daimi, Professor of Computer Science and Director of Computer\nScience and Software Engineering Programs, University of Detroit Mercy,\nDetroit, Michigan, USA; Prof. Patrick S. P. Wang, Fellow of IAPR, ISIBM,\nWASE and Professor of Computer and Information Science, Northeastern\nUniversity, Boston, Massachusetts, USA and Otto-von-Guericke Distinguished\nGuest Professor, University Magdeburg, Germany; Prof. George Jandieri,\nGeorgian Technical University, Tbilisi, Georgia and Chief Scientist at\nThe Institute of Cybernetics, Georgian Academy of Science, Georgia;\nProf. D. V. Kodavade, Head of Computer Science and Engineering, DKTE\nInstitute, India; Prof. George Markowsky, Professor and Associate Director,\nSchool of Computing and Information Science, Chair Int'l Advisory Board\nof IEEE IDAACS, Director 2013 Northeast Collegiate Cyber Defense\nCompetition, University of Maine, Orono, Maine, USA; Prof. G. N. Pandey,\nVice-Chancellor, Arunachal University of Studies, India (and Adjunct\nProfessor, Indian Institute of Information Technology, India);\nProf. James J. (Jong Hyuk) Park, Professor of Computer Science and\nEngineering, Seoul, Korea and President of KITCS, President of FTRA,\nEditor-in-Chief of HCIS, JoC and IJITCC Journals; Prof. Fernando G.\nTinetti, Universidad Nacional de La Plata, Argentina, Co-editor, Journal\nof CS and Technology (JCS&T); Dr. Predrag Tosic, Microsoft, Washington,\nUSA; Prof. Vladimir Volkov, The Bonch-Bruevich State University of\nTelecommunications, Saint-Petersburg, Russia; Dr. Michael R. Grimaila,\nAir Force Institute of Technology, Fellow of ISSA, CISM, CISSP, IAM/IEM,\nAir Force Center of Cyberspace Research, Advisor to the Prince of Wales\nFellows & Prince Edward Fellows at MIT and Harvard Universities and PC\nmember of NATO Cooperative Cyber Defence Centre of Excellence (CCD COE);\nProf. Victor Malyshkin, Head of Supercomputer Software Department,\nRussian Academy of Sciences, Russia; Prof. Andy Marsh, Director of HoIP,\nDirector of HoIP Telecom, UK, and Secretary-General of WABT and\nVice-president of ICET, Visiting Professor, University of Westminster,\nUK; Ashu M. G. Solo, Fellow of British Computer Society, Principal R&D\nEngineer, Maverick Technologies America; Prof. Sang C. Suh, Head and\nProfessor of Computer Science, Vice President, of Society for Design\nand Process Science (SDPS), Director of Intelligent Cyberspace\nEngineering (ICEL), Texas A&M University, Com., Texas, USA; Prof. Layne\nT. Watson, IEEE Fellow, NIA Fellow, ISIBM Fellow, Fellow of The National\nInstitute of Aerospace, Virginia Polytechnic Institute & State University,\nVirginia, USA; Prof. Mary Q. Yang, Director, Mid-South Bioinformatics\nCenter and Joint Bioinformatics Ph.D. Program, University of Arkansas,\nUSA; Prof. Byung-Gyu Kim, Multimedia Processing Communications Lab.(MPCL),\nSunMoon University, South Korea; Prof. Young-Sik Jeong, Editor-in-Chief\nof Journal of Information Processing Systems (JIPS), Dongguk University,\nSeoul, South Korea; and others.\n\nThe 2015 Program Committee for individual conferences are currently being\ncompiled. Many who have already joined the committees are renowned leaders,\nscholars, researchers, scientists and practitioners of the highest ranks;\nmany are directors of research labs., fellows of various societies, heads/\nchairs of departments, program directors of research funding agencies, as\nwell as deans and provosts.\n\nProgram Committee members are expected to have established a strong and\ndocumented research track record. Those interested in joining the Program\nCommittee should email editor@world-comp.org  the following information\nfor consideration: Name, affiliation and position, complete mailing address,\nemail address, a one-page biography that includes research expertise & the\nname of this conference.\n\n\nGENERAL INFORMATION:\n\nThe federated Congress ( http://www.world-academy-of-science.org/ ) that\nthis conference is part of is composed of research presentations, keynote\nlectures, invited presentations, tutorials, panel discussions, and poster\npresentations. In recent past, keynote/tutorial/panel speakers have included:\nProf. David A. Patterson (pioneer, architecture, U. of California,\nBerkeley), Dr. K. Eric Drexler (known as Father of Nanotechnology),\nProf. John H. Holland (known as Father of Genetic Algorithms; U. of\nMichigan), Prof. Ian Foster (known as Father of Grid Computing; U. of\nChicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U. of California,\nBerkeley), Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT),\nDr. Jim Gettys (known as X-man, developer of X Window System, xhost;\nOLPC), Prof. John Koza (known as Father of Genetic Programming, Stanford\nU.), Prof. Brian D. Athey (NIH Program Director, U. of Michigan),\nProf. Viktor K. Prasanna (pioneer, U. of Southern California), Dr. Jose\nL. Munoz (NSF Program Director and Consultant), Prof. Jun Liu (pioneer,\nBroad Institute of MIT & Harvard U.), Prof. Lotfi A. Zadeh (Father of\nFuzzy Logic), Dr. Firouz Naderi (Head, NASA Mars Exploration Program/\n2000-2005 and Associate Director, Project Formulation & Strategy, Jet\nPropulsion Lab, CalTech/NASA; Director, NASA's JPL Solar System\nExploration), Prof. David Lorge Parnas (Fellow of IEEE, ACM, RSC, CAE, GI;\nDr.h.c.: ETH Zurich, Prof. Emeritus, McMaster U. and U. of Limerick),\nProf. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue\nUniversity), Dr. Sandeep Chatterjee (Vice President & Chief Technology\nOfficer, SourceTrace Systems, Inc.), Prof. Haym Hirsh (Dean, Cornell\nUniversity - formerly at Rutgers University, New Jersey, USA and former\ndirector of Division of Information and Intelligent Systems, National\nScience Foundation, USA), Dr. Flavio Villanustre (Vice-President, HPCC\nSystems), Prof. Victor Raskin (Distinguished Professor, Purdue University,\nUSA); Prof. Alfred Inselberg (School of Mathematical Sciences, Tel Aviv\nUniversity, Israel; Senior Fellow, San Diego Supercomputing Center;\nInventor of the multidimensional system of Parallel Coordinates and\nauthor of textbook); Prof. H. J. Siegel (Abell Endowed Chair Distinguished\nProfessor of ECE and Professor of CS; Director, CSU Information Science\nand Technology Center (ISTeC), Colorado State University, Colorado, USA);\nProf. Amit Sheth (Fellow of IEEE and LexisNexis Eminent Scholar;\nFounder/Executive Director, Ohio Center of Excellence in Knowledge-enabled\nComputing (Kno.e.sis) and Professor of Computer Science, Wright State\nUniversity, Ohio, USA); Dr. Leonid I. Perlovsky (Harvard University,\nCambridge, Massachusetts, USA and School of Engineering and Applied\nSciences and Medical School Athinoula Martinos Brain Imaging Center; and\nThe US Air Force Research Lab., USA; CEO, LP Information Technology, USA\nand Chair of IEEE Task Force on The Mind and Brain; Recipient of John\nMcLucas Award, the highest US Air Force Award for basic research);\nand many other distinguished speakers. The Congress is among the top five\nlargest annual gathering of researchers in computer science, computer\nengineering and applied computing. We anticipate to have attendees from\nabout 85 countries/territories. To get a feeling about the conferences'\natmosphere, see some delegates photos available at:\n\nhttp://worldcomp.phanfare.com/\nhttp://worldcomp.phanfare.com/6626396 (to see a slide show, click on\n\"Start SlideShow\" tab at the url above.)\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of computer\nscience, computer engineering, and applied computing. The Congress also\nencourages multi-disciplinary and inter-disciplinary research initiatives;\ni.e., facilitating increased opportunities for cross-fertilization across\nsub-disciplines. 138939\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of December 8, 2014, proceedings of the federated congress that this\nconference is part of, have received over 27,878 citations (includes 3,346\nself-citations). Citation data is obtained from Microsoft Academic Search.\nThe citation data does not even include more than 15,000 other citations\nto papers published by conferences whose first offerings were initiated\nby the congress. Individual proceedings/books (2013 & 2014) of the\nfederated congress can be purchased from major science book distributors:\n(such as: EBSCO and others):\nhttp://www.worldacademyofscience.org/worldcomp14/ws/proceedings\nhttp://www.worldacademyofscience.org/worldcomp13/ws/proceedings\n\nMISCELLANEOUS:\nThe information that appears in this announcement is correct as of\nDecember 8, 2014.\n\nCONTACT:\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n", "name": "International Conference on Image Processing, Computer Vision, and Pattern Recognition", "location": "Las Vegas, USA", "submission_date": "March 31, 2015", "notification_date": "April 24, 2015", "conference_date": "July 27-30, 2015"}, {"description": "Content-Transfer-Encoding: 8bit\n\nThe International Conference on Computing, Networking and Digital Technologies(ICCNDT 2012)\n                             Gulf University, Bahrain\n                                                Nov. 11-13, 2012\n                                          http://www.sdiwc.info/bh\n========================================================================\nThe proposed conference on the above theme will be held at  Gulf University, Bahrain, From Nov. 11-13, 2012 which aims to enable researchers build connections between different digital applications.\n\nThe conference welcomes papers on the following (but not limited to) research topics:\n\n- Software Specification\n- Software Assurance\n- Social Search\n- Software Process Modeling\n- Software Reuse\n- Cloud Computing\n- Grid Computing\n- Green Computing\n- Information and Data Management\n- Telecommunications \n- Communication protocols \n- Security and Access Control\n- Transmission Techniques \n- Communication Systems \n- Network Systems and Devices \n- Information Content Security\n- Network Modeling and Simulation \n- Network Management Techniques \n- Reengineering And Reverse Engineering\n- Trust Models for Social Networks \n- Data and Network Mining\n- Computational Intelligence\n- Biometrics Technologies\n- Biometrics and Ethics\n- Distributed AI Systems\n- Internet Modeling\n- Digital Image Processing\n- XML-Based Languagess\n- Web Services Security\n- Mobile Social Networks\n- Software Design, Software Testing\n- Multimedia Data Base \n- Information Retrieval \n- Digital Rights Management \n- Compression and Coding \n- Analysis and Processing \n- Computer Graphics \n- Data mining \n- Soft Computing \n- Web based applications \n- Fuzzy and Neural Network Systems\n- Forensics, Recognition Technologies and Applications\n- Signal Processing, Pattern Recognition and Applications\n- Intelligent Agent-Based Systems, Cognitive and Reactive Distributed AI Systems\n- User Interfaces,Visualization and Modeling\n- Management and Diffusion of Multimedia Applications\n- Mobile, Ad Hoc and Sensor Network Management\n- Web Services Architecture, Modeling and Design\n- New Architectures for Web-Based Social Networks\n- Semantic Web, Ontologies (Creation , Merging, Linking, Reconciliation)\n- Quality of Service, Scalability and Performance\n- Self-Organizing Networks and Networked Systems\n- Algorithms, Architecture, and Infrastructures\n- Wireless Networks, Ad-Hoc and Sensor Networks\n\n\nResearchers are encouraged to submit their work electronically. All papers will be fully refereed by a minimum of two specialized referees. Before final acceptance, all referees comments must be considered.\n\nImportant Dates\n==============\n\nSubmission Date              : Sep. 25, 2012 \nNotification of acceptance   : Oct. 10, 2012        \nCamera Ready submission      : Oct. 25, 2012    \nRegistration                 : Oct. 20, 2012    \nConference dates             : Nov. 11-13, 2012  \n    \n\n\n----------------------------------------\n\nIf you want to unsubscribe to this mail message from SDIWC, just follow this link http://sdiwc.us/Filemailer2/sdiwc-mailer/unsubscribe.php?id=d67fac30874ed23b1c8bf6f96d9f2cb5\n\n", "name": "The International Conference on Computing, Networking and Digital Technologies", "location": "Gulf University, Bahrain", "submission_date": "Sep. 25, 2012", "notification_date": "Oct. 10, 2012", "conference_date": "Nov. 11-13, 2012"}, {"description": "\nThe Second International Conference on Digital Enterprise and Information\nSystems (DEIS 2013)\nAsia Pacific University of Technology and Innovation (APU), Kuala Lumpur,\nMalaysia\n                                        March 4-6, 2013\n                         http://sdiwc.net/conferences/2013/Malaysia1/\n========================================================================\n\nThe proposed conference on the above theme will be held at Asia Pacific\nUniversity of Technology and Innovation (APU), Kuala Lumpur, Malaysia, From\nMarch 4-6, 2013 which aims to enable researchers build connections between\ndifferent digital applications.\n\nThe conference welcomes papers on the following (but not limited to)\nresearch topics:\n\n- Information Ethics\n- Information Content Security\n- Data Compression\n- E-Technology\n- E-Government\n- E-Learning\n- Cloud Computing\n- Grid Computing\n- Green Computing\n- Access Controls\n- Data Mining\n- Social Search\n- Computer Forensics\n- Computer Security\n- Peer-to-Peer Social Networks\n- Information and Data Management\n- Peer-to-Peer Networks\n- Network Security\n- Social Networks\n- Real-Time Systems\n- Internet Modeling\n- Assurance of Service\n- Image Processing\n- Web Services Security\n- Multimedia Computing\n- Software Engineeing\n- Biometrics Technologies\n- Wireless Communications\n- Semantic Web, Ontologies\n- Mobile Social Networks\n- Anti cyberterrorism\n- XML-Based Languages\n- Soft Computing Techniques\n- Computational Intelligence\n- Mobile Networking, Mobility and Nomadicity\n- Ubiquitous Computing, Services and Applications\n- Forensics, Recognition Technologies and Applications\n- Fuzzy and Neural Network Systems\n- Signal Processing, Pattern Recognition and Applications\n- Distributed and Parallel Applications\n- User Interfaces,Visualization and Modeling\n- Mobile, Ad Hoc and Sensor Network Management\n- Web Services Architecture, Modeling and Design\n- Quality of Service, Scalability and Performance\n- Self-Organizing Networks and Networked Systems\n- Data Management in Mobile\n- Data Stream Processing in Mobile/Sensor Networks\n- Indexing and Query Processing for Moving Objects\n- User Interfaces and Usability Issues form Mobile Applications\n- Sensor Networks and Social Sensing\n- Embedded Systems and Software\n- Information Propagation on Social Networks\n- Resource and Knowledge Discovery Using Social Networks\n- Computer Crime Prevention and Detection\n- Confidentiality Protection\n- Critical Infrastructure Management\n- Critical Computing and Storage\n- Cryptography and Data Protection\n\n\nResearchers are encouraged to submit their work electronically. All papers\nwill be fully refereed by a minimum of two specialized referees. Before\nfinal acceptance, all referees comments must be considered.\n\n\nImportant Dates\n==============\n\nSubmission Date           : Dec. 15, 2012\nNotification of acceptance: Jan. 1, 2013\nCamera Ready submission   : Jan. 20, 2013\nRegistration              : Jan. 20, 2013\nConference dates          : March 4-6, 2013\n", "name": "The Second International Conference on Digital Enterprise and Information Systems", "location": "Kuala Lumpur, Malaysia", "submission_date": "Dec. 15, 2012", "notification_date": "Jan. 1, 2013", "conference_date": "March 4-6, 2013"}, {"description": "Received: from przmmt01.its.calpoly.edu (LHLO przmmt01.its.calpoly.edu)\n (129.65.64.27) by przmms01.its.calpoly.edu with LMTP;\n Sat, 13 Apr 2013 15:58:22 -0700 (PDT)\n [129.65.64.9]) by przmmt01.its.calpoly.edu (Postfix) with ESMTPS\n id 2F7109D027D for ;\n Sat, 13 Apr 2013 15:58:22 -0700 (PDT)\nX-IronPort-Anti-Spam-Result: AtsBAGHiaVHRO9o1nGdsb2JhbABGCg6DLsFNgQUWDgEBAQEBCAsJCRQogkMdDx8DAjkPGho6JxQCAwGHegyaDJgLiEaNSgsGBAiBCoNuA5M4hG6KV4Zud1sggS4BCBc\nX-Originating-IP-Address: 209.59.218.53\n with ESMTP; 13 Apr 2013 15:58:21 -0700\n (Postfix) with ESMTP id 4E78234AA81E for ;\n Sat, 13 Apr 2013 18:58:19 -0400 (EDT)\n id r3DMwJa3030598 for foaad@calpoly.edu;\n Sat, 13 Apr 2013 18:58:19 -0400\nMessage-ID: \nTo: \n Village, ... The 2013 World Congress in Computer Science, Computer\n Engineering, & Applied Computing (July 22-25, 2013, Las Vegas,\n USA) - Extended Paper submission deadline: April 20, 2013\nUser-Agent: Heirloom mailx 12.4 7/29/08\nContent-Transfer-Encoding: 7bit\n\n\n                         CALL  FOR  PAPERS\n\n          EXTENDED Paper Submission Deadline: April 20, 2013\n\n        Indexing: Scopus, SCI Compendex, Engineering Village, ...\n\n             The 2013 World Congress in Computer Science,\n             Computer Engineering, and Applied Computing\n                  July 22-25, 2013, Las Vegas, USA\n                           WORLDCOMP'13\n\n             http://www.world-academy-of-science.org/\n\nINDEXING:\nThe proceedings/books of this congress have been evaluated for inclusion\ninto science citation index / SCI databases. We are happy to report that\nso far, the evaluation board of science citation index databases have\nAPPROVED the indexing, integrating, and inclusion of the following\nconference tracks into relevant Elsevier indexing databases (Elsevier\nindexing databases include, among others: Scopus, www.info.scopus.com;\nSCI Compendex, Engineering Village, www.ei.org; EMBASE, www.info.embase.com;\nand others): BIOCOMP, DMIN, ERSA, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA,\nand SAM; please see below for the full name of each of these conferences.\nIn addition, all proceedings will be indexed by a number of other science\ncitation databases that track citation frequency/data for each paper.\n\n\nINVITATION:\nYou are invited to submit a full paper for consideration. All accepted\npapers will be published in printed conference books/proceedings (ISBN)\nand will also be made available online. The proceedings will be indexed\nin science citation databases that track citation frequency/data for\neach paper. Like prior years, extended versions of selected papers\n(about 35%) will appear in journals and edited research books (publishers\ninclude: Springer, Elsevier, BMC, and others). See the following links\nfor a small subset of the publications based on this Congress:\nhttp://www.biomedcentral.com/bmcmedgenomics/supplements/6/S1\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-7045-9\nhttp://www.springer.com/life+sciences/bioinformatics/book/978-1-4419-5912-6\nhttp://www.biomedcentral.com/1471-2164/9/S1/I1\nhttp://www.biomedcentral.com/1752-0509/5?issue=S3\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC3287490/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2709251/\nhttp://pubmedcentralcanada.ca/pmcc/articles/PMC2999338/\n\nIn addition to the above, we have arranged two new book series; one with\nElsevier publishers (Transactions on Computer Science and Applied Computing)\nand another with Springer publishers (Transactions of Computational Science\nand Computational Intelligence). After the conference, a significant number\nof authors of accepted papers of our congress, will be given the opportunity\nto submit the extended version of their papers for publication consideration\nin these books. The web sites for the two book series will be made available\nafter the logistics are finalized between our committee and the publishers\n(both book series projects have been approved.) We anticipate having between\n10 to 20 books a year in each of these book series projects. Each book in\neach series will be subject to Elsevier and Springer science indexing\nproducts (which includes: Scopus, Ei village, SCI, ...). 138939\n\nThe Congress is composed of a number of tracks (joint-conferences,\ntutorials, sessions, workshops, poster and panel discussions); all will\nbe held simultaneously, same location and dates: July 22-25, 2013. All\ntutorials are free to registered conference attendees - for a partial list\nof approved tutorials, see:\nhttp://www.worldacademyofscience.org/worldcomp13/ws/tutorials \nFor the complete list of joint conferences, see below.\n\n\nIMPORTANT DATES - EXTENDED:\n\nApril 20, 2013:    Submission of full/regular papers (about 7 pages)\nMay 11, 2013:      Notification of acceptance (+/- two days)*\nMay 25, 2013:      Final papers + Copyright + Registration\nJuly 22-25, 2013:  The 2013 World Congress in Computer Science, Computer\n                   Engineering, and Applied Computing\n                   (including all its affiliated joint-conferences).\n\n*Authors who submitted their papers early, will receive their papers'\nstatus report (notification) much sooner than May 11, 2013.\n\n\nMEASURABLE SCIENTIFIC IMPACT OF CONGRESS:\n\nAs of March 14, 2013, papers published in the conference proceedings that\nare currently being held as part of this congress, have received 27,591\ncitations (includes 3,342 self-citations). Citation data obtained from\nhttp://academic.research.microsoft.com/ .\n\n\nSUBMISSION OF REGULAR PAPERS:\n\nProspective authors are invited to submit their papers by uploading them\nto the evaluation web site at:  http://world-comp.org . Submissions must\nbe uploaded by April 20, 2013 and must be in either MS doc or pdf\nformats (about 7 pages including all figures, tables, and references -\nsingle space, font size of 10 to 12). All reasonable typesetting formats\nare acceptable (later, the authors of accepted papers will be asked to\nfollow a particular typesetting format to prepare their final papers for\npublication.) Papers must not have been previously published or currently\nsubmitted for publication elsewhere. The first page of the paper should\ninclude: title of the paper, name, affiliation, postal address, and email\naddress for each author. The first page should also identify the name of\nthe Contact Author and a maximum of 5 topical keywords that would best\nrepresent the content of the paper. The name of the conference that the\npaper is being submitted for consideration must also be stated on the\nfirst page of the paper as well as a 100 to 150-word abstract. The length\nof the final/Camera-Ready papers (if accepted) will be limited to 7\n(two-column IEEE style) pages.\n\nEach paper will be peer-reviewed by two experts in the field for\noriginality, significance, clarity, impact, and soundness. In cases of\ncontradictory recommendations, a member of the conference program\ncommittee would be charged to make the final decision (accept/reject);\noften, this would involve seeking help from additional referees. Papers\nwhose authors include a member of the conference program committee will\nbe evaluated using the double-blinded review process. (Papers deemed\nto be philosophical, essay type, or about controversial topics/applications\nwill not be refereed but may be considered for discussion/panels/presentation).\n\nThe proceedings will be published in printed conference books (ISBN) and\nwill also be made available online. The proceedings will be indexed in\nscience citation databases that track citation frequency/data for each\npublished paper. Science citation databases include: Inspec / IET / The\nInstitute for Engineering & Technology; The French National Center for\nScientific Research, CNRS, INIST databases, PASCAL (accessable from INIST,\nDatastar, Dialog, EBSCO, OVID, Questel.Orbit, Qwam, & STN International);\nand others. The proceedings/books of this congress have been evaluated for\ninclusion into major science citation index databases. We are happy to report\nthat so far, the evaluation board of science citation index databases have\nAPPROVED the indexing, integrating, and inclusion of the following\nconference tracks into relevant Elsevier indexing databases (Elsevier\nindexing databases include, among others: Scopus, www.info.scopus.com;\nSCI Compendex, Engineering Village, www.ei.org; EMBASE, www.info.embase.com;\nand others): BIOCOMP, DMIN, ERSA, GCA, ICAI, ICOMP, ICWN, IKE, IPCV, PDPTA,\nand SAM; please see above for the full name of each of these conferences.\n\nIn addition to the above, we have arranged two new book series; one with\nElsevier publishers (Transactions on Computer Science and Applied Computing)\nand another with Springer publishers (Transactions of Computational Science\nand Computational Intelligence). After the conference, a significant number\nof authors of accepted papers of our congress, will be given the opportunity\nto submit the extended version of their papers for publication consideration\nin these books. We anticipate having between 10 to 20 books a year in each\nof these book series projects. Each book in each series will be subject to\nElsevier and Springer science indexing products (which includes: Scopus,\nwww.info.scopus.com; SCI Compendex, Engineering Village, www.ei.org; EMBASE,\nwww.info.embase.com; and others).\n\nSUBMISSION OF POSTER PAPERS:\n\nPoster papers can be 2 pages long. Authors are to follow the same\ninstructions that appear above (see, SUBMISSION OF REGULAR PAPERS) except\nfor the submission is limited to 2 pages. On the first page, the author\nshould state that \"This paper is being submitted as a poster\". Poster\npapers (if accepted) will be published if and only the author of the\naccepted paper wishes to do so.\n\n\nLIST OF CONFERENCES (alphabetical order based on conference acronym)\n\no BIOCOMP'13:\n  The 14th International Conference on Bioinformatics & Computational\n  Biology\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/biocomp13\n\no CDES'13:\n  The 13th International Conference on Computer Design\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/cdes13\n\no CGVR'13:\n  The 17th International Conference on Computer Graphics & Virtual\n  Reality\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/cgvr13\n\no CSC'13:\n  The 10th International Conference on Scientific Computing\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/csc13\n\no EEE'13:\n  The 12th International Conference on e-Learning, e-Business,\n  Enterprise Information Systems, and e-Government\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/eee13\n\no ERSA'13:\n  The 13th International Conference on Engineering of Reconfigurable\n  Systems and Algorithms\n  http://ersaconf.org/ersa-news/\n\no ESA'13:\n  The 11th International Conference on Embedded Systems and\n  Applications\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/esa13\n\no FCS'13:\n  The 9th International Conference on Foundations of Computer Science\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/fcs13\n\no FECS'13:\n  The 9th International Conference on Frontiers in Education: Computer\n  Science and Computer Engineering\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/fecs13\n\no GCA'13:\n  The 9th International Conference on Grid & Cloud Computing and\n  Applications\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/gca13\n\no GEM'13:\n  The 10th International Conference on Genetic & Evolutionary Methods\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/gem13\n\no ICAI'13:\n  The 15th International Conference on Artificial Intelligence\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/icai13\n\no ICOMP'13:\n  The 14th International Conference on Internet Computing and Big Data\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/icomp13\n\no ICWN'13:\n  The 12th International Conference on Wireless Networks\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/icwn13\n\no IKE'13:\n  The 12th International Conference on Information & Knowledge Engineering\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/ike13\n\no IPCV'13:\n  The 17th International Conference on Image Processing, Computer Vision,\n  & Pattern Recognition\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/ipcv13\n\no MSV'13:\n  The 10th International Conference on Modeling, Simulation and\n  Visualization Methods\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/msv13\n\no PDPTA'13:\n  The 19th International Conference on Parallel and Distributed\n  Processing Techniques and Applications\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/pdpta13\n\no SAM'13:\n  The 12th International Conference on Security and Management\n  http://sam.udmercy.edu/sam13/\n\no SERP'13:\n  The 11th International Conference on Software Engineering Research\n  and Practice\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/serp13\n\no SWWS'13:\n  The 12th International Conference on Semantic Web and Web Services\n  http://www.worldacademyofscience.org/worldcomp13/ws/conferences/swws13\n\nJuly 22-25, 2013, Las Vegas, USA.\n\nAll conferences listed above will be held simultaneously; ie, same location\nand dates.\n\n\nGENERAL INFORMATION:\n\nThe Congress will be composed of research presentations, keynote\nlectures, invited presentations, tutorials, panel discussions, and\nposter presentations. In recent past, keynote/tutorial/panel speakers\nhave included: Prof. David A. Patterson (pioneer, architecture, U. of\nCalifornia, Berkeley), Dr. K. Eric Drexler (known as Father of\nNanotechnology), Prof. John H. Holland (known as Father of Genetic\nAlgorithms; U. of Michigan), Prof. Ian Foster (known as Father of Grid\nComputing; U. of Chicago & ANL), Prof. Ruzena Bajcsy (pioneer, VR, U.\nof California, Berkeley), Prof. Barry Vercoe (Founding member of MIT\nMedia Lab, MIT), Dr. Jim Gettys (known as X-man, developer of X Window\nSystem, xhost; OLPC), Prof. John Koza (known as Father of Genetic\nProgramming, Stanford U.), Prof. Brian D. Athey (NIH Program Director,\nU. of Michigan), Prof. Viktor K. Prasanna (pioneer, U. of Southern\nCalifornia), Dr. Jose L. Munoz (NSF Program Director and Consultant),\nProf. Jun Liu (pioneer, Broad Institute of MIT & Harvard U.),\nProf. Lotfi A. Zadeh (Father of Fuzzy Logic), Dr. Firouz Naderi (Head,\nNASA Mars Exploration Program/2000-2005 and Associate Director, Project\nFormulation & Strategy, Jet Propulsion Lab, CalTech/NASA; Director,\nNASA's JPL Solar System Exploration), Prof. David Lorge Parnas (Fellow\nof IEEE, ACM, RSC, CAE, GI; Dr.h.c.: ETH Zurich, Prof. Emeritus,\nMcMaster U. and U. of Limerick), Prof. Eugene H. Spafford (Executive\nDirector, CERIAS and Professor, Purdue University), Dr. Sandeep\nChatterjee (Vice President & Chief Technology Officer, SourceTrace\nSystems, Inc.), Prof. Haym Hirsh (Rutgers University, New Jersey, USA\nand former director of Division of Information and Intelligent Systems,\nNational Science Foundation, USA), Dr. Flavio Villanustre (Vice-\nPresident, HPCC Systems), and many other distinguished speakers. To\nget a feeling about the conferences' atmosphere, see the 2012\ndelegates photos available at:\nhttp://infinitydempsey.smugmug.com/WorldComp\n\nAn important mission of The Congress is \"Providing a unique platform for\na diverse community of constituents composed of scholars, researchers,\ndevelopers, educators, and practitioners. The Congress makes concerted\neffort to reach out to participants affiliated with diverse entities\n(such as: universities, institutions, corporations, government agencies,\nand research centers/labs) from all over the world. The congress also\nattempts to connect participants from institutions that have teaching as\ntheir main mission with those who are affiliated with institutions that\nhave research as their main mission. The congress uses a quota system to\nachieve its institution and geography diversity objectives.\"\n\nOne main goal of the congress is to assemble a spectrum of affiliated\nresearch conferences, workshops, and symposiums into a coordinated\nresearch meeting held in a common place at a common time. This model\nfacilitates communication among researchers in different fields of\ncomputer science, computer engineering, and applied computing. The\nCongress also encourages multi-disciplinary and inter-disciplinary\nresearch initiatives; ie, facilitating increased opportunities for\ncross-fertilization across sub-disciplines.\n\n\nCONTACT:\n\nInquiries should be sent to: sc@world-comp.org\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nThis email was sent to:  foaad@calpoly.edu \n\nTo opt out of this email list: \nhttp://world-comp.org/cgi-bin/rm/full.cgi?08696a75-4b61-49a8-bc69-dce167aa057d \n\n", "name": "World Congress in Computer Science, Computer Engineering, and Applied Computing", "location": "Las Vegas, USA", "submission_date": "April 20, 2013", "notification_date": "May 11, 2013", "conference_date": "July 22-25, 2013"}]